      ******************************************************************
      *                                                                *
      *       AQCK0003   Constantes de erros para o Banka (MSGQ)       *
      *                                                                *
      ******************************************************************
       01  AQCK0003-CONSTANTES.
      * PS00001-Erro no número de cliente
           05 AQCK0003-ERR-LOGIN             PIC  X(07) VALUE 'AQ00001'.
      * PS00001-ERRO NA CHAMADA AO MODULO DE LOGIN
           05 AQCK0003-CALL-AQB00900         PIC  X(07) VALUE 'AQ00002'.
