      *****************************************************************
      * NOME:      AQCP0900                                           *
      * DESCRICAO: FAZ LOGIN (PROGRAMAS BATCH)                        *
      *****************************************************************
      ***********************************************************
       AQCP0900-FORMATA-BATCH.
      *
            INITIALIZE                         AQCL0900-DATA.
      **R   INITIALIZE                         PSCW5040-DATA.
            MOVE WS-PROGNAME                TO AQCL0900-PGMC.
            MOVE PSCK0002-TTR-VAZIO         TO AQCL0900-TTR.
            MOVE WS-PROGNAME                TO AQCL0900-JOBNC.
            MOVE WS-PROGNAME                TO AQCL0900-USERC.
            MOVE WS-PROGNAME                TO AQCL0900-PGMQC.
            MOVE PSCK0002-ESTR-NEXE         TO AQCL0900-ESTR.
            MOVE PSCK0002-APTR-APL          TO AQCL0900-APTR.
      **R   MOVE PSCK0002-HCLI-VMSG         TO AQCL0900-HCLI.
      **R   MOVE PSCK0002-VNCR-NVAL         TO AQCL0900-VNCR.

            MOVE AQCW0100-AT-CBAN           TO AQCL0900-AT-CBAN .
            MOVE AQCW0100-AT-CBAN           TO AQCL0900-AT-CBAN .
            MOVE AQCW0100-AT-BALM           TO AQCL0900-AT-BALM .
            MOVE AQCW0100-AT-DTOP           TO AQCL0900-AT-DTOP .
            MOVE AQCW0100-AT-CMOE           TO AQCL0900-AT-CMOE .
            MOVE AQCW0100-AT-DEBUG          TO AQCL0900-AT-DEBUG.
      *
       AQCP0900-FORMATA-BATCH-EXIT.
           EXIT.
