      ******************************************************************
      *  APLICAÇÃO:        ARQUITECTURA                               **
      *  MÓDULO:           PARAMETROS                                 **
      *  FUNÇÃO:           CONVERSAO DE DATAS                         **
      *  PROGRAMA:         AQCP0005.                                  **
      *  CRIACAO:          2012.01.02                                 **
      *  AUTOR:            ANTONIO RODRIGUES                          **
      *  DESCRIÇÃO:        CONVERTE DATA DE X(10) PARA 9(08)          **
      *                    E VICE-VERSA                               **
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S           **
      *          *        *        *                                  **
      ******************************************************************
      *    CONVERTE DATA NUMERICO DE 8 PARA FORMATO DATETIME           *
      ******************************************************************
       AQCP0005-CONV-DT8-DTTIME.
      *
           MOVE AQCW0005-DT98-A           TO AQCW0005-DTTIME-A.
           MOVE AQCW0005-DT98-M           TO AQCW0005-DTTIME-M.
           MOVE AQCW0005-DT98-D           TO AQCW0005-DTTIME-D.
      *
       AQCP0005-CONV-DT8-DTTIME-EXIT.
           EXIT.
      *
      ******************************************************************
      *    CONVERTE DATA ALFANUMERICO DE 10 POSICOES PARA NUMERICO DE 8*
      ******************************************************************
       AQCP0005-CONV-DT10INDT8.
      *
           MOVE AQCW0005-DTX10-A           TO AQCW0005-DT98-A.
           MOVE AQCW0005-DTX10-M           TO AQCW0005-DT98-M.
           MOVE AQCW0005-DTX10-D           TO AQCW0005-DT98-D.
      *
       AQCP0005-CONV-DT10INDT8-EXIT.
           EXIT.
      *
      ******************************************************************
      *    CONVERTE DATA NUMERICO 8 POSICOES PARA ALFANUMERICO DE 10 P *
      ******************************************************************
       AQCP0005-CONV-DT8INDT10.
      *
           IF AQCW0005-DT98 = 0
              MOVE 0001                    TO AQCW0005-DTX10-A
              MOVE 01                      TO AQCW0005-DTX10-M
              MOVE 01                      TO AQCW0005-DTX10-D
           ELSE
              MOVE AQCW0005-DT98-A         TO AQCW0005-DTX10-A
              MOVE AQCW0005-DT98-M         TO AQCW0005-DTX10-M
              MOVE AQCW0005-DT98-D         TO AQCW0005-DTX10-D
           END-IF.
      *
       AQCP0005-CONV-DT8INDT10-EXIT.
           EXIT.
      ******************************************************************
      *    CONVERTE TIMESTAMP PARA TIMESTAMP FORMATO SQLSERVER         *
      ******************************************************************
       AQCP0005-CONV-DTTIME-SQL.
      *
           IF AQCW0005-DTTIME-IA = 0001 OR
              AQCW0005-DTTIME-IA = 0000
             MOVE 1753               TO AQCW0005-DTTIME-IA
             MOVE 01                 TO AQCW0005-DTTIME-IM
             MOVE 01                 TO AQCW0005-DTTIME-ID
           END-IF.

           MOVE AQCW0005-DTTIME-IA   TO AQCW0005-DTTIME-A.
           MOVE AQCW0005-DTTIME-IM   TO AQCW0005-DTTIME-M.
           MOVE AQCW0005-DTTIME-ID   TO AQCW0005-DTTIME-D.
           MOVE AQCW0005-DTTIME-IH   TO AQCW0005-DTTIME-H.
           MOVE AQCW0005-DTTIME-IMN  TO AQCW0005-DTTIME-MN.
           MOVE AQCW0005-DTTIME-IS   TO AQCW0005-DTTIME-S.
           MOVE AQCW0005-DTTIME-IMS  TO AQCW0005-DTTIME-MS.
           MOVE '-'                  TO FILLER1.
           MOVE '-'                  TO FILLER2.
           MOVE SPACES               TO FILLER3.
           MOVE ':'                  TO FILLER4.
           MOVE ':'                  TO FILLER5.
           MOVE '.'                  TO FILLER6.
      *
       AQCP0005-CONV-DTTIME-SQL-EXIT.
           EXIT.
      *
      ******************************************************************
      *    CONVERTE TIMESTAMP PARA TIMESTAMP FORMATO SQLSERVER         *
      *    A PARTIR DE DATA X(10)                                      *
      ******************************************************************
       AQCP0005-CONV-DT10-DTTIME.
      *
           IF AQCW0005-DTX10-A = 0001 OR
              AQCW0005-DTX10-A = 0000
             MOVE 1753               TO AQCW0005-DTX10-A
             MOVE 01                 TO AQCW0005-DTX10-M
             MOVE 01                 TO AQCW0005-DTX10-D
           END-IF.

           MOVE AQCW0005-DTX10-A     TO AQCW0005-DTTIME-A.
           MOVE AQCW0005-DTX10-M     TO AQCW0005-DTTIME-M.
           MOVE AQCW0005-DTX10-D     TO AQCW0005-DTTIME-D.
           MOVE ZEROES               TO AQCW0005-DTTIME-H.
           MOVE ZEROES               TO AQCW0005-DTTIME-MN.
           MOVE ZEROES               TO AQCW0005-DTTIME-S.
           MOVE ZEROES               TO AQCW0005-DTTIME-MS.
           MOVE '-'                  TO FILLER1.
           MOVE '-'                  TO FILLER2.
           MOVE SPACES               TO FILLER3.
           MOVE ':'                  TO FILLER4.
           MOVE ':'                  TO FILLER5.
           MOVE '.'                  TO FILLER6.
      *
       AQCP0005-CONV-DT10-DTTIME-EXIT.
           EXIT.
      *
