      *****************************************************************
      * NOME:      AQCW0015                                           *
      * DESCRICAO: VARIAVEIS DO PROCEDURE DE TRATAMENTO DE DEBUG      *
      * CRICAO:    2011-01-02                                         *
      * AUTOR:     ANTONIO RODRIGUES                                  *
      *===============================================================*
      *****************************************************************
      *    AQCW0015 - TRATAMENTO DE DEBUG                             *
      *****************************************************************
       01  AQCW0015-DATA.
           05 AQCW0015-PROGRAMA.
              10 AQCW0015-CAPLIC           PIC  X(02) VALUE SPACES.
              10 FILLER                    PIC  X(01) VALUE 'I'.
              10 AQCW0015-COPCAO           PIC  X(03) VALUE SPACES.
              10 AQCW0015-CACCAO           PIC  X(02) VALUE SPACES.
                 88 AQCW0015-VISUALIZACAO    VALUE '02'.
                 88 AQCW0015-CRIACAO         VALUE '04'.
                 88 AQCW0015-MODIFICACAO     VALUE '06'.
                 88 AQCW0015-ANULACAO        VALUE '08'.
                 88 AQCW0015-CONSULTALISTA   VALUE '00'.
              10 FILLER                    PIC  X(02) VALUE '  '.
           05 AQCW0015-CALLER-ID           PIC  X(30) VALUE SPACES.
           05 AQCW0015-CAMPOS-CHAVE.
              10 AQCW0015-CAMPOS         OCCURS 10 TIMES.
                 15 AQCW0015-CAMPO-NM      PIC  X(30).
                 15 AQCW0015-CAMPO-VLR     PIC  X(50).
