      *****************************************************************
      * NOME:      AQCW0005                                           *
      * DESCRICAO: VARIAVEIS DO PROCEDURE DE CONVERSAO DE DATAS       *
      * CRICAO:    2011-01-02                                         *
      * AUTOR:     ANTONIO RODRIGUES                                  *
      *===============================================================*
      *****************************************************************
      *    AQCW0005 - CONVERTE DATA X(10) PARA 9(8) E VICE VERSA      *
      *****************************************************************
       01 AQCW0005-DATA.
          05 AQCW0005-DTX10.
             10 AQCW0005-DTX10-A          PIC  9(04) VALUE ZEROES.
             10 FILLER                    PIC  X(01) VALUE '-'.
             10 AQCW0005-DTX10-M          PIC  9(02) VALUE ZEROES.
             10 FILLER                    PIC  X(01) VALUE '-'.
             10 AQCW0005-DTX10-D          PIC  9(02) VALUE ZEROES.
          05 AQCW0005-DT98                PIC  9(08) VALUE ZEROES.
          05 AQCW0005-DT98-O REDEFINES AQCW0005-DT98.
             10 AQCW0005-DT98-A           PIC  9(04).
             10 AQCW0005-DT98-M           PIC  9(02).
             10 AQCW0005-DT98-D           PIC  9(02).
          05 AQCW0005-DTTIME              PIC  X(23) VALUE ZEROES.
          05 AQCW0005-DTTIME-O REDEFINES AQCW0005-DTTIME.
             10 AQCW0005-DTTIME-A         PIC  X(04) VALUE ZEROES.
             10 FILLER1                   PIC  X(01) VALUE '-'.
             10 AQCW0005-DTTIME-M         PIC  X(02) VALUE ZEROES.
             10 FILLER2                   PIC  X(01) VALUE '-'.
             10 AQCW0005-DTTIME-D         PIC  X(02) VALUE ZEROES.
             10 FILLER3                   PIC  X(01) VALUE ' '.
             10 AQCW0005-DTTIME-H         PIC  X(02) VALUE ZEROES.
             10 FILLER4                   PIC  X(01) VALUE ':'.
             10 AQCW0005-DTTIME-MN        PIC  X(02) VALUE ZEROES.
             10 FILLER5                   PIC  X(01) VALUE ':'.
             10 AQCW0005-DTTIME-S         PIC  X(02) VALUE ZEROES.
             10 FILLER6                   PIC  X(01) VALUE '.'.
             10 AQCW0005-DTTIME-MS        PIC  X(03) VALUE ZEROES.
          05 AQCW0005-DTTIME-IN           PIC  X(23) VALUE ZEROES.
          05 FILLER REDEFINES AQCW0005-DTTIME-IN.
             10 AQCW0005-DTTIME-IA        PIC  X(04) VALUE ZEROES.
             10 FILLERI1                  PIC  X(01) VALUE '-'.  .
             10 AQCW0005-DTTIME-IM        PIC  X(02) VALUE ZEROES.
             10 FILLERI2                  PIC  X(01) VALUE '-'.  .
             10 AQCW0005-DTTIME-ID        PIC  X(02) VALUE ZEROES.
             10 FILLERI3                  PIC  X(01) VALUE SPACES.
             10 AQCW0005-DTTIME-IH        PIC  X(02) VALUE ZEROES.
             10 FILLERI4                  PIC  X(01) VALUE ':'.
             10 AQCW0005-DTTIME-IMN       PIC  X(02) VALUE ZEROES.
             10 FILLERI5                  PIC  X(01) VALUE ':'.
             10 AQCW0005-DTTIME-IS        PIC  X(02) VALUE ZEROES.
             10 FILLERI6                  PIC  X(01) VALUE '.'.
             10 AQCW0005-DTTIME-IMS       PIC  X(03) VALUE ZEROES.
