       IDENTIFICATION DIVISION.
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
       PROGRAM-ID. ARB9070.
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                    WORKING STORAGE SECTION                     *
      ******************************************************************
      * CONSTANTES
      ******************************************************************
       01  WS-CONSTANTES.
           05 WS-PROGNAME               PIC  X(10) VALUE 'ARB9070'.
           05 WS-ARVT6200               PIC  X(10) VALUE 'ARVT6200'.
           05 WS-SYSTABLES              PIC  X(10) VALUE 'SYSTABLES'.
           05 WS-QCMDEXC                PIC  X(10) VALUE 'QCMDEXC'.
           05 WS-SAVEFILE               PIC  X(10) VALUE 'DB_BACKUP'.
      ******************************************************************
      * VARIAVEIS
      ******************************************************************
       01  WS-VARIAVEIS.
           05 WS-LIBRARY                PIC  X(10) VALUE SPACES.
           05 WS-TABLE-NAME             PIC  X(50) VALUE SPACES.
           05 WS-TABLE-SCHEMA           PIC  X(10) VALUE SPACES.
           05 WS-SYS-TABLE-NAME         PIC  X(10) VALUE SPACES.
           05 WS-IND                    PIC  9(03) VALUE ZEROES.
              88 WS-MAX-IND                        VALUE 298.
           05 WS-OBJ-LIST.
              10 WS-OBJ   OCCURS 298    PIC  X(11) VALUE SPACES.
           05 WS-COMMAND                PIC  X(4000).
           05 WS-LENGTH                 PIC S9(10)V9(05) COMP-3.
           05 WS-IBACKUP                PIC  X(01) VALUE SPACES.
              88 WS-PARA-INCLUIR                   VALUE 'S'.
              88 WS-PARA-EXCLUIR                   VALUE 'N'.
      ******************************************************************
      * COPYS
      ******************************************************************
           COPY AQCK0001.
           COPY AQCL0001.
           COPY AQCW0011.
           COPY AQCW0109.
           COPY VIAL0015.
      ******************************************************************
      * DB2
      ******************************************************************
           EXEC SQL INCLUDE SQLCA               END-EXEC.
           EXEC SQL INCLUDE ARCD6200            END-EXEC.

           EXEC SQL
                DECLARE CURSOR_SYSTABLES CURSOR FOR
                SELECT TABLE_NAME
                     , TABLE_SCHEMA
                     , SYSTEM_TABLE_NAME
                  FROM SYSTABLES
                 WHERE SYSTEM_TABLE_SCHEMA = :WS-LIBRARY
                   AND TABLE_TYPE          = "T"
                       ORDER BY 1
           END-EXEC.

      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'FIM DA WORKING-STORAGE'.
      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
      *                        LINKAGE SECTION                         *
      ******************************************************************
           COPY AQCW0009.
      ******************************************************************
       PROCEDURE DIVISION USING AQCW0009-DATA.
      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
       0000-MAINLINE.
      ******************************************************************
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           IF AQCW0009-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2000-PROC-PROGRAMA-EXIT
           END-IF.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.

       0000-MAINLINE-EXIT.
           GOBACK.

      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************
           MOVE '1000-INICIO-PROGRAMA     ' TO VIAL0015-CALLER-ID

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM AQCP0100-REG-INICIO
                 THRU AQCP0100-REG-INICIO-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM AQCP0100-OBT-DADOS-ARQ
                 THRU AQCP0100-OBT-DADOS-ARQ-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM 1100-OBTEM-AMBIENTE
                 THRU 1100-OBTEM-AMBIENTE-EXIT
           END-IF.

       1000-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       1100-OBTEM-AMBIENTE.
      ******************************************************************
           MOVE '1100-OBTEM-AMBIENTE      ' TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE ARCL2205-DATA.

           MOVE VIAK0002-APLIC-AT           TO ARCL2205-CAPLIC.
           MOVE VIAK0002-PARAM-AMBB         TO ARCL2205-CPARAM.

           PERFORM CALL-ARM2206
              THRU CALL-ARM2206-EXIT.

           IF ETCL0002-SEM-ERROS
              MOVE ARCL2205-GVALOR2         TO WS-LIBRARY
           ELSE
              SET  AQCW0009-RCODE-APL       TO TRUE
              MOVE VIAL0015-CALLER-ID       TO AQCW0100-PARAGRAPH
              MOVE ARCL2205-ROTINA          TO AQCW0100-DESC1 ( 1:)
              MOVE ARCL2205-CAPLIC          TO AQCW0100-DESC1 (11:)
              MOVE ARCL2205-CPARAM          TO AQCW0100-DESC1 (14:)
              MOVE ETCL0002-GINFO-ERRO      TO AQCW0100-DESC2
              MOVE ETCL0002-IND-ERROS       TO AQCW0100-DESC3 ( 1:)
              MOVE ETCL0002-NR-ERRO         TO AQCW0100-DESC3 ( 4:)
              MOVE ETCL0002-CAPLIC-ERRO     TO AQCW0100-DESC3 ( 9:)
              MOVE ETCL0002-ST-ERRO         TO AQCW0100-DESC3 (12:)
              PERFORM AQCP0100-ESCREVE-MSG
                 THRU AQCP0100-ESCREVE-MSG-EXIT
           END-IF.

       1100-OBTEM-AMBIENTE-EXIT.
           EXIT.

      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************
           MOVE '2000-PROC-PROGRAMA       ' TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2100-OPEN-CURSOR
              THRU 2100-OPEN-CURSOR-EXIT.

           IF AQCW0009-SEM-ERROS
              PERFORM 2200-FETCH-CURSOR
                 THRU 2200-FETCH-CURSOR-EXIT

              MOVE ZEROES                   TO WS-IND

      * O SAVOBJ so pode receber 300 objectos. O WS-MAX-IND = 298 porque
      * sao adicionadas a SYSTABLES e SYSCOLUMNS na lista de objectos.
              PERFORM 2300-TRATAR-CURSOR
                 THRU 2300-TRATAR-CURSOR-EXIT
                      UNTIL WS-MAX-IND
                         OR NOT DB2-OK
                         OR NOT AQCW0009-SEM-ERROS

              EXEC SQL
                   CLOSE CURSOR_SYSTABLES
              END-EXEC
           END-IF.

           IF AQCW0009-SEM-ERROS
              IF WS-IND NOT EQUAL ZEROES
                 PERFORM 2500-EXECUTAR-SAVEFILE
                    THRU 2500-EXECUTAR-SAVEFILE-EXIT
              END-IF
           END-IF.

       2000-PROC-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2100-OPEN-CURSOR.
      ******************************************************************
           MOVE '2100-OPEN-CURSOR         ' TO VIAL0015-CALLER-ID

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

      *    INITIALIZE SYSTABLES.

           EXEC SQL
                OPEN CURSOR_SYSTABLES
           END-EXEC.

           MOVE WS-SYSTABLES                TO AQCW0011-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE AQCW0011-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE AQCW0011-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2100-OPEN-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2200-FETCH-CURSOR.
      ******************************************************************
           MOVE '2200-FETCH-CURSOR        ' TO VIAL0015-CALLER-ID

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
                FETCH CURSOR_SYSTABLES
                 INTO :WS-TABLE-NAME
                    , :WS-TABLE-SCHEMA
                    , :WS-SYS-TABLE-NAME
           END-EXEC.

           MOVE WS-SYSTABLES                TO AQCW0011-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
           WHEN DB2-NOTFND
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE AQCW0011-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE AQCW0011-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2200-FETCH-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2300-TRATAR-CURSOR.
      ******************************************************************
           MOVE '2300-TRATAR-CURSOR       ' TO VIAL0015-CALLER-ID

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2400-VALIDAR-TABELA
              THRU 2400-VALIDAR-TABELA-EXIT

           IF AQCW0009-SEM-ERROS AND WS-PARA-INCLUIR
              ADD  1                        TO WS-IND
              MOVE WS-SYS-TABLE-NAME        TO WS-OBJ (WS-IND)
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM 2200-FETCH-CURSOR
                 THRU 2200-FETCH-CURSOR-EXIT
           END-IF.

       2300-TRATAR-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2400-VALIDAR-TABELA.
      ******************************************************************
           MOVE '2400-VALIDAR-TABELA      ' TO VIAL0015-CALLER-ID

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

      * AS ENTRADAS NA ART62 CONTEM AS EXCLUSOES DO BACKUP
      * TODAS AS OUTRAS (NOTFND) SAO PARA INCLUIR NO SAVEFILE

           INITIALIZE                       DCLARCD6200.
           MOVE WS-TABLE-NAME               TO ARCD6200-GTABELA.
      *    MOVE WS-SYS-TABLE-NAME           TO ARCD6200-GOBJECT.
      *    MOVE WS-TABLE-SCHEMA             TO ARCD6200-GBIBLIO.

           EXEC SQL
                SELECT GTABELA
                     , GOBJECT
                     , GBIBLIO
                     , IBACKUP
                     , CUSERID
                     , HTIMEST
                  INTO :ARCD6200-GTABELA
                     , :ARCD6200-GOBJECT
                     , :ARCD6200-GBIBLIO
                     , :ARCD6200-IBACKUP
                     , :ARCD6200-CUSERID
                     , :ARCD6200-HTIMEST
                  FROM ARVT6200
                 WHERE GTABELA = :ARCD6200-GTABELA
      *            AND GOBJECT = :ARCD6200-GOBJECT
      *            AND GBIBLIO = :ARCD6200-GBIBLIO
           END-EXEC.

           MOVE WS-ARVT6200                 TO AQCW0011-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
      * SIGNIFICA QUE A TABELA EH PARA EXCLUIR DOS BACKUPS
           WHEN DB2-OK
                SET  WS-PARA-EXCLUIR        TO TRUE

      * AS QUE NAO ESTAO PARAMETRIZADAS EH PARA FAZER BACKUP
           WHEN DB2-NOTFND
                SET  WS-PARA-INCLUIR        TO TRUE

           WHEN OTHER
                SET  WS-PARA-EXCLUIR        TO TRUE
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE AQCW0011-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE AQCW0011-SQLCODE       TO AQCW0100-SQLCODE
                MOVE WS-TABLE-NAME          TO AQCW0100-ACCESS-KEY
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2400-VALIDAR-TABELA-EXIT.
           EXIT.

      ******************************************************************
       2500-EXECUTAR-SAVEFILE.
      ******************************************************************
           MOVE '2500-EXECUTAR-SAVEFILE   ' TO VIAL0015-CALLER-ID

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           STRING 'SAVOBJ OBJ(' FUNCTION TRIM( WS-OBJ-LIST )
                 ' SYSTABLES SYSCOLUMNS) LIB(' WS-LIBRARY ')'
                 ' DEV(*SAVF) CLEAR(*ALL) SAVF('
                 FUNCTION TRIM( WS-LIBRARY ) '/' WS-SAVEFILE ')'
                 DELIMITED BY SIZE        INTO WS-COMMAND.

           COMPUTE WS-LENGTH =
                   FUNCTION LENGTH( FUNCTION TRIM( WS-COMMAND ) ).

           CALL WS-QCMDEXC USING WS-COMMAND, WS-LENGTH
             ON EXCEPTION
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE WS-COMMAND             TO AQCW0100-DESC1
                MOVE WS-LENGTH              TO AQCW0100-DESC2
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-CALL.

           IF AQCW0100-AT-DEBUG-SIM
              MOVE VIAL0015-CALLER-ID       TO AQCW0100-PARAGRAPH
              MOVE WS-COMMAND               TO VIAL0015-CAMPOS-CHAVE
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

       2500-EXECUTAR-SAVEFILE-EXIT.
           EXIT.

      ******************************************************************
       3000-FIM-PROGRAMA.
      ******************************************************************
           MOVE '3000-FIM-PROGRAMA        ' TO VIAL0015-CALLER-ID

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

      * Processos finais
            PERFORM AQCP0009-TRATA-RCODE
               THRU AQCP0009-TRATA-RCODE-EXIT.

            PERFORM AQCP0002-TRATA-SYNCPOINT
               THRU AQCP0002-TRATA-SYNCPOINT-EXIT.

      * ESCREVE ESTATISTICAS
           MOVE '***** ESTATISTICAS ******' TO VIAL0015-CALLER-ID
           MOVE 'OBJETOS NO SAVEFILE'       TO VIAL0015-CAMPO-NM (1)
           MOVE  WS-IND                     TO VIAL0015-CAMPO-VLR(1)
           PERFORM VIAP0015-TRATA-DEBUG
              THRU VIAP0015-TRATA-DEBUG-EXIT.

           PERFORM AQCP0100-REG-FIM
              THRU AQCP0100-REG-FIM-EXIT.

       3000-FIM-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
           EXEC SQL INCLUDE AQCP0002 END-EXEC.
      ******************************************************************
           COPY AQCP0009.
           COPY AQCP0011.
           COPY AQCP0109.
           COPY VIAP0015.
      ******************************************************************
