       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARB9065.
      ******************************************************************
      *   Expurgo VIAFMAILH
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
      *
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
      *
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FVIA-REM-FILE
           ASSIGN   TO DISK-VIFMAH
                                FILE STATUS  IS VIAW0011-FSTATUS.
      *
       DATA DIVISION.
      ******************************************************************
      *              D A T A   D I V I S I O N                         *
      ******************************************************************
       FILE SECTION.
       FD  FVIA-REM-FILE.
       01  VIFMAH-REG.
            05 CSUBJECT-REM PIC X(200).
            05 CBODY-REM PIC X(8000).
            05 CNOME-REM PIC X(80).
            05 CFROM-REM PIC X(100).
            05 CTO-REM PIC X(500).
            05 CCC-REM PIC X(500).
            05 CBCC-REM PIC X(500).
            05 CASS-REM PIC X(200).
            05 CCSS-REM PIC X(20).
            05 CSITU-REM PIC X(02).
            05 CNATTACH-REM PIC X(30).
            05 CBATTACH-REM PIC X(30).
            05 CUSERIDC-REM PIC X(20).
            05 HTIMESTC-REM PIC X(26).
            05 CUSERID-REM PIC X(20).
            05 HTIMEST-REM PIC X(26).
            05 CCHAVE-REM PIC X(50).
      *
      ******************************************************************
      *                  WORKING STORAGE SECTION                       *
      ******************************************************************
       WORKING-STORAGE SECTION.
      *
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE ARB9065        '.
      ******************************************************************
      *                  MENSAGENS                                     *
      ******************************************************************
      *
      *
      ******************************************************************
      *                  FILE STATUS                                   *
      ******************************************************************
      *
      *
      ******************************************************************
      *                  STATUS DAS TABELAS                            *
      ******************************************************************
      *
      *
      ******************************************************************
      *                  CONSTANTES                                    *
      ******************************************************************
       01  WS-CONSTANTES.
           05 WS-PROGNAME                  PIC  X(10) VALUE 'ARB9065'.
           05 WS-CON-TABLE-CRITERIA-ID     PIC  X(20) VALUE
                                                    'VIAFMAILH'.
           05 CON-VIFMAH
                                           PIC  X(10) VALUE 'VIFMAH'.
      ******************************************************************
      *           VARIAVEIS                                            *
      ******************************************************************
       01  WS-VARIAVEIS.
           05 WS-PARAGRAPH-NAME            PIC  X(30) VALUE SPACES.
           05 WS-TOTAL-READ                PIC  9(10) VALUE ZEROES.
           05 WS-TOTAL-REMOVE              PIC  9(10) VALUE ZEROES.
           05 WS-TOTAL-KEEP                PIC  9(10) VALUE ZEROES.
           05 WS-CURRENT-DATE              PIC  X(10) VALUE SPACES.
           05 WS-CURRENT-DATE-R REDEFINES WS-CURRENT-DATE.
              10 WS-CURRENT-DATE-YEAR      PIC  X(04).
              10 FILLER                    PIC  X(01).
              10 WS-CURRENT-DATE-MONTH     PIC  X(02).
              10 FILLER                    PIC  X(01).
              10 WS-CURRENT-DATE-DAY       PIC  X(02).
           05 WS-DAT-INPUT1                PIC  9(08) VALUE ZEROES.
           05 WS-DAT-RES                   PIC  9(08) VALUE ZEROES.
           05 WS-DAT-RES-ED                PIC  X(10) VALUE SPACES.
      *
           05 WS-REM-DAYS                  PIC S9(04) COMP-3
                                               VALUE ZEROS.
           05 WS-REMOVE-DATE               PIC  X(10) VALUE SPACES.
           05 WS-REMOVE-DATE-R REDEFINES WS-REMOVE-DATE.
              10 WS-REMOVE-DATE-YEAR       PIC  X(04).
              10 FILLER                    PIC  X(01).
              10 WS-REMOVE-DATE-MONTH      PIC  X(02).
              10 FILLER                    PIC  X(01).
              10 WS-REMOVE-DATE-DAY        PIC  X(02).
      *
       01  WS-PRAZOS.
           05 WS-COD-PRZ                   PIC  X(03).
           05 FILLER REDEFINES WS-COD-PRZ.
              10 WS-COD-PRZ-CD             PIC  X(01).
              10 WS-COD-PRZ-QT             PIC  9(02).
           05 WS-PRZ-A                     PIC  9(01).
           05 WS-PRZ-M                     PIC  9(02).
           05 WS-PRZ-D                     PIC  9(03).
           05 WS-PRAZO-MESES               PIC  9(05).
           05 WS-PRAZO-ANOS                PIC  9(05).
      *
      ******************************************************************
      *              DECLARACOES DE COPYBOOKS                          *
      ******************************************************************
           EXEC SQL INCLUDE VIACDMAIL END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *
       COPY VIAL0001.
       COPY VIAL0055.
      *
       COPY VIAW0011.
       COPY VIAW0012.
       COPY VIAL0015.
       COPY VIAW0030.
       COPY AQCW0109.
      *COPY AQCW0009.
       COPY VIAL0100.
       COPY ETCL1000.
       COPY VIATK001.
      *
      *--------------------------------------------------------------
      *              DECLARACOES DE CURSORES DB2                     *
      *--------------------------------------------------------------
      *
           EXEC SQL
                DECLARE CURVCT01 CURSOR FOR
                 SELECT
                    CSUBJECT
                  , CBODY
                  , CNOME
                  , CFROM
                  , CTO
                  , CCC
                  , CBCC
                  , CASS
                  , CCSS
                  , CSITU
                  , CNATTACH
                  , CBATTACH
                  , CUSERIDC
                  , HTIMESTC
                  , CUSERID
                  , HTIMEST
      *           , CCHAVE
                  , CURRENT DATE - :WS-REM-DAYS DAYS
                 FROM VIAFMAILH
      *          WHERE HTIMEST < :VIACDMAIL-HTIMEST
                 WHERE HTIMEST <
                       CURRENT DATE - :WS-REM-DAYS DAYS
           END-EXEC.
      *
       01  FILLER                          PIC X(40) VALUE
            'FIM DA WORKING-STORAGE ARB9065        '.
      *
      ******************************************************************
      *                    LINKAGE SECTION                             *
      ******************************************************************
      *COPY VIAL0005.
       LINKAGE SECTION.
       COPY AQCW0009.
      *
      ******************************************************************
      *                  PROCEDURE DIVISION                            *
      ******************************************************************
      *    EXEC SQL INCLUDE VIAP0014 END-EXEC.
       PROCEDURE DIVISION USING AQCW0009-DATA.
      *
      ******************************************************************
      *    PROCESSO                                                    *
      ******************************************************************
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.
      *
           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.
      *
           PERFORM 3000-FIM-PROGRAMA
              THRU 3099-FIM-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           GOBACK.
      *
      ******************************************************************
      *                  1000-INICIO-PROGRAMA                          *
      ******************************************************************
       1000-INICIO-PROGRAMA.
      *
           MOVE '1000-INICIO-PROGRAMA'     TO WS-PARAGRAPH-NAME
      *
           SET  VIAW0012-SEM-ERROS
                VIAL0002-SEM-ERROS         TO TRUE.
           MOVE ZEROES                     TO VIAL0100-RCODE
                                              AQCW0009-RCODE
                                              WS-TOTAL-READ
                                              WS-TOTAL-REMOVE
                                              WS-TOTAL-KEEP.
      *
           IF VIAW0012-SEM-ERROS
              PERFORM AQCP0100-REG-INICIO
                 THRU AQCP0100-REG-INICIO-EXIT
           END-IF.
      *
           IF VIAW0012-SEM-ERROS
              PERFORM AQCP0100-OBT-DADOS-ARQ
                 THRU AQCP0100-OBT-DADOS-ARQ-EXIT
           END-IF.
      *
      * OPEN FICHEIRO DE OUTPUT (REMOVE)
           OPEN EXTEND FVIA-REM-FILE
      *
           PERFORM 9030-FSCHECK
              THRU 9039-FSCHECK-EXIT.
      *
           IF NOT FS-OK
              SET  VIAW0030-FILE-ERROR     TO TRUE
              MOVE WS-PROGNAME             TO VIAW0030-PGMNAME
              MOVE WS-PARAGRAPH-NAME       TO VIAW0030-PARAGRAPH-NAME
              MOVE CON-VIFMAH              TO VIAW0030-FILE-NAME
              MOVE VIAW0011-FSTATUS        TO VIAW0030-FILE-STATUS
              MOVE SPACES                  TO VIAW0030-FILE-KEY
              MOVE 'ERRO NO OPEN DO'       TO VIAW0030-DESC1
              MOVE 'FICHEIRO DE OUTPUT'    TO VIAW0030-DESC2
      *
              PERFORM VIAP0030-ESCREVE-SPOOL
                 THRU VIAP0030-ESCREVE-SPOOL-EXIT
      *
              PERFORM 9990-ABEND
                 THRU 9999-ABEND-EXIT
      *
              IF VIAL0100-RCODE = 16
                 MOVE 2 TO AQCW0009-RCODE
              END-IF
      *
           END-IF.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *
      ******************************************************************
      *                  2000-PROC-PROGRAMA                            *
      ******************************************************************
       2000-PROC-PROGRAMA.
      *
           IF VIAW0012-SEM-ERROS
              PERFORM 2100-OPEN
                 THRU 2199-OPEN-EXIT
           END-IF.
      *
           IF VIAW0012-SEM-ERROS
              PERFORM 2200-FETCH
                 THRU 2299-FETCH-EXIT
           END-IF.
      *
           PERFORM 2300-TRATA-REGISTO
              THRU 2399-TRATA-REGISTO-EXIT
             UNTIL NOT VIAW0012-SEM-ERROS
                OR DB2-NOTFND.
      *
           IF VIAW0012-SEM-ERROS
              PERFORM 2900-CLOSE
                 THRU 2999-CLOSE-EXIT
           END-IF.
      *
       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *
      *--------------------------------------------------------------
      *                     2100-OPEN
      *--------------------------------------------------------------
       2100-OPEN.
      *
           MOVE '2100-OPEN'                TO WS-PARAGRAPH-NAME
      *
           MOVE WS-CON-TABLE-CRITERIA-ID
             TO VIAL0055-TABLE-CRITERIA-ID.
      *
           PERFORM VIAP0055-CRIT-EXPURGO
              THRU VIAP0055-CRIT-EXPURGO-EXIT.
      *
           IF NOT VIAL0002-SEM-ERROS
              SET  VIAW0030-DB2-ERROR      TO TRUE
              SET  VIAL0002-ABEND-DB2      TO TRUE
              MOVE WS-PROGNAME             TO VIAW0030-PGMNAME
              MOVE WS-PARAGRAPH-NAME       TO VIAW0030-PARAGRAPH-NAME
              MOVE VIAL0002-TABLE-NAME     TO VIAW0030-TABLE-NAME
              MOVE VIAL0002-SQLCODE        TO VIAW0030-SQLCODE
              MOVE WS-CON-TABLE-CRITERIA-ID
                                           TO VIAW0030-ACCESS-KEY
              MOVE 'ERRO NA OBTENCAO DO'   TO VIAW0030-DESC1
              MOVE 'CRITERIO DE EXPURGO'   TO VIAW0030-DESC2
      *
              PERFORM VIAP0030-ESCREVE-SPOOL
                 THRU VIAP0030-ESCREVE-SPOOL-EXIT
      *
              PERFORM 9990-ABEND
                 THRU 9999-ABEND-EXIT
      *
              IF VIAL0100-RCODE = 16
                 MOVE 2 TO AQCW0009-RCODE
              END-IF
      *
           END-IF.
      *
      *    PERFORM 2110-CALCULA-DATA
      *       THRU 2119-CALCULA-DATA-EXIT.
      *
           MOVE VIAL0055-REMOVE-DAYS TO WS-REM-DAYS.
      *
           EXEC SQL
              OPEN CURVCT01
           END-EXEC.
      *
           MOVE CON-VIFMAH                 TO VIAW0012-TABLE-NAME.
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           IF NOT DB2-OK
              SET  VIAW0030-DB2-ERROR
                   VIAW0012-ABEND-DB2      TO TRUE
              MOVE WS-PROGNAME             TO VIAW0030-PGMNAME
              MOVE WS-PARAGRAPH-NAME       TO VIAW0030-PARAGRAPH-NAME
              MOVE VIAW0012-TABLE-NAME     TO VIAW0030-TABLE-NAME
              MOVE VIAW0012-SQLCODE        TO VIAW0030-SQLCODE
              MOVE SPACES                  TO VIAW0030-ACCESS-KEY
              MOVE 'ERRO NO OPEN DO CURSOR DA'
                                           TO VIAW0030-DESC1
              MOVE 'TABELA DE FICHEIROS'   TO VIAW0030-DESC2
      *
              PERFORM VIAP0030-ESCREVE-SPOOL
                 THRU VIAP0030-ESCREVE-SPOOL-EXIT
      *
              PERFORM 9990-ABEND
                 THRU 9999-ABEND-EXIT
      *
              IF VIAL0100-RCODE = 16
                 MOVE 2 TO AQCW0009-RCODE
              END-IF
      *
           END-IF.
      *
       2199-OPEN-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2110-CALCULA-DATA
      *--------------------------------------------------------------
      *2110-CALCULA-DATA.
      *
      *    MOVE '2110-CALCULA-DATA.'       TO WS-PARAGRAPH-NAME
      *
      *    INITIALIZE ETCL1000-AREA-COMUNICACAO
      *                               REPLACING NUMERIC BY ZEROES
      *                               ALPHANUMERIC BY SPACES.
      *
      *    MOVE ZEROES                     TO WS-PRAZO-MESES
      *                                       WS-PRAZO-ANOS.
      *
      *    MOVE AQCW0100-AT-DTOP           TO WS-DAT-INPUT1.
      *    MOVE WS-DAT-INPUT1              TO ETCL1000-DAT-INPUT1.
      *    SET  ETCL1000-SUBTRAI-PRAZO     TO TRUE.
      *
      *    MOVE 'D'                        TO WS-COD-PRZ-CD.
      *    MOVE ZEROES                     TO WS-COD-PRZ-QT.
      *    MOVE SPACES                     TO ETCL1000-COD-PRZ.
      *    MOVE VIAL0055-REMOVE-DAYS       TO ETCL1000-PRZ-D.
      *
      *    IF VIAL0055-REMOVE-DAYS GREATER THAN 367
      *       COMPUTE WS-PRAZO-MESES = VIAL0055-REMOVE-DAYS / 30
      *       MOVE 'M'                     TO WS-COD-PRZ-CD
      *       MOVE WS-PRAZO-MESES          TO WS-COD-PRZ-QT
      *       MOVE WS-COD-PRZ              TO ETCL1000-COD-PRZ
      *       MOVE ZEROES                  TO ETCL1000-PRZ-D
      *    END-IF.
      *
      *    IF WS-PRAZO-MESES GREATER THAN 99
      *       COMPUTE WS-PRAZO-ANOS = WS-PRAZO-MESES / 12
      *       MOVE 'N'                     TO WS-COD-PRZ-CD
      *       MOVE WS-PRAZO-ANOS           TO WS-COD-PRZ-QT
      *       MOVE WS-COD-PRZ              TO ETCL1000-COD-PRZ
      *    END-IF.
      *
      *    PERFORM ETCP1000-ROTINA-DATAS
      *       THRU ETCP1000-EXIT.
      *
      *    IF NOT CALCULO-EFECTUADO
      *       SET  VIAW0030-DB2-ERROR
      *            VIAW0012-ABEND-DB2      TO TRUE
      *       MOVE WS-PROGNAME             TO VIAW0030-PGMNAME
      *       MOVE WS-PARAGRAPH-NAME       TO VIAW0030-PARAGRAPH-NAME
      *       MOVE 'ETR01000'              TO VIAW0030-TABLE-NAME
      *       MOVE ZEROES                  TO VIAW0030-SQLCODE
      *       MOVE SPACES                  TO VIAW0030-ACCESS-KEY
      *       MOVE 'ERRO NO CÁLCULO DO DIA '
      *                                    TO VIAW0030-DESC1
      *       MOVE 'ANTERIOR  '            TO VIAW0030-DESC2
      *
      *       PERFORM VIAP0030-ESCREVE-SPOOL
      *          THRU VIAP0030-ESCREVE-SPOOL-EXIT
      *
      *       PERFORM 9990-ABEND
      *          THRU 9999-ABEND-EXIT
      *
      *       IF VIAL0100-RCODE = 16
      *          MOVE 2 TO AQCW0009-RCODE
      *       END-IF
      *
      *    END-IF.
      *
      *    MOVE ETCL1000-DAT-RES-ED        TO WS-DAT-RES-ED.
      *    MOVE WS-DAT-RES-ED              TO VIACDMAIL-HTIMEST.
      *
      *2119-CALCULA-DATA-EXIT.
      *    EXIT.
      *
      *--------------------------------------------------------------
      *                     2200-FETCH
      *--------------------------------------------------------------
       2200-FETCH.
      *
           MOVE '2200-FETCH'               TO WS-PARAGRAPH-NAME
      *
           EXEC SQL
              FETCH CURVCT01
                 INTO
                       :VIACDMAIL-CSUBJECT
                     , :VIACDMAIL-CBODY
                     , :VIACDMAIL-CNOME
                     , :VIACDMAIL-CFROM
                     , :VIACDMAIL-CTO
                     , :VIACDMAIL-CCC
                     , :VIACDMAIL-CBCC
                     , :VIACDMAIL-CASS
                     , :VIACDMAIL-CCSS
                     , :VIACDMAIL-CSITU
                     , :VIACDMAIL-CNATTACH
                     , :VIACDMAIL-CBATTACH
                     , :VIACDMAIL-CUSERIDC
                     , :VIACDMAIL-HTIMESTC
                     , :VIACDMAIL-CUSERID
                     , :VIACDMAIL-HTIMEST
      *              , :VIACDMAIL-CCHAVE
                     , :WS-REMOVE-DATE
           END-EXEC.
      *
           MOVE CON-VIFMAH                 TO VIAW0012-TABLE-NAME.
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           EVALUATE TRUE
              WHEN DB2-OK
              WHEN DB2-NOTFND
                 CONTINUE
      *
              WHEN OTHER
                 SET  VIAW0030-DB2-ERROR
                      VIAW0012-ABEND-DB2   TO TRUE
                 MOVE WS-PROGNAME          TO VIAW0030-PGMNAME
                 MOVE WS-PARAGRAPH-NAME    TO VIAW0030-PARAGRAPH-NAME
                 MOVE VIAW0012-TABLE-NAME  TO VIAW0030-TABLE-NAME
                 MOVE VIAW0012-SQLCODE     TO VIAW0030-SQLCODE
                 MOVE SPACES               TO VIAW0030-ACCESS-KEY
                 MOVE 'ERRO NO FETCH DO CURSOR DA'
                                           TO VIAW0030-DESC1
                 MOVE 'TABELA DE FICHEIROS'
                                           TO VIAW0030-DESC2
      *
                 PERFORM VIAP0030-ESCREVE-SPOOL
                    THRU VIAP0030-ESCREVE-SPOOL-EXIT
      *
                 PERFORM 9990-ABEND
                    THRU 9999-ABEND-EXIT
      *
                 IF VIAL0100-RCODE = 16
                    MOVE 2 TO AQCW0009-RCODE
                 END-IF
      *
           END-EVALUATE.
      *
       2299-FETCH-EXIT.
           EXIT.
      *
      *--------------------------------------------------------------
      *            2300-TRATA-REGISTO
      *--------------------------------------------------------------
       2300-TRATA-REGISTO.
      *
           ADD  +1                         TO WS-TOTAL-READ
                                              WS-TOTAL-REMOVE.
      *
           IF VIAW0012-SEM-ERROS
              PERFORM 2500-WRITE-REM-FILE
                 THRU 2599-WRITE-REM-FILE-EXIT
           END-IF.
      *
           IF VIAW0012-SEM-ERROS
              PERFORM 2700-DELETE-RECORD
                 THRU 2799-DELETE-RECORD-EXIT
           END-IF.
      *
           IF VIAW0012-SEM-ERROS
              PERFORM 2200-FETCH
                 THRU 2299-FETCH-EXIT
           END-IF.
      *
       2399-TRATA-REGISTO-EXIT.
           EXIT.

      ******************************************************************
      *                  2500-WRITE-REM-FILE                           *
      ******************************************************************
       2500-WRITE-REM-FILE.
      *
           MOVE '2500-WRITE-REM-FILE'      TO WS-PARAGRAPH-NAME.
      *
           MOVE VIACDMAIL-CSUBJECT         TO CSUBJECT-REM.
           MOVE VIACDMAIL-CBODY            TO CBODY-REM.
           MOVE VIACDMAIL-CNOME            TO CNOME-REM.
           MOVE VIACDMAIL-CFROM            TO CFROM-REM.
           MOVE VIACDMAIL-CTO              TO CTO-REM.
           MOVE VIACDMAIL-CCC              TO CCC-REM.
           MOVE VIACDMAIL-CBCC             TO CBCC-REM.
           MOVE VIACDMAIL-CASS             TO CASS-REM.
           MOVE VIACDMAIL-CCSS             TO CCSS-REM.
           MOVE VIACDMAIL-CSITU            TO CSITU-REM.
           MOVE VIACDMAIL-CNATTACH         TO CNATTACH-REM.
           MOVE VIACDMAIL-CBATTACH         TO CBATTACH-REM.
           MOVE VIACDMAIL-CUSERIDC         TO CUSERIDC-REM.
           MOVE VIACDMAIL-HTIMESTC         TO HTIMESTC-REM.
           MOVE VIACDMAIL-CUSERID          TO CUSERID-REM.
           MOVE VIACDMAIL-HTIMEST          TO HTIMEST-REM.
      *    MOVE VIACDMAIL-CCHAVE           TO CCHAVE-REM.
           MOVE SPACES                     TO CCHAVE-REM.
      *
           WRITE VIFMAH-REG.
      *
           PERFORM 9030-FSCHECK
              THRU 9039-FSCHECK-EXIT.
      *
           IF NOT FS-OK
              SET  VIAW0030-FILE-ERROR     TO TRUE
              MOVE WS-PROGNAME             TO VIAW0030-PGMNAME
              MOVE WS-PARAGRAPH-NAME       TO VIAW0030-PARAGRAPH-NAME
              MOVE CON-VIFMAH              TO VIAW0030-FILE-NAME
              MOVE VIAW0011-FSTATUS        TO VIAW0030-FILE-STATUS
              MOVE SPACES                  TO VIAW0030-FILE-KEY
              MOVE 'ERRO NA ESCRITA DO'    TO VIAW0030-DESC1
              MOVE 'FICHEIRO DE OUTPUT'    TO VIAW0030-DESC2
      *
              PERFORM VIAP0030-ESCREVE-SPOOL
                 THRU VIAP0030-ESCREVE-SPOOL-EXIT
      *
              PERFORM 9990-ABEND
                 THRU 9999-ABEND-EXIT
      *
              IF VIAL0100-RCODE = 16
                 MOVE 2 TO AQCW0009-RCODE
              END-IF
      *
           END-IF.
      *
       2599-WRITE-REM-FILE-EXIT.
           EXIT.
      *
      ******************************************************************
      *                  2700-DELETE-RECORD                            *
      ******************************************************************
       2700-DELETE-RECORD.
      *
           EXEC SQL
              DELETE
                FROM VIAFMAILH
               WHERE CURRENT OF CURVCT01
           END-EXEC.
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           IF NOT DB2-OK
           AND NOT DB2-NOTFND
              SET  VIAW0030-DB2-ERROR
                   VIAW0012-ABEND-DB2      TO TRUE
              MOVE WS-PROGNAME             TO VIAW0030-PGMNAME
              MOVE WS-PARAGRAPH-NAME       TO VIAW0030-PARAGRAPH-NAME
              MOVE VIAW0012-TABLE-NAME     TO VIAW0030-TABLE-NAME
              MOVE VIAW0012-SQLCODE        TO VIAW0030-SQLCODE
              MOVE SPACES                  TO VIAW0030-ACCESS-KEY
              MOVE 'ERRO NA ELIMINAÇÃO '   TO VIAW0030-DESC1
              MOVE 'DO REGISTO       '     TO VIAW0030-DESC2
      *
              PERFORM VIAP0030-ESCREVE-SPOOL
                 THRU VIAP0030-ESCREVE-SPOOL-EXIT
      *
              PERFORM 9990-ABEND
                 THRU 9999-ABEND-EXIT
      *
              IF VIAL0100-RCODE = 16
                 MOVE 2 TO AQCW0009-RCODE
              END-IF
      *
           END-IF.
      *
       2799-DELETE-RECORD-EXIT.
           EXIT.
      *
      *--------------------------------------------------------------
      *                     2900-CLOSE
      *--------------------------------------------------------------
       2900-CLOSE.
      *
           EXEC SQL
               CLOSE CURVCT01
           END-EXEC.
      *
       2999-CLOSE-EXIT.
           EXIT.
      *
      ******************************************************************
      *               3000-FIM-PROGRAMA                                *
      ******************************************************************
       3000-FIM-PROGRAMA.
      *
           IF VIAW0012-SEM-ERROS
              EXEC SQL COMMIT   END-EXEC
           ELSE
              EXEC SQL ROLLBACK END-EXEC
           END-IF.
      *
           CLOSE FVIA-REM-FILE.
      *
           MOVE '3000-FIM-PROGRAMA'        TO VIAL0015-CALLER-ID
           MOVE '*** TOTAL LIDOS     : '   TO VIAL0015-CAMPO-NM(1)
           MOVE WS-TOTAL-READ              TO VIAL0015-CAMPO-VLR(1)
           MOVE '*** TOTAL REMOVIDOS : '   TO VIAL0015-CAMPO-NM(2)
           MOVE WS-TOTAL-REMOVE            TO VIAL0015-CAMPO-VLR(2)
      *
           PERFORM VIAP0015-TRATA-DEBUG
              THRU VIAP0015-TRATA-DEBUG-EXIT
      *
           IF VIAW0012-SEM-ERROS
              PERFORM AQCP0100-REG-FIM
                 THRU AQCP0100-REG-FIM-EXIT
           END-IF.
      *
       3099-FIM-PROGRAMA-EXIT.
           EXIT.
      *
      ******************************************************************
      *                      PROCEDURES                                *
      ******************************************************************
              EXEC SQL INCLUDE VIAP9999 END-EXEC.
       COPY VIAP0055.
       COPY VIAP0012.
       COPY VIAP0011.
       COPY VIAP0030.
JF    *COPY VIAP0015.
JF    ******************************************************************
JF    * Nao pode escrever no VIAF0015 porque esta a correr o backup    *
JF    ******************************************************************
JF     VIAP0015-TRATA-DEBUG.
JF          CONTINUE.
JF     VIAP0015-TRATA-DEBUG-EXIT.
JF          EXIT.
JF    ******************************************************************
       COPY AQCP0109.
       COPY ETCP1000.
