           EXEC SQL DECLARE ARVT5400 TABLE
           (
               CCENTRO CHAR(4) NOT NULL
             , CFUNCAO CHAR(10) NOT NULL
             , CNIVEL DECIMAL(3,0) NOT NULL
             , CTIPOPROC CHAR(1) NOT NULL
             , CESTADO1 CHAR(10) NOT NULL
             , CESTADO2 CHAR(10) NOT NULL
             , CCHAVE CHAR(50) NOT NULL
             , CPRGCHAVE CHAR(10) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT5400
      ******************************************************************
       01  DCLARCD5400.
            05 ARCD5400-CCENTRO PIC X(04).
            05 ARCD5400-CFUNCAO PIC X(10).
            05 ARCD5400-CNIVEL PIC S9(03) COMP-3.
            05 ARCD5400-CTIPOPROC PIC X(01).
            05 ARCD5400-CESTADO1 PIC X(10).
            05 ARCD5400-CESTADO2 PIC X(10).
            05 ARCD5400-CCHAVE PIC X(50).
            05 ARCD5400-CPRGCHAVE PIC X(10).
            05 ARCD5400-CUSERID PIC X(20).
            05 ARCD5400-HTIMEST PIC X(26).

