           EXEC SQL DECLARE ARVT4500_TRACE TABLE
           (   ITRACE  CHAR(2)   NOT NULL
             , CAPLIC  CHAR(2)   NOT NULL
             , COPCAO  CHAR(3)   NOT NULL
             , CUSERID CHAR(20)  NOT NULL
             , HTIMEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT4500
      ******************************************************************
       01  DCLARCD4500.
            05 ARCD4500-ITRACE  PIC X(02).
            05 ARCD4500-CAPLIC  PIC X(02).
            05 ARCD4500-COPCAO  PIC X(03).
            05 ARCD4500-CUSERID PIC X(20).
            05 ARCD4500-HTIMEST PIC X(26).
