      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT3300_HISTCOMPROV
      ******************************************************************
       01  DCLARCD3300.
            05 ARCD3300-CCOD PIC X(20).
            05 ARCD3300-ZSEQ PIC S9(20) COMP-3.
            05 ARCD3300-NOPR PIC S9(09) COMP-3.
            05 ARCD3300-NOPRR PIC S9(09) COMP-3.
            05 ARCD3300-NCLI PIC S9(09) COMP-3.
            05 ARCD3300-DTGER PIC X(10).
            05 ARCD3300-CTIPO PIC X(05).
            05 ARCD3300-CUTILIZA PIC X(20).
            05 ARCD3300-GDESC PIC X(100).
            05 ARCD3300-CHEADER PIC X(300).
            05 ARCD3300-CFOOTER PIC X(40).
            05 ARCD3300-CTEXTO PIC X(8000).
            05 ARCD3300-CUSERID PIC X(20).
            05 ARCD3300-HTIMEST PIC X(26).

