           EXEC SQL DECLARE ARVT1300_LINKS TABLE
           (
               CAPLIC CHAR(2) NOT NULL
             , COPTION CHAR(3) NOT NULL
             , CCRITERIA1 CHAR(100) NOT NULL
             , CCRITERIA2 CHAR(100) NOT NULL
             , CCRITERIA3 CHAR(100) NOT NULL
             , NSEQUENCE DECIMAL(5,0) NOT NULL
             , CAPLICDEST CHAR(2) NOT NULL
             , COPTIONDEST CHAR(3) NOT NULL
             , CTIPDEST CHAR(1) NOT NULL
             , CACTION CHAR(1) NOT NULL
             , CLOCALACTION CHAR(1) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT1300_LINKS
      ******************************************************************
       01  DCLARCD1300.
            05 ARCD1300-CAPLIC PIC X(02).
            05 ARCD1300-COPTION PIC X(03).
            05 ARCD1300-CCRITERIA1 PIC X(100).
            05 ARCD1300-CCRITERIA2 PIC X(100).
            05 ARCD1300-CCRITERIA3 PIC X(100).
            05 ARCD1300-NSEQUENCE PIC S9(05) COMP-3.
            05 ARCD1300-CAPLICDEST PIC X(02).
            05 ARCD1300-COPTIONDEST PIC X(03).
            05 ARCD1300-CTIPDEST PIC X(01).
            05 ARCD1300-CACTION PIC X(01).
            05 ARCD1300-CLOCALACTION PIC X(01).
            05 ARCD1300-CUSERID PIC X(20).
            05 ARCD1300-HTIMEEST PIC X(26).

