           EXEC SQL DECLARE ARVT4901 TABLE
           (
               CESTADO CHAR(2) NOT NULL
             , CESTANT CHAR(2) NOT NULL
             , GDESC CHAR(40) NOT NULL
             , ICONTA CHAR(1) NOT NULL
             , IMOVCR CHAR(1) NOT NULL
             , IMOVDB CHAR(1) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEST CHAR(26) NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT4901
      ******************************************************************
       01  DCLARCD4901.
            05 ARCD4901-CESTADO PIC X(02).
            05 ARCD4901-CESTANT PIC X(02).
            05 ARCD4901-GDESC PIC X(40).
            05 ARCD4901-ICONTA PIC X(01).
            05 ARCD4901-IMOVCR PIC X(01).
            05 ARCD4901-IMOVDB PIC X(01).
            05 ARCD4901-CUSERID PIC X(20).
            05 ARCD4901-HTIMEST PIC X(26).

