           EXEC SQL DECLARE ARVT5701 TABLE
           (
               CCLIENT   CHAR(03) NOT NULL
             , GCLIENT   CHAR(40) NOT NULL
             , CUSERID   CHAR(20) NOT NULL
             , HTIMEST   CHAR(26) NOT NULL
             , CSCHEDEV  CHAR(20) NOT NULL
             , CSCHETST  CHAR(20) NOT NULL
             , CSCHEQLT  CHAR(20) NOT NULL
             , CSCHEPRD  CHAR(20) NOT NULL
             , CJRNRDEV  CHAR(20) NOT NULL
             , CJRNRTST  CHAR(20) NOT NULL
             , CJRNRQLT  CHAR(20) NOT NULL
             , CJRNRPRD  CHAR(20) NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT5701
      ******************************************************************
       01  DCLARCD5701.
            05 ARCD5701-CCLIENT   PIC X(03).
            05 ARCD5701-GCLIENT   PIC X(40).
            05 ARCD5701-CUSERID   PIC X(20).
            05 ARCD5701-HTIMEST   PIC X(26).
            05 ARCD5701-CSCHEDEV  PIC X(20).
            05 ARCD5701-CSCHETST  PIC X(20).
            05 ARCD5701-CSCHEQLT  PIC X(20).
            05 ARCD5701-CSCHEPRD  PIC X(20).
            05 ARCD5701-CJRNRDEV  PIC X(20).
            05 ARCD5701-CJRNRTST  PIC X(20).
            05 ARCD5701-CJRNRQLT  PIC X(20).
            05 ARCD5701-CJRNRPRD  PIC X(20).
