           EXEC SQL DECLARE ARVT2800_CSS TABLE
           (
               CCOD CHAR(20) NOT NULL
             , GDESC CHAR(100) NOT NULL
             , CCSS CHAR(4000) NOT NULL
             , CUSERID  CHAR(20) NOT NULL
             , HTIMEST CHAR(26) NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT2800_CSS
      ******************************************************************
       01  DCLARCD2800.
            05 ARCD2800-CCOD PIC X(20).
            05 ARCD2800-GDESC PIC X(100).
            05 ARCD2800-CCSS PIC X(4000).
            05 ARCD2800-CUSERID PIC X(20).
            05 ARCD2800-HTIMEST PIC X(26).

