           EXEC SQL DECLARE ARVT4601 TABLE
           (
               CCODDOC CHAR(20) NOT NULL
             , CCHAVE CHAR(50) NOT NULL
             , ZSEQ DECIMAL(10,0) NOT NULL
             , ZORD DECIMAL(10,0) NOT NULL
             , CSTATUS CHAR(2) NOT NULL
             , CSTATSEG CHAR(2) NOT NULL
             , GNOTAS CHAR(1000) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEST CHAR(26) NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT4601
      ******************************************************************
       01  DCLARCD4601.
            05 ARCD4601-CCODDOC PIC X(20).
            05 ARCD4601-CCHAVE PIC X(50).
            05 ARCD4601-ZSEQ PIC S9(10) COMP-3.
            05 ARCD4601-ZORD PIC S9(10) COMP-3.
            05 ARCD4601-CSTATUS PIC X(02).
            05 ARCD4601-CSTATSEG PIC X(02).
            05 ARCD4601-GNOTAS PIC X(1000).
            05 ARCD4601-CUSERID PIC X(20).
            05 ARCD4601-HTIMEST PIC X(26).

