           EXEC SQL DECLARE ARVT2001_INFPERFIL TABLE
           (
               CPERFIL CHAR(12) NOT NULL
             , GDESCRICAO CHAR(40) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEEST TIMESTAMP NOT NULL
             , GALIAS CHAR(100) NOT NULL
           ) END-EXEC.

      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT2001_INFPERFIL
      ******************************************************************
       01  DCLARCD2001.
            05 ARCD2001-CPERFIL PIC X(12).
            05 ARCD2001-GDESCRICAO PIC X(40).
            05 ARCD2001-CUSERID PIC X(20).
            05 ARCD2001-HTIMEEST PIC X(26).
            05 ARCD2001-GALIAS PIC X(100).

