           EXEC SQL DECLARE ARVT3701 TABLE
           (
               CCODPROC CHAR(4) NOT NULL
             , CEMAIL CHAR(50) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT3701
      ******************************************************************
       01  DCLARCD3701.
            05 ARCD3701-CCODPROC PIC X(04).
            05 ARCD3701-CEMAIL PIC X(50).
            05 ARCD3701-CUSERID PIC X(20).
            05 ARCD3701-HTIMEST PIC X(26).

