           EXEC SQL DECLARE ARVT1901_MSGEXTRN TABLE
           (
               GMSGEXTRN CHAR(7) NOT NULL
             , IVISIBILID CHAR(1) NOT NULL
             , CERRO DECIMAL(4,0) NOT NULL
             , GORIGIN CHAR(2) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEEST TIMESTAMP NOT NULL
             , GDESC CHAR(40) NOT NULL
             , GMSGORIG CHAR(40) NOT NULL
             , IMSGTYPE CHAR(2) NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT1901_MSGEXTRN
      ******************************************************************
       01  DCLARCD1901.
            05 ARCD1901-GMSGEXTRN PIC X(07).
            05 ARCD1901-IVISIBILID PIC X(01).
            05 ARCD1901-CERRO PIC S9(04) COMP-3.
            05 ARCD1901-GORIGIN PIC X(02).
            05 ARCD1901-CUSERID PIC X(20).
            05 ARCD1901-HTIMEEST PIC X(26).
            05 ARCD1901-GDESC PIC X(40).
            05 ARCD1901-GMSGORIG PIC X(40).
            05 ARCD1901-IMSGTYPE PIC X(2).

