           EXEC SQL DECLARE ARVT0800_SEQUENCE TABLE
           (
               CSEQUENCER CHAR(100) NOT NULL
             , CSEQUENCE DECIMAL(15,0) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT0800_SEQUENCE
      ******************************************************************
       01  DCLARCD0800.
            05 ARCD0800-CSEQUENCER PIC X(100).
            05 ARCD0800-CSEQUENCE PIC S9(15) COMP-3.
            05 ARCD0800-CUSERID PIC X(20).
            05 ARCD0800-HTIMEEST PIC X(26).

