           EXEC SQL DECLARE ARVT0500_CODESTABLE TABLE
           (
               CTABELA CHAR(5) NOT NULL
             , CCOD CHAR(50) NOT NULL
             , C2COD CHAR(50) NOT NULL
             , CLINGUA CHAR(10) NOT NULL
             , GDESC CHAR(3000) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT0500_CODESTABLE
      ******************************************************************
       01  DCLARCD0500.
            05 ARCD0500-CTABELA PIC X(05).
            05 ARCD0500-CCOD PIC X(50).
            05 ARCD0500-C2COD PIC X(50).
            05 ARCD0500-CLINGUA PIC X(10).
            05 ARCD0500-GDESC PIC X(3000).
            05 ARCD0500-CUSERID PIC X(20).
            05 ARCD0500-HTIMEEST PIC X(26).

