           EXEC SQL DECLARE ARVT2000_INFPERFIL TABLE
           (
               CPERFIL CHAR(12) NOT NULL
             , GDESCRICAO CHAR(40) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEEST TIMESTAMP NOT NULL
           ) END-EXEC.

      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT2000_INFPERFIL
      ******************************************************************
       01  DCLARCD2000.
            05 ARCD2000-CPERFIL PIC X(12).
            05 ARCD2000-GDESCRICAO PIC X(40).
            05 ARCD2000-CUSERID PIC X(20).
            05 ARCD2000-HTIMEEST PIC X(26).

