           EXEC SQL DECLARE ARVT4001 TABLE
           (
               NSEQ DECIMAL(10,0) NOT NULL
             , CAPLIC CHAR(2) NOT NULL
             , CTIPALT CHAR(7) NOT NULL
             , CINDIC CHAR(1) NOT NULL
             , GCONTENT CHAR(40) NOT NULL
             , CUSERID CHAR(30) NOT NULL
             , HTIMEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT4001
      ******************************************************************
       01  DCLARCD4000.
            05 ARCD4000-NSEQ PIC S9(10) COMP-3.
            05 ARCD4000-CAPLIC PIC X(02).
            05 ARCD4000-CTIPALT PIC X(07).
            05 ARCD4000-CINDIC PIC X(01).
            05 ARCD4000-GCONTENT PIC X(40).
            05 ARCD4000-CUSERID PIC X(30).
            05 ARCD4000-HTIMEST PIC X(26).

