           EXEC SQL DECLARE ARVT0300_HIERARQUIA TABLE
           (
               CHIERARQUIA CHAR(10) NOT NULL
             , CLINGUA CHAR(10) NOT NULL
             , GDESC CHAR(30) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT0300_HIERARQUIA
      ******************************************************************
       01  DCLARCD0300.
            05 ARCD0300-CHIERARQUIA PIC X(10).
            05 ARCD0300-CLINGUA PIC X(10).
            05 ARCD0300-GDESC PIC X(30).
            05 ARCD0300-CUSERID PIC X(20).
            05 ARCD0300-HTIMEEST PIC X(26).

