      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT3100_COMPROVATIVO
      ******************************************************************
       01  DCLARCD3100.
           05 ARCD3100-CCOD PIC X(20).
           05 ARCD3100-CTIPO PIC X(05).
           05 ARCD3100-INDCOMP PIC X(02).
           05 ARCD3100-GDESC PIC X(100).
           05 ARCD3100-CHEADER PIC X(300).
           05 ARCD3100-CTEXTO PIC X(8000).
           05 ARCD3100-CFOOTER PIC X(40).
           05 ARCD3100-CUSERID PIC X(20).
           05 ARCD3100-HTIMEST PIC X(26).
