           EXEC SQL DECLARE ARVT0400_URL TABLE
           (
               CURL CHAR(14) NOT NULL
             , CLINGUA CHAR(10) NOT NULL
             , CPAGE CHAR(256) NOT NULL
             , GDESC CHAR(30) NOT NULL
             , GCORESYS CHAR(6) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT0400_URL
      ******************************************************************
       01  DCLARCD0400.
            05 ARCD0400-CURL PIC X(14).
            05 ARCD0400-CLINGUA PIC X(10).
            05 ARCD0400-CPAGE PIC X(256).
            05 ARCD0400-GDESC PIC X(30).
            05 ARCD0400-GCORESYS PIC X(06).
            05 ARCD0400-CUSERID PIC X(20).
            05 ARCD0400-HTIMEEST PIC X(26).

