           EXEC SQL DECLARE ARVT7201 TABLE
           (
               CPROCESSO  CHAR(20)   NOT NULL
             , CDIASEMANA CHAR(1)    NOT NULL
             , HTIMEINI   TIME       NOT NULL
             , NCOMMITINT DECIMAL(9) NOT NULL
             , CUSERID    CHAR(20)   NOT NULL
             , HTIMEST    TIMESTAMP  NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT7201
      ******************************************************************
       01  DCLARCD7201.
            05 ARCD7201-CPROCESSO          PIC  X(20).
            05 ARCD7201-CDIASEMANA         PIC  X(01).
            05 ARCD7201-HTIMEINI           PIC  X(08).
            05 ARCD7201-NCOMMITINT         PIC S9(09) COMP-3.
            05 ARCD7201-CUSERID            PIC  X(20).
            05 ARCD7201-HTIMEST            PIC  X(26).

