           EXEC SQL DECLARE ARVT1800_USEREXTRN TABLE
           (
               GUSERNAME CHAR(20) NOT NULL
             , GUSEREXTRN CHAR(20) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT1800_USEREXTRN
      ******************************************************************
       01  DCLARCD1800.
            05 ARCD1800-GUSERNAME PIC X(20).
            05 ARCD1800-GUSEREXTRN PIC X(20).
            05 ARCD1800-CUSERID PIC X(20).
            05 ARCD1800-HTIMEEST PIC X(26).

