           EXEC SQL DECLARE ARVT1000_PERFIL_ACTIONS TABLE
           (
               CPERFIL CHAR(12) NOT NULL
             , CURL CHAR(12) NOT NULL
             , IBROWSE CHAR(1) NOT NULL
             , ICREATE CHAR(1) NOT NULL
             , IMODIFY CHAR(1) NOT NULL
             , IDELETE CHAR(1) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT1000_PERFIL_ACTIONS
      ******************************************************************
       01  DCLARCD1000.
            05 ARCD1000-CPERFIL PIC X(12).
            05 ARCD1000-CURL PIC X(12).
            05 ARCD1000-IBROWSE PIC X(01).
            05 ARCD1000-ICREATE PIC X(01).
            05 ARCD1000-IMODIFY PIC X(01).
            05 ARCD1000-IDELETE PIC X(01).
            05 ARCD1000-CUSERID PIC X(20).
            05 ARCD1000-HTIMEEST PIC X(26).

