      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT3301_HISTCOMPROV
      ******************************************************************
       01  DCLARCD3301.
            05 ARCD3301-CCOD PIC X(20).
            05 ARCD3301-ZSEQ PIC S9(20) COMP-3.
            05 ARCD3301-CCHAVE PIC X(20).
            05 ARCD3301-NOPR PIC S9(09) COMP-3.
            05 ARCD3301-NOPRR PIC S9(09) COMP-3.
            05 ARCD3301-NCLI PIC S9(09) COMP-3.
            05 ARCD3301-DTGER PIC X(10).
            05 ARCD3301-CTIPO PIC X(05).
            05 ARCD3301-CUTILIZA PIC X(20).
            05 ARCD3301-GDESC PIC X(100).
            05 ARCD3301-CHEADER PIC X(300).
            05 ARCD3301-CFOOTER PIC X(40).
            05 ARCD3301-CTEXTO PIC X(8000).
            05 ARCD3301-CUSERID PIC X(20).
            05 ARCD3301-HTIMEST PIC X(26).

