           EXEC SQL DECLARE ARVT5800 TABLE
           (
               CPROGID CHAR(10) NOT NULL
             , CCOPYID CHAR(10) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT5800
      ******************************************************************
       01  DCLARCD5800.
            05 ARCD5800-CPROGID PIC X(10).
            05 ARCD5800-CCOPYID PIC X(10).
            05 ARCD5800-CUSERID PIC X(20).
            05 ARCD5800-HTIMEST PIC X(26).

