           EXEC SQL DECLARE ARVT5901 TABLE
           (
               CBAL DECIMAL(4,0) NOT NULL
             , GNOME CHAR(40) NOT NULL
             , GNOMR CHAR(15) NOT NULL
             , GMORD CHAR(40) NOT NULL
             , CODX CHAR(7) NOT NULL
             , GEMAIL CHAR(80) NOT NULL
             , GTELF CHAR(20) NOT NULL
             , GTELF1 CHAR(20) NOT NULL
             , GFAX CHAR(20) NOT NULL
             , GDIST CHAR(40) NOT NULL
             , GCONC CHAR(40) NOT NULL
             , GLOCA CHAR(15) NOT NULL
             , CREPG DECIMAL(4,0) NOT NULL
             , CZONA CHAR(10) NOT NULL
             , CSZONA CHAR(10) NOT NULL
             , CUNEG CHAR(10) NOT NULL
             , GBUFFER CHAR(100) NOT NULL
             , CREGIAO CHAR(10) NOT NULL
             , CUSERIDC CHAR(20) NOT NULL
             , HTIMESTC TIMESTAMP NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT5901
      ******************************************************************
       01  DCLARCD5901.
            05 ARCD5901-CBAL PIC S9(04) COMP-3.
            05 ARCD5901-GNOME PIC X(40).
            05 ARCD5901-GNOMR PIC X(15).
            05 ARCD5901-GMORD PIC X(40).
            05 ARCD5901-CODX PIC X(07).
            05 ARCD5901-GEMAIL PIC X(80).
            05 ARCD5901-GTELF PIC X(20).
            05 ARCD5901-GTELF1 PIC X(20).
            05 ARCD5901-GFAX PIC X(20).
            05 ARCD5901-GDIST PIC X(40).
            05 ARCD5901-GCONC PIC X(40).
            05 ARCD5901-GLOCA PIC X(15).
            05 ARCD5901-CREPG PIC S9(04) COMP-3.
            05 ARCD5901-CZONA PIC X(10).
            05 ARCD5901-CSZONA PIC X(10).
            05 ARCD5901-CUNEG PIC X(10).
            05 ARCD5901-GBUFFER PIC X(100).
            05 ARCD5901-CREGIAO PIC X(10).
            05 ARCD5901-CUSERIDC PIC X(20).
            05 ARCD5901-HTIMESTC PIC X(26).
            05 ARCD5901-CUSERID PIC X(20).
            05 ARCD5901-HTIMEST PIC X(26).

