           EXEC SQL DECLARE ARVT5101 TABLE
           (
               CCLI CHAR(20) NOT NULL
             , AORI CHAR(500) NOT NULL
             , ADEST CHAR(500) NOT NULL
             , TEXEC CHAR(20) NOT NULL
             , PID DECIMAL(9,0) NOT NULL
             , STPROC CHAR(2) NOT NULL
             , COUT CHAR(20) NOT NULL
             , COUTZIP CHAR(20) NOT NULL
             , CUSERIDC CHAR(20) NOT NULL
             , HTIMESTC TIMESTAMP NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT5101
      ******************************************************************
       01  DCLARCD5101.
            05 ARCD5101-CCLI PIC X(20).
            05 ARCD5101-AORI PIC X(500).
            05 ARCD5101-ADEST PIC X(500).
            05 ARCD5101-TEXEC PIC X(20).
            05 ARCD5101-PID PIC S9(09) COMP-3.
            05 ARCD5101-STPROC PIC X(02).
            05 ARCD5101-COUT PIC X(20).
            05 ARCD5101-COUTZIP PIC X(20).
            05 ARCD5101-CUSERIDC PIC X(20).
            05 ARCD5101-HTIMESTC PIC X(26).
            05 ARCD5101-CUSERID PIC X(20).
            05 ARCD5101-HTIMEST PIC X(26).

