           EXEC SQL DECLARE ARVT1100_DOCUMENTS TABLE
           (
               DOCUMENTKEY CHAR(50) NOT NULL
             , GDOCIMAGE CHAR(50) NOT NULL
             , GDOCFMT CHAR(10) NOT NULL
             , ISTATUS CHAR(1) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEEST TIMESTAMP NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT1100_DOCUMENTS
      ******************************************************************
       01  DCLARCD1100.
            05 ARCD1100-DOCUMENTKEY PIC X(50).
            05 ARCD1100-GDOCIMAGE PIC X(50).
            05 ARCD1100-GDOCFMT PIC X(10).
            05 ARCD1100-ISTATUS PIC X(01).
            05 ARCD1100-CUSERID PIC X(20).
            05 ARCD1100-HTIMEEST PIC X(26).

