           EXEC SQL DECLARE ARVT4701 TABLE
           (
               CCODPROC CHAR(4) NOT NULL
             , CEMAIL CHAR(50) NOT NULL
             , CEMAILALT CHAR(50) NOT NULL
             , CUSERID CHAR(20) NOT NULL
             , HTIMEST CHAR(26) NOT NULL
           ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE ARVT4701
      ******************************************************************
       01  DCLARCD4701.
            05 ARCD4701-CCODPROC PIC X(04).
            05 ARCD4701-CEMAIL PIC X(50).
            05 ARCD4701-CEMAILALT PIC X(50).
            05 ARCD4701-CUSERID PIC X(20).
            05 ARCD4701-HTIMEST PIC X(26).

