      ******************************************************************
      * NOME:       ARCL0400                                           *
      * DESCRICAO:  AREA DE LIGAÇÃO MODULO ARR00400                    *
      * CRIACAO:    28-04-2017                                         *
      * AUTOR:      VIA CONSULTING                                     *
      ******************************************************************
       01  ARCL0400-COMMAREA.
           05 ARCL0400-CLIB                 PIC  X(10).
           05 ARCL0400-CFILE                PIC  X(10).
           05 ARCL0400-CMBR                 PIC  X(10).
      *
       01  ARCL0400-ROTINA                  PIC  X(10) VALUE 'ARR00400'.
