      ******************************************************************
      *  APLICAÇÃO:        ARQUITECTURA                                *
      *  MÓDULO:           MODULO INVOCA WEBSERVICE PARA CODESTABLE    *
      *  FUNÇÃO:           LINKAGE                                     *
      *  PROGRAMA:         ARM0115                                     *
      *  CRIACAO:          2013.09.05                                  *
      *  AUTOR:            VIA CONSULTING                              *
      *  DESCRIÇÃO:        INVOCA WS PARA INSERIR CODESTABLE NO LOCAL  *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      ******************************************************************
       01 ARCL0115-DATA.
          05 ARCL0115-CTABELA        PIC X(05).
          05 ARCL0115-CCOD           PIC X(50).
          05 ARCL0115-CCOD2          PIC X(50).
          05 ARCL0115-CLINGUA        PIC X(10).
          05 ARCL0115-GDESC          PIC X(3000).
      *
       01 ARCL0115-ROTINA                  PIC  X(10) VALUE 'ARM0115'.
