      ******************************************************************
      *  APLICAÇÃO:        AR                                          *
      *  MÓDULO:           COPIA FICHEIRO DO IFS PARA AS400            *
      *  FUNÇÃO:           LINKAGE                                     *
      *  PROGRAMA:         ARM70159                                    *
      *  CRIACAO:          2024.11.06                                  *
      *  AUTOR:            VIA CONSULTING                              *
      *  DESCRIÇÃO:        LINKAGE COM CAMPOS INDIVIDUAIS              *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      ******************************************************************
       01 ARCL7159-DATA.
          05 ARCL7159-PATHI                PIC  X(100) VALUE SPACES.
          05 ARCL7159-FILEI                PIC  X(100) VALUE SPACES.
          05 ARCL7159-BIBLO                PIC  X(010) VALUE SPACES.
          05 ARCL7159-FILEO                PIC  X(010) VALUE SPACES.
          05 ARCL7159-FSIZE                PIC S9(004) COMP-3.

       01 ARCL7159-ROTINA                  PIC  X(010) VALUE 'ARM70159'.
