      ******************************************************************
      * NOME:       ARCL5600                                           *
      * DESCRICAO:  AREA DE LIGAÇÃO MODULO ARR05600                    *
      * CRIACAO:    25-08-2017                                         *
      * AUTOR:      VIA CONSULTING                                     *
      ******************************************************************
       01  ARCL5600-COMMAREA.
           05 ARCL5600-CLIBRARY             PIC  X(10) VALUE SPACES.
           05 ARCL5600-CFILEID              PIC  X(10) VALUE SPACES.
           05 ARCL5600-CPROGID              PIC  X(10) VALUE SPACES.
      *
           05 ARCL5600-NLINHAS              PIC  9(06) VALUE ZEROES.
      *
       01  ARCL5600-ROTINA                  PIC  X(10) VALUE 'ARR05600'.
