      ******************************************************************
      *  APLICAÇÃO:        AR                                          *
      *  MÓDULO:           APAGA FICHEIRO SFTP                         *
      *  FUNÇÃO:           LINKAGE                                     *
      *  PROGRAMA:         ARM70025                                    *
      *  CRIACAO:          2014.07.10                                  *
      *  AUTOR:            VIA CONSULTING                              *
      *  DESCRIÇÃO:        LINKAGE COM CAMPOS INDIVIDUAIS              *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      ******************************************************************
       01 ARCL7025-DATA.
          05 ARCL7025-RCODE            PIC S9(01)V COMP-3.
             88 ARCL7025-SEM-ERROS                VALUE 0  1.
             88 ARCL7025-RCODE-OK                 VALUE 0.
             88 ARCL7025-RCODE-INF                VALUE 1.
             88 ARCL7025-RCODE-VAL                VALUE 2.
             88 ARCL7025-RCODE-APL                VALUE 3.
          05 ARCL7025-BIBLI            PIC  X(10) VALUE SPACES.
          05 ARCL7025-FILEN            PIC  X(10) VALUE SPACES.

       01 ARCL7025-ROTINA              PIC  X(10) VALUE 'ARM70025'.
