      *****************************************************************
      * AUTOR    : VIA CONSULTING                                     *
      * APLICACAO: Contabilização VISA                                *
      *****************************************************************
       01  ARCL0100-COMMAREA.
           05 ARCL0100-CODTRX               PIC X(03).
           05 ARCL0100-LOG                  PIC X(01).
           05 ARCL0100-INDERRO              PIC X(01).
           05 ARCL0100-CODERRO              PIC X(04).
           05 ARCL0100-CODAPP               PIC X(03).
           05 ARCL0100-MSGAREA              PIC X(11500).
