      ******************************************************************
      *  APLICAÇÃO:        AR                                          *
      *  MÓDULO:           RENAME DE OBJECTO NO IFS                    *
      *  FUNÇÃO:           LINKAGE                                     *
      *  PROGRAMA:         ARM70170                                    *
      *  CRIACAO:          2014.10.02                                  *
      *  AUTOR:            VIA CONSULTING                              *
      *  DESCRIÇÃO:        LINKAGE COM CAMPOS INDIVIDUAIS              *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      ******************************************************************
       01 ARCL7170-DATA.
          05 ARCL7170-PATHI                 PIC X(50) VALUE SPACES.
          05 ARCL7170-FILEI                 PIC X(50) VALUE SPACES.
          05 ARCL7170-FILEO                 PIC X(50) VALUE SPACES.

       01 ARCL7170-ROTINA              PIC  X(10) VALUE 'ARM70170'.
