      ******************************************************************
      *  APLICAÇÃO:        ARQUITECTURA                                *
      *  MÓDULO:           MÓDULO DE COPIA DE FICHEIRO PARA IFS        *
      *  FUNÇÃO:           LINKAGE                                     *
      *  PROGRAMA:         ARM70160                                    *
      *  CRIACAO:          2014.09.11                                  *
      *  AUTOR:            VIA CONSULTING                              *
      *  DESCRIÇÃO:        LINKAGE COM CAMPOS INDIVIDUAIS              *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *      FMATOS                       *
      ******************************************************************
       01 ARCL7160-COMMAREA.
          05 ARCL7160-RCODE                PIC  9(01)V COMP-3.
          05 ARCL7160-NOMEI                PIC  X(10).
          05 ARCL7160-BIBLI                PIC  X(10).
          05 ARCL7160-NOMEO                PIC  X(80).
          05 ARCL7160-GLOC1                PIC  X(50).
          05 ARCL7160-GLOC2                PIC  X(50).
          05 ARCL7160-GLOC3                PIC  X(50).
          05 ARCL7160-LOCOUT               PIC  X(255).
      *
       01 ARCL7160-ROTINA                  PIC  X(10) VALUE 'ARM70160'.
      *
