      ******************************************************************
      * NOME:       ARCL0542                                           *
      * DESCRICAO:  AREA DE LIGAÇÃO ROTINA ARR00542                    *
      * CRIACAO:    24-05-2018                                         *
      * AUTOR:      VIA CONSULTING                                     *
      ******************************************************************
       01  ARCL0542-COMMAREA.
           05 ARCL0542-CPERFIL              PIC  X(12).
           05 ARCL0542-CPERFMAS             PIC  X(12).
           05 ARCL0542-CHIERAR1             PIC  X(10).
           05 ARCL0542-CHIERAR2             PIC  X(10).
           05 ARCL0542-CHIERAR3             PIC  X(10).
           05 ARCL0542-CHIERAR4             PIC  X(10).
           05 ARCL0542-CHIERAR5             PIC  X(10).
           05 ARCL0542-CHIERAR              PIC  X(01).
              88 ARCL0542-CHIERAR-1         VALUE '1'.
              88 ARCL0542-CHIERAR-2         VALUE '2'.
              88 ARCL0542-CHIERAR-3         VALUE '3'.
              88 ARCL0542-CHIERAR-4         VALUE '4'.
      *
       01  ARCL0542-NM-ROTINA               PIC  X(10) VALUE 'ARR00542'.
