      ******************************************************************
      *  APLICAÇÃO:        ARQUITECTURA                                *
      *  MÓDULO:           MÓDULO DE CONSULTA ART22_PARAM              *
      *  FUNÇÃO:           LINKAGE                                     *
      *  PROGRAMA:         ARM2205                                     *
      *  CRIACAO:          2012.10.16                                  *
      *  AUTOR:            VIA CONSULTING                              *
      *  DESCRIÇÃO:        LINKAGE COM CAMPOS INDIVIDUAIS              *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      ******************************************************************
       01 ARCL2205-DATA.
          05 ARCL2205-ENTRADA.
             10 ARCL2205-CPARAM            PIC  X(10).
             10 ARCL2205-CAPLIC            PIC  X(02).
          05 ARCL2205-GDESC                PIC  X(40).
          05 ARCL2205-GVALOR1              PIC  X(50).
          05 ARCL2205-GVALOR2              PIC  X(50).
          05 ARCL2205-GVALOR3              PIC  X(50).
          05 ARCL2205-CUSERID              PIC  X(20).
          05 ARCL2205-HTIMEST              PIC  X(26).
      *
       01 ARCL2205-ROTINA                  PIC  X(10) VALUE 'ARM2205'.
