      ******************************************************************
      *  APLICAÇÃO:        ARQUITECTURA                                *
      *  FUNÇÃO:           LINKAGE                                     *
      *  PROGRAMA:         ARR00205                                    *
      *  CRIACAO:          2016.01.19                                  *
      *  AUTOR:            VIA CONSULTING                              *
      *  DESCRIÇÃO:        LINKAGE rotina chamada nas transacoes de    *
      *                    manutencao à tabela ART02_PERFIL            *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      ******************************************************************
       01 ARCL0205-COMMAREA.
      * Input
          05 ARCL0205-MODO-MANUTENCAO      PIC  X(02).
             88 ARCL0205-MANUT-UPDATE      VALUE '06'.
             88 ARCL0205-MANUT-DELETE      VALUE '08'.
      *
          05 ARCL0205-PERFILMAST           PIC  X(12).
          05 ARCL0205-CSEQUENCIA           PIC S9(12).
      *
          05 ARCL0205-CHIERAR1             PIC X(10).
          05 ARCL0205-CURL1                PIC X(14).
          05 ARCL0205-CHIERAR2             PIC X(10).
          05 ARCL0205-CURL2                PIC X(14).
          05 ARCL0205-CHIERAR3             PIC X(10).
          05 ARCL0205-CURL3                PIC X(14).
          05 ARCL0205-CHIERAR4             PIC X(10).
          05 ARCL0205-CURL4                PIC X(14).
          05 ARCL0205-CHIERAR5             PIC X(10).
          05 ARCL0205-CURL5                PIC X(14).
      *
          05 ARCL0205-USER                 PIC X(20).
      *
       01 ARCL0205-ROTINA                  PIC  X(10) VALUE 'ARR00205'.
