      ******************************************************************
      *  APLICAÇÃO:        ARQUITECTURA                                *
      *  MÓDULO:           MÓDULO DE CONSULTA ART31_COMPROVATIVO       *
      *  FUNÇÃO:           LINKAGE                                     *
      *  PROGRAMA:         ARM2810                                     *
      *  CRIACAO:          2014.03.20                                  *
      *  AUTOR:            VIA CONSULTING                              *
      *  DESCRIÇÃO:        LINKAGE COM CAMPOS INDIVIDUAIS              *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      ******************************************************************
       01 ARCL2810-DATA.
          05 ARCL2810-ENTRADA.
             10 ARCL2810-CCOD              PIC  X(20).
             10 ARCL2810-CTIPO             PIC  X(05).
             10 ARCL2810-INDCOMP           PIC  X(02).
             10 ARCL2810-CHEADER           PIC  X(300).
             10 ARCL2810-CTEXTO            PIC  X(8000).
             10 ARCL2810-CFOOTER           PIC  X(40).
          05 ARCL2810-SAIDA.
             10 ARCL2810-CBIBLI            PIC  X(50).
             10 ARCL2810-CNFICH            PIC  X(100).
          05 ARCL2810-FILLER               PIC  X(500).
      *
       01 ARCL2810-ROTINA                  PIC  X(10) VALUE 'ARM2810'.
