      ******************************************************************
      *  APLICAÇÃO:        ARQUITECTURA                                *
      *  MÓDULO:           MÓDULO DE CONSULTA ART01_PARAM              *
      *  FUNÇÃO:           LINKAGE                                     *
      *  PROGRAMA:         ARM0110                                     *
      *  CRIACAO:          2012.10.16                                  *
      *  AUTOR:            VIA CONSULTING                              *
      *  DESCRIÇÃO:        LINKAGE COM CAMPOS INDIVIDUAIS              *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      ******************************************************************
       01 ARCL0110-DATA.
          05 ARCL0110-STANDARD.
             10 ARCL0110-AT-CBAN           PIC S9(04) COMP-3.
                88 ARCL0110-AT-CBAN-MOZA              VALUE 0034.
                88 ARCL0110-AT-CBAN-MOZATST           VALUE 8834.
                88 ARCL0110-AT-CBAN-BCI               VALUE 0008.
             10 ARCL0110-AT-BALM           PIC S9(04) COMP-3.
             10 ARCL0110-AT-DTOP           PIC S9(08) COMP-3.
             10 ARCL0110-AT-CMOE           PIC  X(03).
             10 ARCL0110-AT-DEBUG          PIC  X(01).
             10 ARCL0110-AT-VERSAO         PIC  X(03).
                88 ARCL0110-AT-VERSAO-V203             VALUE '203'.
                88 ARCL0110-AT-VERSAO-V300             VALUE '300'.
                88 ARCL0110-AT-VERSAO-VVAL             VALUE '203'
                                                             '300'.
             10 ARCL2110-CODERR            PIC S9(04).
      *---
          05 ARCL0110-BANKA.
             10 ARCL0110-PGMC              PIC  X(10).
             10 ARCL0110-TTR               PIC  X(05).
             10 ARCL0110-JOBNC             PIC  X(10).
             10 ARCL0110-USERC             PIC  X(10).
             10 ARCL0110-PGMQC             PIC  X(10).
             10 ARCL0110-RCODE             PIC S9(01) COMP-3.
                88 ARCL0110-SEM-ERROS                  VALUE 0, 1.
                88 ARCL0110-ABEND                      VALUE 3.
                88 ARCL0110-RCODE-OK                   VALUE 0.
                88 ARCL0110-RCODE-INF                  VALUE 1.
                88 ARCL0110-RCODE-VAL                  VALUE 2.
                88 ARCL0110-RCODE-APL                  VALUE 3.
             10 ARCL0110-ESTR              PIC  X(01).
             10 ARCL0110-APTR              PIC  X(01).
      *
          05 ARCL0110-NCLI                 PIC S9(09).
          05 ARCL0110-ICE01                PIC  X(01).
          05 ARCL0110-NOME                 PIC  X(35).
          05 ARCL0110-ICE02                PIC  X(01).
      *
       01 ARCL0110-ROTINA                  PIC  X(10) VALUE 'ARM0110'.
