       IDENTIFICATION DIVISION.
       PROGRAM-ID.    ARI13900.
      ******************************************************************
      *     PROGRAMA ARI13900.                                         *
      *                                                                *
      *     Browse URL
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE ARI13900         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE ARCD0400 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY ARCV1390.
       COPY ARCV1391.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY ARCK0001.
       COPY ARCK0002.
       COPY VIAL0015.
      *
CDT    COPY TGCL1000.
CDT    COPY TGCL2000.
CDT    COPY TGCK0002.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
      *--------------------------------------------------------------
      *            SWITCH
      *--------------------------------------------------------------
       01  SW-SWITCH.
           05 SW-CURSOR                  PIC X(01) VALUE SPACES.
              88 SW-CURSOR-NONE                    VALUE '0'.
              88 SW-CURSOR-1                       VALUE '1'.
              88 SW-CURSOR-2                       VALUE '2'.
              88 SW-CURSOR-3                       VALUE '3'.
              88 SW-CURSOR-4                       VALUE '3'.
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-ARVT0400 PIC X(08) VALUE 'ARVT0400'.
           05 WS-PROGNAME  PIC X(08) VALUE 'ARI13900'.
CDT        05 CON-CTABELA-CLINGUA  PIC X(05) VALUE 'AR001'.
CDT        05 CON-CTABELA-D-CLINGUA  PIC X(05) VALUE 'AR001'.
CDT        05 CON-CTABELA-D-GCORESYS  PIC X(05) VALUE 'AR002'.
      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
CDT    01  WS-VARIAVEIS.
           05 WS-CTABELA                   PIC X(05) VALUE SPACES.
CDT        05 WS-CCOD                      PIC X(40) VALUE SPACES.
           05 WS-CLINGUA-MIN               PIC X(10) VALUE SPACES.
           05 WS-CLINGUA-MAX               PIC X(10) VALUE SPACES.
      *--------------------------------------------------------------
      *              DECLARACOES DE CURSORES DB2                     *
      *--------------------------------------------------------------
      *
       01  WS-CURSOR-VARS.
           05 FILLER                     PIC X(01) VALUE SPACES.
           EXEC SQL
                DECLARE CURART01 CURSOR FOR
                 SELECT
                       CURL
                     , CLINGUA
                     , CPAGE
                     , GDESC
                     , GCORESYS
                     , TIPNAVEG
                     , CUSERID
                     , HTIMEST
                 FROM ARVT0401_URL
                 WHERE  CURL    >= :ARCD0400-CURL
                   AND  CLINGUA  BETWEEN :WS-CLINGUA-MIN
                                 AND     :WS-CLINGUA-MAX
      * paginacao
                   AND (CURL    >  :ARCD0400-CURL
                    OR (CURL    =  :ARCD0400-CURL
                   AND  CLINGUA >= :ARCD0400-CLINGUA))

                 ORDER BY
                       CURL
                     , CLINGUA
           END-EXEC

      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE ARI13900         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
      *
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO ARCV1390-MSG.
           MOVE ARCV1390-ASE               TO ARCV1391-ASE.
      *
           MOVE ZEROES                     TO ARCV1391-INDICE.
           PERFORM 1100-LIMPA-OCCURS
              THRU 1199-LIMPA-OCCURS-EXIT
             UNTIL ARCV1391-PAGINA-CHEIA.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            1100-LIMPA-OCCURS
      *--------------------------------------------------------------
       1100-LIMPA-OCCURS.
      *
           ADD 1                       TO ARCV1391-INDICE.
           MOVE SPACES
             TO ARCV1391-D-CURL(ARCV1391-INDICE)
           MOVE SPACES
             TO ARCV1391-D-CLINGUA(ARCV1391-INDICE)
           MOVE SPACES
             TO ARCV1391-D-GDESC(ARCV1391-INDICE)
           MOVE SPACES
             TO ARCV1391-D-GCORESYS(ARCV1391-INDICE)
           MOVE SPACES
             TO ARCV1391-D-TIPNAVEG(ARCV1391-INDICE)
           .
      *
       1199-LIMPA-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           MOVE ARCV1390-CURL-PAG          TO ARCV1391-CURL-PAG
           MOVE ARCV1390-CLINGUA-PAG       TO ARCV1391-CLINGUA-PAG
           MOVE ARCV1390-CURL              TO ARCV1391-CURL
           MOVE ARCV1390-CLINGUA           TO ARCV1391-CLINGUA

      *
           IF VIAL0002-SEM-ERROS
              PERFORM 2020-OPEN
                 THRU 2029-OPEN-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2030-FETCH
                 THRU 2039-FETCH-EXIT

              IF VIAL0002-SEM-ERROS
                 IF DB2-OK
                    PERFORM 2040-CONTINUA
                       THRU 2049-CONTINUA-EXIT
                 ELSE
                    COMPUTE ARCV1391-DIMINUI-LENGTH EQUAL
                         ARCV1391-INDICE-INVERSO * ARCV1391-LENGTH-OCCUR
                    COMPUTE ARCV1391-LENGTH EQUAL ARCV1391-LENGTH
                         - ARCV1391-DIMINUI-LENGTH
                    MOVE VIAK0002-ERROS-FUNCAO
                                           TO VIAL0002-IND-ERROS
                    MOVE ARCK0002-STATUS-ACTIVO
                      TO ARCV1391-CURL-S
                    MOVE ARCK0001-CURL-N-EXISTS
                      TO ARCV1391-CURL-MSG
                 END-IF
              END-IF
              PERFORM 2070-CLOSE
                 THRU 2079-CLOSE-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2020-OPEN
      *--------------------------------------------------------------
       2020-OPEN.

           IF ARCV1390-CURL-PAG EQUAL SPACES
              MOVE ARCV1390-CURL            TO ARCV1390-CURL-PAG
           END-IF.

           IF ARCV1390-CLINGUA-PAG EQUAL SPACES
              MOVE ARCV1390-CLINGUA         TO ARCV1390-CLINGUA-PAG
           END-IF.

           MOVE ARCV1390-CURL-PAG           TO ARCD0400-CURL.
           MOVE ARCV1390-CLINGUA-PAG        TO ARCD0400-CLINGUA.

           IF ARCV1390-CLINGUA     EQUAL SPACES
              MOVE SPACES                  TO WS-CLINGUA-MIN
              MOVE HIGH-VALUES             TO WS-CLINGUA-MAX
           ELSE
              MOVE ARCV1390-CLINGUA        TO WS-CLINGUA-MIN
              MOVE ARCV1390-CLINGUA        TO WS-CLINGUA-MAX
           END-IF.

           EXEC SQL
               OPEN CURART01
           END-EXEC.

           MOVE CON-ARVT0400               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       2029-OPEN-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2030-FETCH
      *--------------------------------------------------------------
       2030-FETCH.

           EXEC SQL
              FETCH CURART01
              INTO
                  :ARCD0400-CURL
                , :ARCD0400-CLINGUA
                , :ARCD0400-CPAGE
                , :ARCD0400-GDESC
                , :ARCD0400-GCORESYS
                , :ARCD0400-TIPNAVEG
                , :ARCD0400-CUSERID
                , :ARCD0400-HTIMEST
           END-EXEC.


           MOVE CON-ARVT0400               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       2039-FETCH-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                       2040-CONTINUA
      *--------------------------------------------------------------
       2040-CONTINUA.

           MOVE ZEROES                     TO ARCV1391-INDICE.
           PERFORM 2050-TRATA-OCCURS
              THRU 2059-TRATA-OCCURS-EXIT
             UNTIL DB2-NOTFND
                OR ARCV1391-PAGINA-CHEIA
                OR NOT VIAL0002-SEM-ERROS.

           IF VIAL0002-SEM-ERROS
              IF NOT ARCV1391-PAGINA-CHEIA
                    COMPUTE ARCV1391-INDICE-INVERSO EQUAL
                         ARCV1391-INDICE-INVERSO - ARCV1391-INDICE
                    COMPUTE ARCV1391-DIMINUI-LENGTH EQUAL
                         ARCV1391-INDICE-INVERSO * ARCV1391-LENGTH-OCCUR
                    COMPUTE ARCV1391-LENGTH EQUAL ARCV1391-LENGTH -
                         ARCV1391-DIMINUI-LENGTH
                    SET  VIAL0002-FIM-CONSULTA TO TRUE
              END-IF
           END-IF.

       2049-CONTINUA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2050-TRATA-OCCURS
      *--------------------------------------------------------------
       2050-TRATA-OCCURS.
      *
           ADD 1                       TO ARCV1391-INDICE.
           MOVE ARCD0400-CURL
             TO ARCV1391-D-CURL(ARCV1391-INDICE).
           MOVE ARCD0400-CLINGUA
             TO ARCV1391-D-CLINGUA(ARCV1391-INDICE).
           MOVE ARCD0400-GDESC
             TO ARCV1391-D-GDESC(ARCV1391-INDICE).
           MOVE ARCD0400-GCORESYS
             TO ARCV1391-D-GCORESYS(ARCV1391-INDICE).
           MOVE ARCD0400-TIPNAVEG
             TO ARCV1391-D-TIPNAVEG(ARCV1391-INDICE).
      *
           PERFORM 2030-FETCH
              THRU 2039-FETCH-EXIT.
      *
       2059-TRATA-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2070-CLOSE
      *--------------------------------------------------------------
       2070-CLOSE.

           EXEC SQL
               CLOSE CURART01
           END-EXEC.

       2079-CLOSE-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

CDT   *    IF VIAL0002-SEM-ERROS
      *       PERFORM 3100-DESC-CAMPOS
      *          THRU 3100-DESC-CAMPOS-EXIT
CDT   *    END-IF.

           MOVE ARCV1391-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE ARCV1391-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE ARCV1391-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ARCV1391-INDICE            TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   3100-DESC-CAMPOS
      *--------------------------------------------------------------
       3100-DESC-CAMPOS.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3100-DESC-CAMPOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           IF  VIAL0002-SEM-ERROS
           AND ARCV1391-XDESCCLINGUA EQUAL SPACES
           AND ARCV1391-CLINGUA NOT EQUAL SPACES
              MOVE CON-CTABELA-CLINGUA     TO WS-CTABELA
              MOVE ARCV1391-CLINGUA        TO WS-CCOD
              PERFORM 3200-VAL-TAB-ART05
                 THRU 3200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC        TO ARCV1391-XDESCCLINGUA
              END-IF
           END-IF.

      *DESCODIFICA OCORRENCIAS

           MOVE ZEROS                       TO ARCV1391-INDICE

           IF VIAL0002-SEM-ERROS
              PERFORM 3400-DESC-OCCURS
                 THRU 3400-DESC-OCCURS-EXIT
              UNTIL ARCV1391-PAGINA-CHEIA
                 OR ARCV1391-INDICE >= VIAL0001-OCORRENCIAS
           END-IF.

       3100-DESC-CAMPOS-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   3200-VAL-TAB-ART05
      *--------------------------------------------------------------
       3200-VAL-TAB-ART05.
      *
           INITIALIZE TGCL2000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL2000-CTABELA
           MOVE WS-CCOD                   TO TGCL2000-CCOD

           PERFORM CALL-TGCP2000
              THRU CALL-TGCP2000-EXIT.

       3200-VAL-TAB-ART05-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   3400-DESC-OCCURS
      *--------------------------------------------------------------
       3400-DESC-OCCURS.
      *
           MOVE '3400-DESC-OCCURS'             TO VIAL0015-CALLER-ID

           ADD 1                               TO ARCV1391-INDICE.

           IF  VIAL0002-SEM-ERROS
           AND ARCV1391-D-CLINGUA(ARCV1391-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-CLINGUA               TO WS-CTABELA
              MOVE ARCV1391-D-CLINGUA(ARCV1391-INDICE) TO WS-CCOD
              PERFORM 3200-VAL-TAB-ART05
                 THRU 3200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                             TO ARCV1391-XDESCD-CLINGUA(ARCV1391-INDICE)
              ELSE
                 MOVE SPACES TO ARCV1391-XDESCD-CLINGUA(ARCV1391-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND ARCV1391-D-GCORESYS(ARCV1391-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-GCORESYS           TO WS-CTABELA
              MOVE ARCV1391-D-GCORESYS(ARCV1391-INDICE) TO WS-CCOD
              PERFORM 3200-VAL-TAB-ART05
                 THRU 3200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                          TO ARCV1391-XDESCD-GCORESYS(ARCV1391-INDICE)
              ELSE
                 MOVE SPACES
                          TO ARCV1391-XDESCD-GCORESYS(ARCV1391-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.


       3400-DESC-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY TGCP1000.
           COPY TGCP2000.
      *

