       IDENTIFICATION DIVISION.
       PROGRAM-ID.    ARI10506.
      ******************************************************************
      *     PROGRAMA ARI10506.                                         *
      *                                                                *
      *     Activacao e atribuicao de PIN
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE ARI10506         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE ARCD0100 END-EXEC.
           EXEC SQL INCLUDE ARCD0103 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY ARCV1050.
       COPY ARCV1051.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0010.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY ARCK0001.
       COPY ARCK0002.
       COPY VIAL0015.
       COPY ARCL2505.
       COPY ETCL0002.
       COPY AQCW0009.
       COPY VIAL1030.

      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-ARVT0100           PIC X(08) VALUE 'ARVT0100'.
           05 WS-PROGNAME            PIC X(08) VALUE 'ARI10506'.
      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-EMAIL                     PIC X(50) VALUE SPACES.
           05 WS-NOTE                      PIC X(500) VALUE SPACES.
           05 WS-ASSUNTO                   PIC X(050) VALUE SPACES.
      *--------------------------------------------------------------
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE ARI10506         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO ARCV1050-MSG.
           MOVE ARCV1050-ASE               TO ARCV1051-ASE.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           MOVE ARCV1050-ADE               TO ARCV1051-ADE.

           PERFORM 2100-OBTEM-EMAIL
              THRU 2199-OBTEM-EMAIL-EXIT

           IF VIAL0002-SEM-ERROS
              PERFORM 2200-MODIFICA-DADOS
                 THRU 2299-MODIFICA-DADOS-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2300-ENVIA-EMAIL
                 THRU 2300-ENVIA-EMAIL-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-OBTEM-EMAIL
      *--------------------------------------------------------------
       2100-OBTEM-EMAIL.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2100-OBTEM-EMAIL'   TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV1050-GUSERNAME         TO ARCD0103-GUSERNAME.

           EXEC SQL
             SELECT GEMAIL
               INTO :ARCD0103-GEMAIL
               FROM ARVT0103
              WHERE UPPER(GUSERNAME) = UPPER(:ARCD0103-GUSERNAME)
           END-EXEC.

           MOVE CON-ARVT0100               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           IF DB2-OK
              MOVE ARCD0103-GEMAIL         TO WS-EMAIL
           ELSE
              MOVE VIAK0002-ABEND-DB2
                                           TO VIAL0002-IND-ERROS
              MOVE VIAK0001-ERRO-DB2
                                           TO VIAL0002-COD-ERRO-GRAVE
           END-IF.
      *
      * Se o utilizador nao tiver email registado da erro
           IF VIAL0002-SEM-ERROS
              IF WS-EMAIL EQUAL SPACES
                 MOVE VIAK0002-ERROS-FUNCAO
                   TO VIAL0002-IND-ERROS
                 MOVE ARCK0002-STATUS-ACTIVO
                   TO ARCV1051-GUSERNAME-S
                 MOVE ARCK0001-USER-SEM-EMAIL
                   TO ARCV1051-GUSERNAME-MSG
              END-IF
           END-IF.
      *
       2199-OBTEM-EMAIL-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2200-MODIFICA-DADOS
      *--------------------------------------------------------------
       2200-MODIFICA-DADOS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2200-MODIFICA-DADOS' TO VIAL0015-CALLER-ID
              MOVE 'ARCV1050-GUSERNAME ' TO VIAL0015-CAMPO-NM(1)
              MOVE  ARCV1050-GUSERNAME   TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV1050-GUSERNAME          TO ARCD0100-GUSERNAME
           MOVE ARCV1050-GPASSWORD          TO ARCD0100-GPASSWORD
           MOVE ARCK0002-PENDENT-STATUS     TO ARCD0100-ISTATUS
                                               ARCV1051-ISTATUS
           MOVE VIAL0001-CUTILIZA-I         TO ARCD0100-CUSERID

           EXEC SQL
                 UPDATE
                ARVT0100_UTILIZADOR
                SET
                       GUSERNAME = :ARCD0100-GUSERNAME
                     , GPASSWORD = :ARCD0100-GPASSWORD
                     , ISTATUS = :ARCD0100-ISTATUS
                     , CUSERID = :ARCD0100-CUSERID
                     , HTIMEST = CURRENT TIMESTAMP
                 WHERE
                    UPPER(GUSERNAME) = UPPER(:ARCD0100-GUSERNAME)
           END-EXEC

           IF VIAL0001-DEBUG-SIM
              MOVE '2200-MODIFICA-DADOS' TO VIAL0015-CALLER-ID
              MOVE 'SQLCODE           '  TO VIAL0015-CAMPO-NM(1)
              MOVE SQLCODE               TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE CON-ARVT0100               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
              IF DB2-NOTFND
                 MOVE VIAK0002-ERROS-FUNCAO
                   TO VIAL0002-IND-ERROS
                    MOVE ARCK0002-STATUS-ACTIVO
                      TO ARCV1051-GUSERNAME-S
                    MOVE ARCK0001-GUSERNAME-N-EXISTS
                      TO ARCV1051-GUSERNAME-MSG
              ELSE
                 IF NOT DB2-OK
                    MOVE VIAK0002-ABEND-DB2
                      TO VIAL0002-IND-ERROS
                    MOVE VIAK0001-ERRO-DB2
                      TO VIAL0002-COD-ERRO-GRAVE
                 END-IF
              END-IF
           ELSE
              MOVE VIAK0002-ABEND-DB2
                TO VIAL0002-IND-ERROS
              MOVE VIAK0001-ERRO-DB2
                TO VIAL0002-COD-ERRO-GRAVE
           END-IF
           .

       2299-MODIFICA-DADOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2300-ENVIA-EMAIL
      *--------------------------------------------------------------
       2300-ENVIA-EMAIL.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2330-ENVIA-EMAIL     ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           STRING 'Foi reativado o utilizador '    DELIMITED BY SIZE
                  ARCV1050-GUSERNAME               DELIMITED BY ' '
                  ' de acesso ao portal Backoffice '
                                                   DELIMITED BY SIZE
                  ' com a senha provisória '       DELIMITED BY SIZE
                  ARCV1050-NOTP                    DELIMITED BY SIZE
                  '. No próximo acesso vai ser '   DELIMITED BY SIZE
                  ' solicitada a alteração da mesma.'
                                                   DELIMITED BY SIZE
           INTO WS-NOTE
      *
           MOVE 'Password de acesso ao portal Backoffice'
                                           TO WS-ASSUNTO
      *
           CALL 'ARL00P00C' USING AQCW0009-DATA
                                  WS-EMAIL
                                  WS-ASSUNTO
                                  WS-NOTE.
      *
       2300-ENVIA-EMAIL-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           MOVE ARCV1051-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE ARCV1051-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE ARCV1051-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES
             TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0010.
           COPY VIAP0016.
