       IDENTIFICATION DIVISION.
       PROGRAM-ID.    ARI31106.
      ******************************************************************
      *     PROGRAMA ARI31106.                                    *
      *                                                                *
      *     CCT
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE ARI31106         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAD0102 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY ARCV3110.
       COPY ARCV3111.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0010.
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY ARCK0001.
       COPY ARCK0002.
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-VIAT0100                 PIC X(08) VALUE 'VIAT0100'.
      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME                  PIC X(08) VALUE 'ARI31106'.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'FIM DA WORKING-STORAGE ARI31106         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA'  TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO ARCV3110-MSG.
           MOVE ARCV3110-ASE               TO ARCV3111-ASE.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA'    TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV3110-ADE               TO ARCV3111-ADE.

           PERFORM 2100-VALIDACOES
              THRU 2199-VALIDACOES-EXIT

           IF VIAL0002-SEM-ERROS
              PERFORM 2200-MODIFICA-DADOS
                 THRU 2299-MODIFICA-DADOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-VALIDACOES
      *--------------------------------------------------------------
       2100-VALIDACOES.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2100-VALIDACOES'       TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           CONTINUE.

       2199-VALIDACOES-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2200-MODIFICA-DADOS
      *--------------------------------------------------------------
       2200-MODIFICA-DADOS.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2200-MODIFICA-DADOS'   TO VIAL0015-CALLER-ID
              MOVE 'ARCV3110-ICTCENTR  '   TO VIAL0015-CAMPO-NM (1)
              MOVE  ARCV3110-ICTCENTR      TO VIAL0015-CAMPO-VLR(1)
              MOVE 'ARCV3110-CAPLIC    '   TO VIAL0015-CAMPO-NM (2)
              MOVE  ARCV3110-CAPLIC        TO VIAL0015-CAMPO-VLR(2)
              MOVE 'ARCV3110-COPCAO    '   TO VIAL0015-CAMPO-NM (3)
              MOVE  ARCV3110-COPCAO        TO VIAL0015-CAMPO-VLR(3)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE DCLVIAD0102.

           MOVE ARCV3110-CAPLIC            TO VIAD0102-CAPLIC
           MOVE ARCV3110-COPCAO            TO VIAD0102-COPCAO
           MOVE ARCV3110-NPROGRAM          TO VIAD0102-NPROGRAM
           MOVE ARCV3110-IDEBUG            TO VIAD0102-IDEBUG
           MOVE ARCV3110-APLICEXT          TO VIAD0102-APLICEXT
           MOVE ARCV3110-IPROCINEXT        TO VIAD0102-IPROCINEXT
           MOVE ARCV3110-PRGINEXT          TO VIAD0102-PRGINEXT
           MOVE ARCV3110-IPROCFIMEXT       TO VIAD0102-IPROCFIMEXT
           MOVE ARCV3110-PRGFIMEXT         TO VIAD0102-PRGFIMEXT
           MOVE ARCV3110-ICTCENTR          TO VIAD0102-ICTCENTR
           MOVE ARCV3110-GDESC             TO VIAD0102-GDESC

           EXEC SQL
              UPDATE VIAT0102
                 SET CAPLIC      = :VIAD0102-CAPLIC
                   , COPCAO      = :VIAD0102-COPCAO
                   , NPROGRAM    = :VIAD0102-NPROGRAM
                   , IDEBUG      = :VIAD0102-IDEBUG
                   , APLICEXT    = :VIAD0102-APLICEXT
                   , IPROCINEXT  = :VIAD0102-IPROCINEXT
                   , PRGINEXT    = :VIAD0102-PRGINEXT
                   , IPROCFIMEXT = :VIAD0102-IPROCFIMEXT
                   , PRGFIMEXT   = :VIAD0102-PRGFIMEXT
                   , ICTCENTR    = :VIAD0102-ICTCENTR
                   , GDESC       = :VIAD0102-GDESC
               WHERE CAPLIC      = :VIAD0102-CAPLIC
                 AND COPCAO      = :VIAD0102-COPCAO
           END-EXEC

           MOVE CON-VIAT0100               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
              IF DB2-NOTFND
                 MOVE VIAK0002-ERROS-FUNCAO
                   TO VIAL0002-IND-ERROS
                    MOVE ARCK0002-STATUS-ACTIVO
                      TO ARCV3111-CAPLIC-S
                    MOVE ARCK0001-CAPLIC-N-EXISTS
                      TO ARCV3111-CAPLIC-MSG
                    MOVE ARCK0002-CAPLIC-AR
                      TO ARCV3111-CAPLIC-CAPLIC
                    MOVE ARCK0002-STATUS-ACTIVO
                      TO ARCV3111-COPCAO-S
                    MOVE ARCK0001-COPCAO-N-EXISTS
                      TO ARCV3111-COPCAO-MSG
                    MOVE ARCK0002-CAPLIC-AR
                      TO ARCV3111-COPCAO-CAPLIC
              ELSE
                 IF NOT DB2-OK
                    MOVE VIAK0002-ABEND-DB2
                      TO VIAL0002-IND-ERROS
                    MOVE VIAK0001-ERRO-DB2
                      TO VIAL0002-COD-ERRO-GRAVE
                 END-IF
              END-IF
           ELSE
              MOVE VIAK0002-ABEND-DB2
                TO VIAL0002-IND-ERROS
              MOVE VIAK0001-ERRO-DB2
                TO VIAL0002-COD-ERRO-GRAVE
           END-IF

           IF VIAL0002-SEM-ERROS
              CONTINUE
           END-IF.

       2299-MODIFICA-DADOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA'   TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV3111-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE ARCV3111-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE ARCV3111-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES                     TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0010.
           COPY VIAP0016.
