       IDENTIFICATION DIVISION.
       PROGRAM-ID.    ARI31103.
      ******************************************************************
      *     PROGRAMA ARI31103.
      *
      *      CCT
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE ARI31103         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY ARCV3110.
       COPY ARCV3111.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY TGCL1000.
       COPY TGCL2000.
       COPY TGCK0002.
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 WS-PROGNAME                  PIC X(08) VALUE 'ARI31103'.
           05 CON-CTABELA-APLICEXT         PIC X(05) VALUE 'AR011'.
           05 CON-CTABELA-PRGINEXT         PIC X(05) VALUE 'AR012'.
           05 CON-CTABELA-PRGFIMEXT        PIC X(05) VALUE 'AR012'.
      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-CTABELA                   PIC X(05) VALUE SPACES.
           05 WS-CCOD                      PIC X(40) VALUE SPACES.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'FIM DA WORKING-STORAGE ARI31103         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA'  TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO ARCV3110-MSG.
           MOVE VIAL0001-MENSAGEM-OUTPUT   TO ARCV3111-MSG.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           MOVE '2000-PROC-PROGRAMA'       TO VIAL0015-CALLER-ID

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-VAL-CAMPOS
                 THRU 2100-VAL-CAMPOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-VAL-CAMPOS
      *--------------------------------------------------------------
       2100-VAL-CAMPOS.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2100-VAL-CAMPOS'       TO VIAL0015-CALLER-ID
              MOVE 'ARCV3110-APLICEXT'     TO VIAL0015-CAMPO-NM(1)
              MOVE  ARCV3110-APLICEXT      TO VIAL0015-CAMPO-VLR(1)
              MOVE 'ARCV3110-PRGINEXT'     TO VIAL0015-CAMPO-NM(2)
              MOVE  ARCV3110-PRGINEXT      TO VIAL0015-CAMPO-VLR(2)
              MOVE 'ARCV3110-PRGFIMEXT'    TO VIAL0015-CAMPO-NM(3)
              MOVE  ARCV3110-PRGFIMEXT     TO VIAL0015-CAMPO-VLR(3)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.


           IF VIAL0002-SEM-ERROS AND ARCV3110-APLICEXT NOT EQUAL SPACES
              MOVE CON-CTABELA-APLICEXT    TO WS-CTABELA
              MOVE ARCV3110-APLICEXT       TO WS-CCOD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO ARCV3111-APLICEXT-S
                 MOVE TGCL2000-CCOD-CAPLIC TO ARCV3111-APLICEXT-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO ARCV3111-APLICEXT-MSG
                 MOVE TGCL2000-GDESC       TO ARCV3111-XDESCAPLICEXT
              ELSE
                 MOVE TGCL2000-GDESC       TO ARCV3110-XDESCAPLICEXT
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND ARCV3110-PRGINEXT NOT EQUAL SPACES
              MOVE CON-CTABELA-PRGINEXT    TO WS-CTABELA
              MOVE ARCV3110-PRGINEXT       TO WS-CCOD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO ARCV3111-PRGINEXT-S
                 MOVE TGCL2000-CCOD-CAPLIC TO ARCV3111-PRGINEXT-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO ARCV3111-PRGINEXT-MSG
                 MOVE TGCL2000-GDESC       TO ARCV3111-XDESCPRGINEXT
              ELSE
                 MOVE TGCL2000-GDESC       TO ARCV3110-XDESCPRGINEXT
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND ARCV3110-PRGFIMEXT NOT EQUAL SPACES
              MOVE CON-CTABELA-PRGFIMEXT   TO WS-CTABELA
              MOVE ARCV3110-PRGFIMEXT      TO WS-CCOD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO ARCV3111-PRGFIMEXT-S
                 MOVE TGCL2000-CCOD-CAPLIC TO ARCV3111-PRGFIMEXT-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO ARCV3111-PRGFIMEXT-MSG
                 MOVE TGCL2000-GDESC       TO ARCV3111-XDESCPRGFIMEXT
              ELSE
                 MOVE TGCL2000-GDESC       TO ARCV3110-XDESCPRGFIMEXT
              END-IF
           END-IF.
      *
       2100-VAL-CAMPOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2200-VAL-TAB-ART05
      *--------------------------------------------------------------
       2200-VAL-TAB-ART05.
      *
           INITIALIZE TGCL2000-MSG.

           MOVE WS-CTABELA                 TO TGCL2000-CTABELA
           MOVE WS-CCOD                    TO TGCL2000-CCOD

           PERFORM CALL-TGCP2000
              THRU CALL-TGCP2000-EXIT.

           IF VIAL0001-DEBUG-SIM
              MOVE '2200-VAL-TAB-ART05'    TO VIAL0015-CALLER-ID
              MOVE 'TGCL2000-CCOD       '  TO VIAL0015-CAMPO-NM(1)
              MOVE  TGCL2000-CCOD          TO VIAL0015-CAMPO-VLR(1)
              MOVE 'TGCL2000-GDESC      '  TO VIAL0015-CAMPO-NM(2)
              MOVE  TGCL2000-GDESC         TO VIAL0015-CAMPO-VLR(2)
              MOVE 'VIAL0002-IND-ERROS  '  TO VIAL0015-CAMPO-NM(3)
              MOVE  VIAL0002-IND-ERROS     TO VIAL0015-CAMPO-VLR(3)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
       2200-VAL-TAB-ART05-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2300-VAL-TAB-OUTRA
      *--------------------------------------------------------------
       2300-VAL-TAB-OUTRA.
      *

           INITIALIZE TGCL1000-MSG.

           MOVE WS-CTABELA                 TO TGCL1000-CTABELA
           MOVE WS-CCOD                    TO TGCL1000-CCOD

           PERFORM CALL-TGCP1000
              THRU CALL-TGCP1000-EXIT.

           IF VIAL0001-DEBUG-SIM
              MOVE '2300-VAL-TAB-OUTRA'    TO VIAL0015-CALLER-ID
              MOVE 'TGCL1000-CCOD       '  TO VIAL0015-CAMPO-NM(1)
              MOVE  TGCL1000-CCOD          TO VIAL0015-CAMPO-VLR(1)
              MOVE 'TGCL1000-GDESC      '  TO VIAL0015-CAMPO-NM(2)
              MOVE  TGCL1000-GDESC         TO VIAL0015-CAMPO-VLR(2)
              MOVE 'VIAL0002-IND-ERROS  '  TO VIAL0015-CAMPO-NM(3)
              MOVE  VIAL0002-IND-ERROS     TO VIAL0015-CAMPO-VLR(3)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

       2300-VAL-TAB-OUTRA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA'   TO VIAL0015-CALLER-ID
              MOVE 'VIAL0002-IND-ERROS  '  TO VIAL0015-CAMPO-NM(1)
              MOVE  VIAL0002-IND-ERROS     TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV3111-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE ARCV3110-MSG               TO VIAL0001-MENSAGEM-INPUT.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY TGCP1000.
           COPY TGCP2000.
