       IDENTIFICATION DIVISION.
       PROGRAM-ID.    ARI42106.
      ******************************************************************
      *     PROGRAMA ARI42106.                                    *
      *                                                                *
      *     Servidor de Email
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE ARI42106         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE ARCD2900 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY ARCV4210.
       COPY ARCV4211.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0010.
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY ARCK0001.
       COPY ARCK0002.
      *
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-ARVT2900 PIC X(08) VALUE 'ARVT2900'.

      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME     PIC  X(08) VALUE 'ARI42106'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE ARI42106         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO ARCV4210-MSG.
           MOVE ARCV4210-ASE               TO ARCV4211-ASE.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV4210-ADE               TO ARCV4211-ADE.

           PERFORM 2100-VALIDACOES
              THRU 2199-VALIDACOES-EXIT

           IF VIAL0002-SEM-ERROS
              PERFORM 2200-MODIFICA-DADOS
                 THRU 2299-MODIFICA-DADOS-EXIT
           END-IF
           .
       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-VALIDACOES
      *--------------------------------------------------------------
       2100-VALIDACOES.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2100-VALIDACOES' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.



           CONTINUE
           .

       2199-VALIDACOES-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2200-MODIFICA-DADOS
      *--------------------------------------------------------------
       2200-MODIFICA-DADOS.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2200-MODIFICA-DADOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV4210-CSERVMAIL
             TO ARCD2900-CSERVMAIL
           MOVE ARCV4210-GSERVMAIL
             TO ARCD2900-GSERVMAIL
           MOVE ARCV4210-CFILEMAIL
             TO ARCD2900-CFILEMAIL
           MOVE ARCV4210-IONOFFMAIL
             TO ARCD2900-IONOFFMAIL
           MOVE ARCV4210-NINTERV
             TO ARCD2900-NINTERV
           MOVE ARCV4210-CAPLIC
             TO ARCD2900-CAPLIC
           MOVE ARCV4210-COPCAO
             TO ARCD2900-COPCAO
           MOVE ARCV4210-CALLERID
             TO ARCD2900-CALLERID
           MOVE ARCV4210-CBALM
             TO ARCD2900-CBALM
           MOVE ARCV4210-CUSEREXTR
             TO ARCD2900-CUSEREXTR
           MOVE ARCV4210-CUTILIZA
             TO ARCD2900-CUTILIZA
           MOVE ARCV4210-CORIGEM
             TO ARCD2900-CORIGEM
           MOVE ARCV4210-CJBQUEUE
             TO ARCD2900-CJBQUEUE
           MOVE ARCV4210-CUSERJOB
             TO ARCD2900-CUSERJOB
           MOVE ARCV4210-CODLIBR
             TO ARCD2900-CODLIBR
           MOVE VIAL0001-CUTILIZA-I
             TO ARCD2900-CUSERID

           EXEC SQL
                 UPDATE
                ARVT2900_SERVMAIL
                SET
                       CSERVMAIL = :ARCD2900-CSERVMAIL
                     , GSERVMAIL = :ARCD2900-GSERVMAIL
                     , CFILEMAIL = :ARCD2900-CFILEMAIL
                     , IONOFFMAIL = :ARCD2900-IONOFFMAIL
                     , NINTERV = :ARCD2900-NINTERV
                     , CAPLIC = :ARCD2900-CAPLIC
                     , COPCAO = :ARCD2900-COPCAO
                     , CALLERID = :ARCD2900-CALLERID
                     , CBALM = :ARCD2900-CBALM
                     , CUSEREXTR = :ARCD2900-CUSEREXTR
                     , CUTILIZA = :ARCD2900-CUTILIZA
                     , CORIGEM = :ARCD2900-CORIGEM
                     , CJBQUEUE = :ARCD2900-CJBQUEUE
                     , CUSERJOB = :ARCD2900-CUSERJOB
                     , CODLIBR = :ARCD2900-CODLIBR
                     , CUSERID = :ARCD2900-CUSERID
                     , HTIMEST = CURRENT TIMESTAMP
                 WHERE
                    CSERVMAIL = :ARCD2900-CSERVMAIL
           END-EXEC


           MOVE CON-ARVT2900               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
              IF DB2-NOTFND
                 MOVE VIAK0002-ERROS-FUNCAO
                   TO VIAL0002-IND-ERROS
                    MOVE ARCK0002-STATUS-ACTIVO
                      TO ARCV4211-CSERVMAIL-S
                    MOVE ARCK0001-CSERVMAIL-N-EXISTS
                      TO ARCV4211-CSERVMAIL-MSG
                    MOVE ARCK0002-CAPLIC
                      TO ARCV4211-CSERVMAIL-CAPLIC
              ELSE
                 IF NOT DB2-OK
                    MOVE VIAK0002-ABEND-DB2
                      TO VIAL0002-IND-ERROS
                    MOVE VIAK0001-ERRO-DB2
                      TO VIAL0002-COD-ERRO-GRAVE
                 END-IF
              END-IF
           ELSE
              MOVE VIAK0002-ABEND-DB2
                TO VIAL0002-IND-ERROS
              MOVE VIAK0001-ERRO-DB2
                TO VIAL0002-COD-ERRO-GRAVE
           END-IF


           IF VIAL0002-SEM-ERROS
                        CONTINUE
           END-IF
           .

       2299-MODIFICA-DADOS-EXIT.
           EXIT.


      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV4211-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE ARCV4211-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE ARCV4211-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES
             TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0010.
           COPY VIAP0016.
