       IDENTIFICATION DIVISION.
       PROGRAM-ID.    ARI42900.
      ******************************************************************
      *     PROGRAMA ARI42900.                                    *
      *                                                                *
      *     Browse Servidor de Email
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE ARI42900         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE ARCD2900 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY ARCV4290.
       COPY ARCV4291.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY ARCK0001.
       COPY ARCK0002.
      *

      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------

      *--------------------------------------------------------------
      *            SWITCH
      *--------------------------------------------------------------
       01  SW-SWITCH.
           05 SW-CURSOR                  PIC X(01) VALUE SPACES.
              88 SW-CURSOR-NONE                    VALUE '0'.
              88 SW-CURSOR-1                       VALUE '1'.
              88 SW-CURSOR-2                       VALUE '2'.
              88 SW-CURSOR-3                       VALUE '3'.
              88 SW-CURSOR-4                       VALUE '3'.
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-ARVT2900 PIC X(08) VALUE 'ARVT2900'.

      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME     PIC  X(08) VALUE 'ARI42900'.
      *--------------------------------------------------------------
      *              DECLARACOES DE CURSORES DB2                     *
      *--------------------------------------------------------------
      *
       01  WS-CURSOR-VARS.
           05 FILLER                     PIC X(01) VALUE SPACES.
           EXEC SQL
                DECLARE CURART01 CURSOR FOR
                 SELECT
                       CSERVMAIL
                     , GSERVMAIL
                     , CFILEMAIL
                     , IONOFFMAIL
                     , NINTERV
                     , CAPLIC
                     , COPCAO
                     , CALLERID
                     , CBALM
                     , CUSEREXTR
                     , CUTILIZA
                     , CORIGEM
                     , CJBQUEUE
                     , CUSERJOB
                     , CODLIBR
                     , CUSERID
                     , HTIMEST
                 FROM ARVT2900_SERVMAIL
                 WHERE

                    CSERVMAIL >= :ARCD2900-CSERVMAIL
                 ORDER BY
                       CSERVMAIL
           END-EXEC

      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE ARI42900         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
      *
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO ARCV4290-MSG.
           MOVE ARCV4290-ASE               TO ARCV4291-ASE.
      *
           MOVE ZEROES                     TO ARCV4291-INDICE.
           PERFORM 1100-LIMPA-OCCURS
              THRU 1199-LIMPA-OCCURS-EXIT
             UNTIL ARCV4291-PAGINA-CHEIA.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            1100-LIMPA-OCCURS
      *--------------------------------------------------------------
       1100-LIMPA-OCCURS.
      *
           ADD 1                       TO ARCV4291-INDICE.
           MOVE SPACES
             TO ARCV4291-D-CSERVMAIL(ARCV4291-INDICE)
           MOVE SPACES
             TO ARCV4291-D-GSERVMAIL(ARCV4291-INDICE)
           MOVE SPACES
             TO ARCV4291-D-CFILEMAIL(ARCV4291-INDICE)
           MOVE SPACES
             TO ARCV4291-D-IONOFFMAIL(ARCV4291-INDICE)
           MOVE ZEROES
             TO ARCV4291-D-NINTERV(ARCV4291-INDICE)
           MOVE SPACES
             TO ARCV4291-D-CAPLIC(ARCV4291-INDICE)
           MOVE SPACES
             TO ARCV4291-D-COPCAO(ARCV4291-INDICE)
           MOVE SPACES
             TO ARCV4291-D-CALLERID(ARCV4291-INDICE)
           MOVE ZEROES
             TO ARCV4291-D-CBALM(ARCV4291-INDICE)
           MOVE SPACES
             TO ARCV4291-D-CUSEREXTR(ARCV4291-INDICE)
           MOVE SPACES
             TO ARCV4291-D-CUTILIZA(ARCV4291-INDICE)
           MOVE SPACES
             TO ARCV4291-D-CORIGEM(ARCV4291-INDICE)
           MOVE SPACES
             TO ARCV4291-D-CJBQUEUE(ARCV4291-INDICE)
           MOVE SPACES
             TO ARCV4291-D-CUSERJOB(ARCV4291-INDICE)
           MOVE SPACES
             TO ARCV4291-D-CODLIBR(ARCV4291-INDICE)
      *
           .
       1199-LIMPA-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE ARCV4290-CSERVMAIL
             TO ARCV4291-CSERVMAIL
      *
           PERFORM 2010-VALIDACOES
              THRU 2019-VALIDACOES-EXIT.

           IF VIAL0002-SEM-ERROS
              PERFORM 2020-OPEN
                 THRU 2029-OPEN-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2030-FETCH
                 THRU 2039-FETCH-EXIT

              IF VIAL0002-SEM-ERROS
                 IF DB2-OK
                    PERFORM 2040-CONTINUA
                       THRU 2049-CONTINUA-EXIT
                 ELSE
                    COMPUTE ARCV4291-DIMINUI-LENGTH EQUAL
                         ARCV4291-INDICE-INVERSO * ARCV4291-LENGTH-OCCUR
                    COMPUTE ARCV4291-LENGTH EQUAL ARCV4291-LENGTH
                         - ARCV4291-DIMINUI-LENGTH
                    MOVE VIAK0002-ERROS-FUNCAO
                                           TO VIAL0002-IND-ERROS
                    MOVE ARCK0002-STATUS-ACTIVO
                      TO ARCV4291-CSERVMAIL-S
                    MOVE ARCK0001-CSERVMAIL-N-EXISTS
                      TO ARCV4291-CSERVMAIL-MSG
                    MOVE ARCK0002-CAPLIC
                      TO ARCV4291-CSERVMAIL-CAPLIC
                 END-IF
              END-IF
              PERFORM 2070-CLOSE
                 THRU 2079-CLOSE-EXIT
           END-IF.


       2099-PROC-PROGRAMA-EXIT.
           EXIT.


      *--------------------------------------------------------------
      *                   2010-VALIDACOES
      *--------------------------------------------------------------
       2010-VALIDACOES.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2010-VALIDACOES' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.


           CONTINUE.

       2019-VALIDACOES-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2020-OPEN
      *--------------------------------------------------------------
       2020-OPEN.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2020-OPEN' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV4290-CSERVMAIL
             TO ARCD2900-CSERVMAIL

           SET SW-CURSOR-NONE TO TRUE


           IF SW-CURSOR-NONE
              SET SW-CURSOR-1 TO TRUE
           END-IF

           EVALUATE TRUE
               WHEN SW-CURSOR-1
                    EXEC SQL
                        OPEN CURART01
                    END-EXEC
           END-EVALUATE.

           MOVE CON-ARVT2900               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       2029-OPEN-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2030-FETCH
      *--------------------------------------------------------------
       2030-FETCH.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2030-FETCH' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EVALUATE TRUE
               WHEN SW-CURSOR-1
                    EXEC SQL
                       FETCH CURART01
                       INTO
                           :ARCD2900-CSERVMAIL
                         , :ARCD2900-GSERVMAIL
                         , :ARCD2900-CFILEMAIL
                         , :ARCD2900-IONOFFMAIL
                         , :ARCD2900-NINTERV
                         , :ARCD2900-CAPLIC
                         , :ARCD2900-COPCAO
                         , :ARCD2900-CALLERID
                         , :ARCD2900-CBALM
                         , :ARCD2900-CUSEREXTR
                         , :ARCD2900-CUTILIZA
                         , :ARCD2900-CORIGEM
                         , :ARCD2900-CJBQUEUE
                         , :ARCD2900-CUSERJOB
                         , :ARCD2900-CODLIBR
                         , :ARCD2900-CUSERID
                         , :ARCD2900-HTIMEST
                    END-EXEC


           END-EVALUATE.

           MOVE CON-ARVT2900               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       2039-FETCH-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                       2040-CONTINUA
      *--------------------------------------------------------------
       2040-CONTINUA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2040-CONTINUA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ZEROES                     TO ARCV4291-INDICE.
           PERFORM 2050-TRATA-OCCURS
              THRU 2059-TRATA-OCCURS-EXIT
             UNTIL DB2-NOTFND
                OR ARCV4291-PAGINA-CHEIA
                OR NOT VIAL0002-SEM-ERROS.

           IF VIAL0002-SEM-ERROS
              IF NOT ARCV4291-PAGINA-CHEIA
                    COMPUTE ARCV4291-INDICE-INVERSO EQUAL
                         ARCV4291-INDICE-INVERSO - ARCV4291-INDICE
                    COMPUTE ARCV4291-DIMINUI-LENGTH EQUAL
                         ARCV4291-INDICE-INVERSO * ARCV4291-LENGTH-OCCUR
                    COMPUTE ARCV4291-LENGTH EQUAL ARCV4291-LENGTH -
                         ARCV4291-DIMINUI-LENGTH
                    SET  VIAL0002-FIM-CONSULTA TO TRUE
              END-IF
              IF DB2-NOTFND
                    SET  VIAL0002-FIM-CONSULTA TO TRUE
              END-IF
           END-IF.

       2049-CONTINUA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2050-TRATA-OCCURS
      *--------------------------------------------------------------
       2050-TRATA-OCCURS.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2050-TRATA-OCCURS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           ADD 1                       TO ARCV4291-INDICE.
           MOVE ARCD2900-CSERVMAIL
             TO ARCV4291-D-CSERVMAIL(ARCV4291-INDICE).
           MOVE ARCD2900-GSERVMAIL
             TO ARCV4291-D-GSERVMAIL(ARCV4291-INDICE).
           MOVE ARCD2900-CFILEMAIL
             TO ARCV4291-D-CFILEMAIL(ARCV4291-INDICE).
           MOVE ARCD2900-IONOFFMAIL
             TO ARCV4291-D-IONOFFMAIL(ARCV4291-INDICE).
           MOVE ARCD2900-NINTERV
             TO ARCV4291-D-NINTERV(ARCV4291-INDICE).
           MOVE ARCD2900-CAPLIC
             TO ARCV4291-D-CAPLIC(ARCV4291-INDICE).
           MOVE ARCD2900-COPCAO
             TO ARCV4291-D-COPCAO(ARCV4291-INDICE).
           MOVE ARCD2900-CALLERID
             TO ARCV4291-D-CALLERID(ARCV4291-INDICE).
           MOVE ARCD2900-CBALM
             TO ARCV4291-D-CBALM(ARCV4291-INDICE).
           MOVE ARCD2900-CUSEREXTR
             TO ARCV4291-D-CUSEREXTR(ARCV4291-INDICE).
           MOVE ARCD2900-CUTILIZA
             TO ARCV4291-D-CUTILIZA(ARCV4291-INDICE).
           MOVE ARCD2900-CORIGEM
             TO ARCV4291-D-CORIGEM(ARCV4291-INDICE).
           MOVE ARCD2900-CJBQUEUE
             TO ARCV4291-D-CJBQUEUE(ARCV4291-INDICE).
           MOVE ARCD2900-CUSERJOB
             TO ARCV4291-D-CUSERJOB(ARCV4291-INDICE).
           MOVE ARCD2900-CODLIBR
             TO ARCV4291-D-CODLIBR(ARCV4291-INDICE).
      *
           PERFORM 2030-FETCH
              THRU 2039-FETCH-EXIT.
      *
       2059-TRATA-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2070-CLOSE
      *--------------------------------------------------------------
       2070-CLOSE.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2070-CLOSE' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EVALUATE TRUE
               WHEN SW-CURSOR-1
                    EXEC SQL
                        CLOSE CURART01
                    END-EXEC
           END-EVALUATE.

       2079-CLOSE-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV4291-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE ARCV4291-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE ARCV4291-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ARCV4291-INDICE            TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.


