       IDENTIFICATION DIVISION.
       PROGRAM-ID.    ARI54102.
      ******************************************************************
      *     PROGRAMA ARI54102.
      *
      *     Perfis Actions- Acessos
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE ARI54102         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE ARCD1000 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY ARCV5410.
       COPY ARCV5411.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY ARCK0001.
       COPY ARCK0002.
       COPY TGCL1000.
       COPY TGCL2000.
       COPY TGCK0002.
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-ARVT1000 PIC X(08) VALUE 'ARVT1000'.
           05 CON-DUMMY-CURL PIC X(14) VALUE 'n/a'.
           05 CON-CTABELA-ACESSO1  PIC X(05) VALUE 'AR050'.
           05 CON-CTABELA-IBROWSE  PIC X(05) VALUE 'AR061'.
           05 CON-CTABELA-ICREATE  PIC X(05) VALUE 'AR061'.
           05 CON-CTABELA-IMODIFY  PIC X(05) VALUE 'AR061'.
           05 CON-CTABELA-IDELETE  PIC X(05) VALUE 'AR061'.
      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-CTABELA                   PIC X(05) VALUE SPACES.
           05 WS-CCOD                      PIC X(40) VALUE SPACES.
      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME            PIC  X(08) VALUE 'ARI54102'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE ARI54102         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
      *
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO ARCV5410-MSG.
           MOVE ARCV5410-ASE               TO ARCV5411-ASE.
      *
           IF VIAL0002-SEM-ERROS
              PERFORM 1200-VALIDACOES
                 THRU 1299-VALIDACOES-EXIT
           END-IF.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       1200-VALIDACOES.

           IF ARCV5410-CURL EQUAL CON-DUMMY-CURL
              MOVE VIAK0002-ERROS-FUNCAO       TO VIAL0002-IND-ERROS
              MOVE ARCK0002-STATUS-ACTIVO      TO ARCV5411-CURL-S
              MOVE ARCK0001-N-PERMIT-MENU      TO ARCV5411-CURL-MSG
              MOVE ARCK0002-CAPLIC-AR          TO ARCV5411-CURL-CAPLIC
           END-IF.
      *
       1299-VALIDACOES-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV5410-ADE       TO ARCV5411-ADE.

           IF ARCV5410-CURL  EQUAL SPACES
              MOVE VIAK0002-ERROS-FUNCAO   TO VIAL0002-IND-ERROS
              MOVE ARCK0002-STATUS-ACTIVO  TO ARCV5411-CURL-S
              MOVE ARCK0001-REGISTO-N-E-TRANS
                                           TO ARCV5411-CURL-MSG
              MOVE ARCK0002-CAPLIC-AR      TO ARCV5411-CURL-CAPLIC
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-VAL-CAMPOS
                 THRU 2100-VAL-CAMPOS-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2300-VALIDA-DADOS
                 THRU 2399-VALIDA-DADOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2100-VAL-CAMPOS
      *--------------------------------------------------------------
       2100-VAL-CAMPOS.
      *
           MOVE '2100-VAL-CAMPOS'          TO VIAL0015-CALLER-ID
           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           IF  VIAL0002-SEM-ERROS
           AND ARCV5411-XDESCIBROWSE EQUAL SPACES
           AND ARCV5411-IBROWSE NOT EQUAL SPACES
              MOVE CON-CTABELA-IBROWSE     TO WS-CTABELA
              MOVE ARCV5411-IBROWSE        TO WS-CCOD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC       TO ARCV5411-XDESCIBROWSE
              END-IF
           END-IF.
      *
           IF  VIAL0002-SEM-ERROS
           AND ARCV5411-XDESCICREATE EQUAL SPACES
           AND ARCV5411-ICREATE NOT EQUAL SPACES
              MOVE CON-CTABELA-ICREATE     TO WS-CTABELA
              MOVE ARCV5411-ICREATE        TO WS-CCOD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC       TO ARCV5411-XDESCICREATE
              END-IF
           END-IF.
      *
           IF  VIAL0002-SEM-ERROS
           AND ARCV5411-XDESCIMODIFY EQUAL SPACES
           AND ARCV5411-IMODIFY NOT EQUAL SPACES
              MOVE CON-CTABELA-IMODIFY     TO WS-CTABELA
              MOVE ARCV5411-IMODIFY        TO WS-CCOD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC       TO ARCV5411-XDESCIMODIFY
              END-IF
           END-IF.
      *
           IF  VIAL0002-SEM-ERROS
           AND ARCV5411-XDESCIDELETE EQUAL SPACES
           AND ARCV5411-IDELETE NOT EQUAL SPACES
              MOVE CON-CTABELA-IDELETE     TO WS-CTABELA
              MOVE ARCV5411-IDELETE        TO WS-CCOD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC       TO ARCV5411-XDESCIDELETE
              END-IF
           END-IF.
      *
       2100-VAL-CAMPOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2200-VAL-TAB-ART05
      *--------------------------------------------------------------
       2200-VAL-TAB-ART05.
      *
           MOVE '2200-VAL-TAB-ART05'       TO VIAL0015-CALLER-ID
           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           INITIALIZE TGCL2000-MSG         REPLACING  NUMERIC BY ZEROES
                                                ALPHANUMERIC BY SPACES.
      *
           MOVE WS-CTABELA                 TO TGCL2000-CTABELA
           MOVE WS-CCOD                    TO TGCL2000-CCOD
      *
           PERFORM CALL-TGCP2000
              THRU CALL-TGCP2000-EXIT.
      *
       2200-VAL-TAB-ART05-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2300-VALIDA-DADOS
      *--------------------------------------------------------------
       2300-VALIDA-DADOS.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2300-VALIDA-DADOS'      TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

      * Se o acesso tiver a N , uso o perfil MASTER
      * Se o acesso tiver a S , uso o perfil NOVO

           IF ARCV5410-ACESSO  EQUAL 'S'
              MOVE ARCV5410-CPERFIL        TO ARCD1000-CPERFIL
              PERFORM 2400-OBTEM-DADOS
                 THRU 2499-OBTEM-DADOS-EXIT
      *
              EVALUATE TRUE
                 WHEN DB2-OK
                    CONTINUE
                 WHEN DB2-NOTFND
                    MOVE 'N'               TO ARCV5410-ACESSO
                                              ARCV5411-ACESSO
                    MOVE ARCV5410-CPERFMAS TO ARCD1000-CPERFIL
                    PERFORM 2400-OBTEM-DADOS
                       THRU 2499-OBTEM-DADOS-EXIT
                 WHEN OTHER
                    MOVE VIAK0002-ERROS-FUNCAO
                                           TO VIAL0002-IND-ERROS
                    MOVE ARCK0002-STATUS-ACTIVO
                                           TO ARCV5411-CPERFIL-S
                    MOVE ARCK0001-CPERFIL-N-EXISTS
                                           TO ARCV5411-CPERFIL-MSG
                    MOVE ARCK0002-CAPLIC-AR
                                           TO ARCV5411-CPERFIL-CAPLIC
                    MOVE ARCK0002-STATUS-ACTIVO
                                           TO ARCV5411-CURL-S
                    MOVE ARCK0001-CURL-N-EXISTS
                                           TO ARCV5411-CURL-MSG
                    MOVE ARCK0002-CAPLIC-AR
                                           TO ARCV5411-CURL-CAPLIC
              END-EVALUATE
      *
           ELSE
              MOVE ARCV5410-CPERFMAS       TO ARCD1000-CPERFIL
              PERFORM 2400-OBTEM-DADOS
                 THRU 2499-OBTEM-DADOS-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              IF DB2-OK
                 MOVE ARCV5410-CPERFIL     TO ARCV5411-CPERFIL
                 MOVE ARCD1000-CURL        TO ARCV5411-CURL
                 MOVE ARCD1000-IBROWSE     TO ARCV5411-IBROWSE
                 MOVE ARCD1000-ICREATE     TO ARCV5411-ICREATE
                 MOVE ARCD1000-IMODIFY     TO ARCV5411-IMODIFY
                 MOVE ARCD1000-IDELETE     TO ARCV5411-IDELETE
              ELSE
                 MOVE VIAK0002-ERROS-FUNCAO
                                           TO VIAL0002-IND-ERROS
                 MOVE ARCK0002-STATUS-ACTIVO
                                           TO ARCV5411-CPERFIL-S
                 MOVE ARCK0001-CPERFIL-N-EXISTS
                                           TO ARCV5411-CPERFIL-MSG
                 MOVE ARCK0002-CAPLIC-AR
                                           TO ARCV5411-CPERFIL-CAPLIC
                 MOVE ARCK0002-STATUS-ACTIVO
                                           TO ARCV5411-CURL-S
                 MOVE ARCK0001-CURL-N-EXISTS
                                           TO ARCV5411-CURL-MSG
                 MOVE ARCK0002-CAPLIC-AR
                                           TO ARCV5411-CURL-CAPLIC
              END-IF
           END-IF.

       2399-VALIDA-DADOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2400-OBTEM-DADOS
      *--------------------------------------------------------------
       2400-OBTEM-DADOS.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2400-OBTEM-DADOS '     TO VIAL0015-CALLER-ID
              MOVE 'ARCD1000-CPERFIL '     TO VIAL0015-CAMPO-NM(1)
              MOVE  ARCD1000-CPERFIL       TO VIAL0015-CAMPO-VLR(1)
              MOVE 'ARCV5410-CURL    '     TO VIAL0015-CAMPO-NM(2)
              MOVE  ARCV5410-CURL          TO VIAL0015-CAMPO-VLR(2)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE ARCV5410-CURL              TO ARCD1000-CURL
      *
           EXEC SQL
                 SELECT
                       CPERFIL
                     , CURL
                     , IBROWSE
                     , ICREATE
                     , IMODIFY
                     , IDELETE
                     , CUSERID
                     , HTIMEST
                 INTO
                       :ARCD1000-CPERFIL
                     , :ARCD1000-CURL
                     , :ARCD1000-IBROWSE
                     , :ARCD1000-ICREATE
                     , :ARCD1000-IMODIFY
                     , :ARCD1000-IDELETE
                     , :ARCD1000-CUSERID
                     , :ARCD1000-HTIMEST
                 FROM ARVT1000_PERFIL_ACTIONS
                 WHERE
                    CPERFIL = :ARCD1000-CPERFIL
                     AND CURL = :ARCD1000-CURL
           END-EXEC
      *
           MOVE CON-ARVT1000               TO VIAL0002-TABLE-NAME.
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
       2499-OBTEM-DADOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV5411-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE ARCV5411-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE ARCV5411-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES                     TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY TGCP1000.
           COPY TGCP2000.
