       IDENTIFICATION DIVISION.
      ******************************************************************
       PROGRAM-ID.    ARI72206.
      ******************************************************************
      *     Utilizadores                                               *
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
       CONFIGURATION SECTION.
           SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
      ******************************************************************
       DATA DIVISION.
      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
       01  FILLER                       PIC  X(40) VALUE
           'INICIO WORKING-STORAGE ARI72206         '.
      ******************************************************************
           EXEC SQL INCLUDE ARCD0103 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      ******************************************************************
       COPY ARCV7220.
       COPY ARCV7221.
      ******************************************************************
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY ARCK0001.
       COPY ARCK0002.
       COPY VIAL0015.
      ******************************************************************
       01  WS-CONSTANTES.
           05 CON-ARVT0103              PIC  X(08) VALUE 'ARVT0103'.
           05 WS-PROGNAME               PIC  X(08) VALUE 'ARI72206'.
      ******************************************************************
       01  FILLER                       PIC  X(40) VALUE
           'FIM DA WORKING-STORAGE ARI72206         '.
      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
       COPY VIAL0004.
      ******************************************************************
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      ******************************************************************
       0000-MAINLINE.
      ******************************************************************
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           IF VIAL0002-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2099-PROC-PROGRAMA-EXIT
           END-IF.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.

      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************
           MOVE '2100-OBTEM-DADOS         ' TO VIAL0015-CALLER-ID.
           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT     TO ARCV7220-MSG.
           MOVE ARCV7220-ASE                TO ARCV7221-ASE.
           MOVE ARCV7220-ADE                TO ARCV7221-ADE.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************
           MOVE '2100-OBTEM-DADOS         ' TO VIAL0015-CALLER-ID.
           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
                PERFORM 2100-VALIDACOES
                   THRU 2100-VALIDACOES-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
                PERFORM 2200-MODIFICA-DADOS
                   THRU 2299-MODIFICA-DADOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2100-VALIDACOES.
      ******************************************************************
           MOVE '2100-VALIDACOES          ' TO VIAL0015-CALLER-ID.
           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.


       2100-VALIDACOES-EXIT.
           EXIT.

      ******************************************************************
       2200-MODIFICA-DADOS.
      ******************************************************************
           MOVE '2200-MODIFICA-DADOS      ' TO VIAL0015-CALLER-ID.
           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV7220-GUSERNAME          TO ARCD0103-GUSERNAME.
           MOVE ARCV7220-GEMAIL             TO ARCD0103-GEMAIL.

           EXEC SQL
                UPDATE ARVT0103
                   SET GEMAIL = :ARCD0103-GEMAIL
                 WHERE UPPER(GUSERNAME) = UPPER(:ARCD0103-GUSERNAME)
           END-EXEC

           MOVE CON-ARVT0103                TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
              IF DB2-NOTFND
                 MOVE VIAK0002-ERROS-FUNCAO
                   TO VIAL0002-IND-ERROS
                 MOVE ARCK0002-STATUS-ACTIVO
                   TO ARCV7221-GUSERNAME-S
                 MOVE ARCK0001-GUSERNAME-N-EXISTS
                   TO ARCV7221-GUSERNAME-MSG
              ELSE
                 IF NOT DB2-OK
                    MOVE VIAK0002-ABEND-DB2
                      TO VIAL0002-IND-ERROS
                    MOVE VIAK0001-ERRO-DB2
                      TO VIAL0002-COD-ERRO-GRAVE
                 END-IF
              END-IF
           ELSE
              MOVE VIAK0002-ABEND-DB2
                TO VIAL0002-IND-ERROS
              MOVE VIAK0001-ERRO-DB2
                TO VIAL0002-COD-ERRO-GRAVE
           END-IF.

       2299-MODIFICA-DADOS-EXIT.
           EXIT.

      ******************************************************************
       3000-FINAL-PROGRAMA.
      ******************************************************************
           MOVE '2100-OBTEM-DADOS         ' TO VIAL0015-CALLER-ID.
           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCV7221-MSG                TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE ARCV7221-LENGTH             TO VIAL0001-LENGTH-MSG.
           MOVE ARCV7221-NR-CAMPOS          TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES                      TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      ******************************************************************
           COPY VIAP0016.
