       IDENTIFICATION DIVISION.
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
      * PROGRAM NAME
      ******************************************************************
       PROGRAM-ID. ARM50060.
      ******************************************************************
      *                                                                *
      *   AR - ARQUITECTURA                                            *
      *                                                                *
      ******************************************************************
      * Obter email na tabela ART50                                    *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      *          *        *        *                                   *
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
      ******************************************************************
      *                     CONFIGURATION SECTION                      *
      ******************************************************************
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                    WORKING STORAGE SECTION                     *
      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'INICIO WORKING-STORAGE'.
      ******************************************************************
      * PROGRAM CONTROL
      ******************************************************************
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME               PIC  X(10) VALUE 'ARM50060'.
      ******************************************************************
      * ARQUITECTURA
      ******************************************************************
           COPY ARCK0001.
           COPY ARCK0002.
           COPY ARCL2205.
           COPY ETCK0001.
           COPY ETCK0002.
           COPY VIAK0001.
           COPY VIAK0002.
           COPY VIAL0015.
      *
      ******************************************************************
      * TABELAS
      ******************************************************************
      *
      ******************************************************************
      * CONSTANTES
      ******************************************************************
       01  WS-CONSTANTES.
           05 CON-ARVT5001              PIC  X(10) VALUE 'ARVT5001'.
      *
      ******************************************************************
      * VARIAVEIS
      ******************************************************************
       01  WS-VARIAVEIS.
          10 WS-CTIPOINT                PIC  X(03).
          10 WS-CINTERV                 PIC  X(25).
             88 WS-TODOS-INTERV                     VALUE 'TODOS'.
      *
      ******************************************************************
      * APIS
      ******************************************************************
      *
      ******************************************************************
      * COPYS
      ******************************************************************
      *
      ******************************************************************
      * DB2
      ******************************************************************
           EXEC SQL INCLUDE ARCD5001  END-EXEC.
           EXEC SQL INCLUDE SQLCA     END-EXEC.
      *
      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'FIM DA WORKING-STORAGE'.
      *
      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
      *                        LINKAGE SECTION                         *
      ******************************************************************
           COPY ETCL0002.
           COPY ARCL5060.
      *
      ******************************************************************
       PROCEDURE DIVISION USING ETCL0002-COMMAREA
                                ARCL5060-DATA.
      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
       0000-MAINLINE.
      ******************************************************************
           MOVE '0000-MAINLINE            ' TO VIAL0015-CALLER-ID.
           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.
      *
           IF ETCL0002-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2000-PROC-PROGRAMA-EXIT
           END-IF.
      *
           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.
      *
       0000-MAINLINE-EXIT.
           GOBACK.
      *
      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************
           MOVE '1000-INICIO-PROGRAMA'      TO VIAL0015-CALLER-ID.
           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           PERFORM 1100-INICIALIZA
              THRU 1100-INICIALIZA-EXIT.
      *
           PERFORM 1200-VALIDAR-LINKAGE
              THRU 1200-VALIDAR-LINKAGE-EXIT.
      *
       1000-INICIO-PROGRAMA-EXIT.
           EXIT.
      *
      ******************************************************************
       1100-INICIALIZA.
      ******************************************************************
           MOVE '1100-INICIALIZA          ' TO VIAL0015-CALLER-ID.
           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           INITIALIZE WS-VARIAVEIS  REPLACING  NUMERIC BY ZEROES
                                          ALPHANUMERIC BY SPACES.
      *
       1100-INICIALIZA-EXIT.
           EXIT.
      *
      ******************************************************************
       1200-VALIDAR-LINKAGE.
      ******************************************************************
           MOVE '1200-VALIDAR-LINKAGE     ' TO VIAL0015-CALLER-ID.
           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
      *
       1200-VALIDAR-LINKAGE-EXIT.
           EXIT.
      *
      ******************************************************************
      *                    Processamento Principal                     *
      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************
           MOVE '2000-PROC-PROGRAMA '       TO VIAL0015-CALLER-ID.
           IF ETCL0002-DEBUG-SIM
              MOVE 'ARCL5060-CTIPOINT  '    TO VIAL0015-CAMPO-NM (1)
              MOVE 'ARCL5060-CINTERV   '    TO VIAL0015-CAMPO-NM (2)
              MOVE  ARCL5060-CTIPOINT       TO VIAL0015-CAMPO-VLR(1)
              MOVE  ARCL5060-CINTERV        TO VIAL0015-CAMPO-VLR(2)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
      * Tenta obter o email especifico para o interveniente
           IF ETCL0002-SEM-ERROS
              MOVE ARCL5060-CTIPOINT        TO WS-CTIPOINT
              MOVE ARCL5060-CINTERV         TO WS-CINTERV
              PERFORM 2100-OBTER-INTERVENIENTE
                 THRU 2100-OBTER-INTERVENIENTE-EXIT
           END-IF.
      *
      * Se nao encontrar, tentar obter o email generico para o tipo de
      * interveniente (CINTERV = 'TODOS')
           IF ETCL0002-SEM-ERROS
              IF ARCL5060-GEMAIL EQUAL SPACES
                 SET  WS-TODOS-INTERV       TO TRUE
                 PERFORM 2100-OBTER-INTERVENIENTE
                    THRU 2100-OBTER-INTERVENIENTE-EXIT
              END-IF
           END-IF.
      *
       2000-PROC-PROGRAMA-EXIT.
           EXIT.
      *
      ******************************************************************
       2100-OBTER-INTERVENIENTE.
      ******************************************************************
           MOVE '2100-OBTER-INTERVENIENTE ' TO VIAL0015-CALLER-ID.
           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           INITIALIZE DCLARCD5001           REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.
      *
           MOVE WS-CTIPOINT                 TO ARCD5001-CTIPOINT.
           MOVE WS-CINTERV                  TO ARCD5001-CINTERV.
      *
           EXEC SQL
                SELECT GEMAIL
                INTO  :ARCD5001-GEMAIL
                FROM   ARVT5001
                WHERE  CTIPOINT = :ARCD5001-CTIPOINT
                AND    CINTERV  = :ARCD5001-CINTERV
                FETCH  FIRST ROW ONLY
           END-EXEC.
      *
           MOVE CON-ARVT5001                TO ETCL0002-TABLE-NAME.
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT
      *
           IF ETCL0002-SEM-ERROS
              EVALUATE TRUE
              WHEN ETCL0002-SQL-OK
                   MOVE ARCD5001-GEMAIL     TO ARCL5060-GEMAIL
              WHEN ETCL0002-SQL-NOTFND
                   MOVE SPACES              TO ARCL5060-GEMAIL
              END-EVALUATE
           END-IF.
      *
       2100-OBTER-INTERVENIENTE-EXIT.
           EXIT.
      *
      ******************************************************************
       3000-FIM-PROGRAMA.
      ******************************************************************
           MOVE '3000-FIM-PROGRAMA'         TO VIAL0015-CALLER-ID.
           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
       3000-FIM-PROGRAMA-EXIT.
           EXIT.
      *
      ******************************************************************
      *                     Procedimentos Externos                     *
      ******************************************************************
           COPY ETCP0021.
           COPY VIAP0015.
           COPY ARCR2206.
      ******************************************************************
      *                       Via Consulting Way                       *
      ******************************************************************
