       IDENTIFICATION DIVISION.
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
       PROGRAM-ID. ARM90070.
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
      ******************************************************************
      *                     CONFIGURATION SECTION                      *
      ******************************************************************
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
      *                      INPUT-OUTPUT SECTION                      *
      ******************************************************************
       FILE-CONTROL.
      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       FILE SECTION.
      ******************************************************************
      *                          FILE SECTION                          *
      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                    WORKING STORAGE SECTION                     *
      ******************************************************************
      * CONSTANTES
      ******************************************************************
       01  WS-CONSTANTES.
           05 WS-PROGNAME               PIC  X(10) VALUE 'ARM90070'.
           05 WS-ARVT0200               PIC  X(10) VALUE 'ARVT0200'.
           05 WS-VIAVT1300              PIC  X(10) VALUE 'VIAVT1300'.
           05 WS-VIAVT2300              PIC  X(10) VALUE 'VIAVT2300'.
      ******************************************************************
      * VARIAVEIS
      ******************************************************************
       01  WS-VARIAVEIS.
           05 FILLER                    PIC  X(01).
      ******************************************************************
      * COPYS
      ******************************************************************
           COPY ARCK0001.
           COPY ARCK0002.
           COPY ETCK0001.
           COPY ETCK0002.
           COPY ETCL0002.
           COPY VIAK0001.
           COPY VIAL0015.
           COPY ARCL2305.
      ******************************************************************
      * DB2
      ******************************************************************
           EXEC SQL INCLUDE ARCD0200  END-EXEC.
           EXEC SQL INCLUDE VIACD1300 END-EXEC.
           EXEC SQL INCLUDE VIACD2300 END-EXEC.
           EXEC SQL INCLUDE SQLCA     END-EXEC.

           EXEC SQL
                DECLARE CRS_ART02 CURSOR FOR
                SELECT DISTINCT CHIERAR5
                              , CURL5
                  FROM ARVT0200_PERFIL
                 WHERE CPERFIL = :ARCD0200-CPERFIL
                   AND CHIERAR1 = :ARCD0200-CHIERAR1
                   AND CHIERAR2 = :ARCD0200-CHIERAR2
                   AND CHIERAR3 = :ARCD0200-CHIERAR3
                   AND CHIERAR4 = :ARCD0200-CHIERAR4
                   AND CHIERAR5 <> :ARCD0200-CHIERAR5
                       ORDER BY CHIERAR5
           END-EXEC.

      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'FIM DA WORKING-STORAGE'.
      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
      *                        LINKAGE SECTION                         *
      ******************************************************************
           COPY ARCL9070.
      ******************************************************************
       PROCEDURE DIVISION USING ARCL9070-COMMAREA.
      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
       0000-MAINLINE.
      ******************************************************************
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           IF ETCL0002-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2000-PROC-PROGRAMA-EXIT
           END-IF.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.

       0000-MAINLINE-EXIT.
           GOBACK.

      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************
           MOVE '1000-INICIO-PROGRAMA     ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE ETCL0002-COMMAREA     REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

DEBUG      SET  ETCL0002-DEBUG-SIM          TO TRUE.
           SET  ETCL0002-SEM-ERROS          TO TRUE.
           MOVE ZEROES                      TO ETCL0002-NR-ERRO.
           MOVE SPACES                      TO ETCL0002-CAPLIC-ERRO.

           IF ETCL0002-SEM-ERROS
              PERFORM 1100-FLIP-FLOP
                 THRU 1100-FLIP-FLOP-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              PERFORM 1200-VALIDAR-INPUT
                 THRU 1200-VALIDAR-INPUT-EXIT
           END-IF.

           PERFORM 1300-INIT-OUTPUT
              THRU 1300-INIT-OUTPUT-EXIT
                   VARYING ARCL9070-INDICE FROM 1 BY 1
                     UNTIL ARCL9070-MAX-OCCURS.

           MOVE ZEROES                      TO ARCL9070-INDICE.

       1000-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       1100-FLIP-FLOP.
      ******************************************************************
           MOVE '1100-FLIP-FLOP           ' TO VIAL0015-CALLER-ID.

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE ARCL2305-COMMAREA     REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

           PERFORM CALL-ARR02305
              THRU CALL-ARR02305-EXIT.

       1100-FLIP-FLOP-EXIT.
           EXIT.

      ******************************************************************
       1200-VALIDAR-INPUT.
      ******************************************************************
           MOVE '1200-VALIDAR-INPUT       ' TO VIAL0015-CALLER-ID.

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              IF ARCL9070-CPERFIL EQUAL SPACES
                 SET  ETCL0002-ERROS-FUNCAO TO TRUE
+801             MOVE ARCK0001-ERR-CPERFIL
                                            TO ETCL0002-NR-ERRO
                 MOVE ARCK0002-CAPLIC-AR    TO ETCL0002-CAPLIC-ERRO
              END-IF
           END-IF.

           IF ETCL0002-SEM-ERROS
              IF ARCL9070-CHIERAR1 EQUAL SPACES
                 SET  ETCL0002-ERROS-FUNCAO TO TRUE
+808             MOVE ARCK0001-ERR-CHIERAR1
                                            TO ETCL0002-NR-ERRO
                 MOVE ARCK0002-CAPLIC-AR    TO ETCL0002-CAPLIC-ERRO
              END-IF
           END-IF.

           IF ETCL0002-SEM-ERROS
              IF ARCL9070-CHIERAR2 EQUAL SPACES
                 SET  ETCL0002-ERROS-FUNCAO TO TRUE
+810             MOVE ARCK0001-ERR-CHIERAR2
                                            TO ETCL0002-NR-ERRO
                 MOVE ARCK0002-CAPLIC-AR    TO ETCL0002-CAPLIC-ERRO
              END-IF
           END-IF.

           IF ETCL0002-SEM-ERROS
              IF ARCL9070-CHIERAR3 EQUAL SPACES
                 SET  ETCL0002-ERROS-FUNCAO TO TRUE
+812             MOVE ARCK0001-ERR-CHIERAR3
                                            TO ETCL0002-NR-ERRO
                 MOVE ARCK0002-CAPLIC-AR    TO ETCL0002-CAPLIC-ERRO
              END-IF
           END-IF.

           IF ETCL0002-SEM-ERROS
              IF ARCL9070-CHIERAR4 EQUAL SPACES
                 SET  ETCL0002-ERROS-FUNCAO TO TRUE
+814             MOVE ARCK0001-ERR-CHIERAR4
                                            TO ETCL0002-NR-ERRO
                 MOVE ARCK0002-CAPLIC-AR    TO ETCL0002-CAPLIC-ERRO
              END-IF
           END-IF.

       1200-VALIDAR-INPUT-EXIT.
           EXIT.

      ******************************************************************
       1300-INIT-OUTPUT.
      ******************************************************************
           MOVE '1300-INIT-OUTPUT         ' TO VIAL0015-CALLER-ID.

           MOVE SPACES
             TO ARCL9070-CHIERAR5 (ARCL9070-INDICE).
           MOVE SPACES
             TO ARCL9070-CURL5    (ARCL9070-INDICE).

       1300-INIT-OUTPUT-EXIT.
           EXIT.

      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************
           MOVE '2000-PROC-PROGRAMA       ' TO VIAL0015-CALLER-ID.

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              PERFORM 2100-OPEN-CURSOR
                 THRU 2100-OPEN-CURSOR-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              PERFORM 2200-FETCH-CURSOR
                 THRU 2200-FETCH-CURSOR-EXIT

              PERFORM 2300-PROC-CURSOR
                 THRU 2300-PROC-CURSOR-EXIT
                UNTIL (ARCL9070-MAX-OCCURS   )
                   OR (NOT ETCL0002-SQL-OK       )
                   OR (NOT ETCL0002-SEM-ERROS)

              EXEC SQL
                   CLOSE CRS_ART02
              END-EXEC
           END-IF.

       2000-PROC-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2100-OPEN-CURSOR.
      ******************************************************************
           MOVE '2100-OPEN-CURSOR         ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE DCLARCD0200           REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

           MOVE ARCL9070-CPERFIL            TO ARCD0200-CPERFIL.
           MOVE ARCL9070-CHIERAR1           TO ARCD0200-CHIERAR1.
           MOVE ARCL9070-CHIERAR2           TO ARCD0200-CHIERAR2.
           MOVE ARCL9070-CHIERAR3           TO ARCD0200-CHIERAR3.
           MOVE ARCL9070-CHIERAR4           TO ARCD0200-CHIERAR4.
           MOVE SPACES                      TO ARCD0200-CHIERAR5.

           EXEC SQL
                OPEN CRS_ART02
           END-EXEC.

           MOVE WS-ARVT0200                 TO ETCL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF ETCL0002-SEM-ERROS
              EVALUATE TRUE
              WHEN ETCL0002-SQL-OK
              WHEN ETCL0002-SQL-NOTFND
                   CONTINUE
              WHEN OTHER
                   SET  ETCL0002-ABEND-DB2  TO TRUE
+5                 MOVE VIAK0001-ERRO-DB2   TO ETCL0002-NR-ERRO
                   MOVE ARCK0002-CAPLIC-AT  TO ETCL0002-CAPLIC-ERRO
              END-EVALUATE
           END-IF.

       2100-OPEN-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2200-FETCH-CURSOR.
      ******************************************************************
           MOVE '2200-FETCH-CURSOR        ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
                FETCH CRS_ART02
                 INTO :ARCD0200-CHIERAR5
                    , :ARCD0200-CURL5
           END-EXEC.

           MOVE WS-ARVT0200                 TO ETCL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF ETCL0002-SEM-ERROS
              EVALUATE TRUE
              WHEN ETCL0002-SQL-OK
              WHEN ETCL0002-SQL-NOTFND
                   CONTINUE
              WHEN OTHER
                   SET  ETCL0002-ABEND-DB2  TO TRUE
+5                 MOVE VIAK0001-ERRO-DB2   TO ETCL0002-NR-ERRO
                   MOVE ARCK0002-CAPLIC-AT  TO ETCL0002-CAPLIC-ERRO
              END-EVALUATE
           END-IF.

       2200-FETCH-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2300-PROC-CURSOR.
      ******************************************************************
           MOVE '2300-PROC-CURSOR        ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           ADD  1                           TO ARCL9070-INDICE.
           MOVE ARCD0200-CHIERAR5
             TO ARCL9070-CHIERAR5 (ARCL9070-INDICE).
           MOVE ARCD0200-CURL5
             TO ARCL9070-CURL5    (ARCL9070-INDICE).

           IF ETCL0002-SEM-ERROS
              PERFORM 2200-FETCH-CURSOR
                 THRU 2200-FETCH-CURSOR-EXIT
           END-IF

       2300-PROC-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       3000-FIM-PROGRAMA.
      ******************************************************************
           MOVE '3000-FIM-PROGRAMA        ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              MOVE ETCL0002-IND-ERROS       TO ARCL9070-IND-ERROS
              MOVE ZEROES                   TO ARCL9070-COD-ERRO-GRAVE
              MOVE SPACES                   TO ARCL9070-CAPLIC-ERRO
           ELSE
              MOVE ETCL0002-IND-ERROS       TO ARCL9070-IND-ERROS
              MOVE ETCL0002-NR-ERRO         TO ARCL9070-COD-ERRO-GRAVE
              MOVE ETCL0002-CAPLIC-ERRO     TO ARCL9070-CAPLIC-ERRO
           END-IF.

      *    PERFORM 3100-SERVICE-LOG
      *       THRU 3100-SERVICE-LOG-EXIT.

       3000-FIM-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       3100-SERVICE-LOG.
      ******************************************************************
           MOVE '3100-SERVICE-LOG         ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE DCLVIACD1300          REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

           MOVE WS-PROGNAME                 TO VIACD1300-CPROGRAM.
           MOVE ARCL9070-CUTILIZA           TO VIACD1300-CUSERID.
           MOVE ARCL9070-HTIMEST            TO VIACD1300-HTIMEST.
           MOVE ARCL9070-IND-ERROS          TO VIACD1300-INDERROS.
           MOVE ARCL9070-COD-ERRO-GRAVE     TO VIACD1300-NRERRO.
           MOVE ARCL9070-CAPLIC-ERRO        TO VIACD1300-CAPLIC.
           MOVE ARCL9070-ENTRADA            TO VIACD1300-GMSGIN.
           MOVE ARCL9070-SAIDA              TO VIACD1300-GMSGOUT.

           IF ARCL2305-IACTIVA-0
              EXEC SQL
                   INSERT INTO VIAVT1300_SERVICELOG
                        ( CPROGRAM
                        , CUSERID
                        , HTIMEST
                        , INDERROS
                        , NRERRO
                        , CAPLIC
                        , GMSGIN
                        , GMSGOUT )
                 VALUES ( :VIACD1300-CPROGRAM
                        , :VIACD1300-CUSERID
                        , :VIACD1300-HTIMEST
                        , :VIACD1300-INDERROS
                        , :VIACD1300-NRERRO
                        , :VIACD1300-CAPLIC
                        , :VIACD1300-GMSGIN
                        , :VIACD1300-GMSGOUT )
              END-EXEC

              MOVE WS-VIAVT1300             TO ETCL0002-TABLE-NAME
           ELSE
              EXEC SQL
                   INSERT INTO VIAVT2300_SERVICELOG
                        ( CPROGRAM
                        , CUSERID
                        , HTIMEST
                        , INDERROS
                        , NRERRO
                        , CAPLIC
                        , GMSGIN
                        , GMSGOUT )
                 VALUES ( :VIACD1300-CPROGRAM
                        , :VIACD1300-CUSERID
                        , :VIACD1300-HTIMEST
                        , :VIACD1300-INDERROS
                        , :VIACD1300-NRERRO
                        , :VIACD1300-CAPLIC
                        , :VIACD1300-GMSGIN
                        , :VIACD1300-GMSGOUT )
              END-EXEC

              MOVE WS-VIAVT2300             TO ETCL0002-TABLE-NAME
           END-IF.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF ETCL0002-SEM-ERROS
              EVALUATE TRUE
              WHEN ETCL0002-SQL-OK
                   CONTINUE
              WHEN OTHER
                   SET  ETCL0002-ABEND-DB2  TO TRUE
+5                 MOVE VIAK0001-ERRO-DB2   TO ETCL0002-NR-ERRO
                   MOVE ARCK0002-CAPLIC-AT  TO ETCL0002-CAPLIC-ERRO
              END-EVALUATE
           END-IF.

       3100-SERVICE-LOG-EXIT.
           EXIT.

      ******************************************************************
           COPY ETCP0021.
           COPY VIAP0015.
           COPY ARCP2305.
      ******************************************************************
