       IDENTIFICATION DIVISION.
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
       PROGRAM-ID. ARM90010.
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
      ******************************************************************
      *                     CONFIGURATION SECTION                      *
      ******************************************************************
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
      *                      INPUT-OUTPUT SECTION                      *
      ******************************************************************
       FILE-CONTROL.
      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       FILE SECTION.
      ******************************************************************
      *                          FILE SECTION                          *
      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                    WORKING STORAGE SECTION                     *
      ******************************************************************
      * CONSTANTES
      ******************************************************************
       01  WS-CONSTANTES.
           05 WS-PROGNAME               PIC  X(10) VALUE 'ARM90010'.
           05 WS-ARVT0104               PIC  X(10) VALUE 'ARVT0104'.
           05 WS-VIAVT1300              PIC  X(10) VALUE 'VIAVT1300'.
           05 WS-VIAVT2300              PIC  X(10) VALUE 'VIAVT2300'.
      ******************************************************************
      * VARIAVEIS
      ******************************************************************
       01  WS-VARIAVEIS.
           05 FILLER                    PIC  X(01).
           05 WS-CURRENT-TIMESTAMP      PIC  X(26) VALUE SPACES.
      ******************************************************************
      * COPYS
      ******************************************************************
           COPY ARCK0001.
           COPY ARCK0002.
           COPY ETCK0001.
           COPY ETCK0002.
           COPY ETCL0002.
           COPY VIAK0001.
           COPY VIAL0015.
           COPY ARCL2305.
      ******************************************************************
      * DB2
      ******************************************************************
           EXEC SQL INCLUDE ARCD0104  END-EXEC.
           EXEC SQL INCLUDE VIACD1300 END-EXEC.
           EXEC SQL INCLUDE VIACD2300 END-EXEC.
           EXEC SQL INCLUDE SQLCA     END-EXEC.
      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'FIM DA WORKING-STORAGE'.
      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
      *                        LINKAGE SECTION                         *
      ******************************************************************
           COPY ARCL9010.
      ******************************************************************
       PROCEDURE DIVISION USING ARCL9010-COMMAREA.
      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
       0000-MAINLINE.
      ******************************************************************
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           IF ETCL0002-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2000-PROC-PROGRAMA-EXIT
           END-IF.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.

       0000-MAINLINE-EXIT.
           GOBACK.

      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************
           MOVE '1000-INICIO-PROGRAMA     ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              MOVE  ARCL9010-COMMAREA       TO VIAL0015-CAMPOS-CHAVE
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE ETCL0002-COMMAREA     REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

DEBUG      SET  ETCL0002-DEBUG-SIM          TO TRUE.
           SET  ETCL0002-SEM-ERROS          TO TRUE.
           MOVE ZEROES                      TO ETCL0002-NR-ERRO.
           MOVE SPACES                      TO ETCL0002-CAPLIC-ERRO.

           IF ETCL0002-SEM-ERROS
              PERFORM 1100-FLIP-FLOP
                 THRU 1100-FLIP-FLOP-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              PERFORM 1200-VALIDAR-INPUT
                 THRU 1200-VALIDAR-INPUT-EXIT
           END-IF.

       1000-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       1100-FLIP-FLOP.
      ******************************************************************
           MOVE '1100-FLIP-FLOP           ' TO VIAL0015-CALLER-ID.

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE ARCL2305-COMMAREA     REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

           PERFORM CALL-ARR02305
              THRU CALL-ARR02305-EXIT.

       1100-FLIP-FLOP-EXIT.
           EXIT.

      ******************************************************************
       1200-VALIDAR-INPUT.
      ******************************************************************
           MOVE '1200-VALIDAR-INPUT       ' TO VIAL0015-CALLER-ID.

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              IF ARCL9010-GUSERNAME EQUAL SPACES
                 SET  ETCL0002-ERROS-FUNCAO TO TRUE
+1446            MOVE ARCK0001-USER-POR-PREENCHER
                                            TO ETCL0002-NR-ERRO
                 MOVE ARCK0002-CAPLIC-AR    TO ETCL0002-CAPLIC-ERRO
              END-IF
           END-IF.

           IF ETCL0002-SEM-ERROS
              IF ARCL9010-GPASSWORD EQUAL SPACES
                 SET  ETCL0002-ERROS-FUNCAO TO TRUE
+1445            MOVE ARCK0001-PASS-POR-PREENCHER
                                            TO ETCL0002-NR-ERRO
                 MOVE ARCK0002-CAPLIC-AR    TO ETCL0002-CAPLIC-ERRO
              END-IF
           END-IF.

       1200-VALIDAR-INPUT-EXIT.
           EXIT.

      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************
           MOVE '2000-PROC-PROGRAMA       ' TO VIAL0015-CALLER-ID.

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE DCLARCD0104           REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

           MOVE ARCL9010-GUSERNAME          TO ARCD0104-GUSERNAME.
           MOVE ARCL9010-GPASSWORD          TO ARCD0104-GPASSWORD.

           EXEC SQL
                SELECT GUSERNAME
                     , CNOME
                     , CFUNCAO
                     , CPERFIL
                     , CLINGUA
                     , GPASSWORD
                     , ISTATUS
                     , CEMPRESA
                     , CCENTRO
                     , CMOED
                     , MCUSTMED
                     , DDATINI
                     , DDATFIM
                     , CUSERID
                     , HTIMEST
                     , DEXP
                     , NTENTATIVAS
                     , HTIMEOK
                     , HTIMENOK
                  INTO :ARCD0104-GUSERNAME
                     , :ARCD0104-CNOME
                     , :ARCD0104-CFUNCAO
                     , :ARCD0104-CPERFIL
                     , :ARCD0104-CLINGUA
                     , :ARCD0104-GPASSWORD
                     , :ARCD0104-ISTATUS
                     , :ARCD0104-CEMPRESA
                     , :ARCD0104-CCENTRO
                     , :ARCD0104-CMOED
                     , :ARCD0104-MCUSTMED
                     , :ARCD0104-DDATINI
                     , :ARCD0104-DDATFIM
                     , :ARCD0104-CUSERID
                     , :ARCD0104-HTIMEST
                     , :ARCD0104-DEXP
                     , :ARCD0104-NTENTATIVAS
                     , :ARCD0104-HTIMEOK
                     , :ARCD0104-HTIMENOK
                  FROM ARVT0104
      **R  2017-07-13
      **R        WHERE UPPER(GUSERNAME) = UPPER(:ARCD0104-GUSERNAME)
                 WHERE GUSERNAME = :ARCD0104-GUSERNAME
      **R  2017-07-13
AF001 *
AF001 * 2019-03-13 - Nao usa a password no acesso para diferenciar
AF001 *              pasword errada para poder bloquear o utilizador
AF001 *              se exceder 2 tentativas erradas
AF001 *
AF001 *            AND GPASSWORD = :ARCD0104-GPASSWORD
AF001 * 2019-03-13
           END-EXEC.

           MOVE WS-ARVT0104                 TO ETCL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF ETCL0002-SEM-ERROS
              EVALUATE TRUE
              WHEN ETCL0002-SQL-OK
                   MOVE ARCD0104-CPERFIL    TO ARCL9010-CPERFIL
                   MOVE ARCD0104-CLINGUA    TO ARCL9010-CLINGUA
                   MOVE ARCD0104-ISTATUS    TO ARCL9010-CSTATUS
              WHEN ETCL0002-SQL-NOTFND
                   SET  ETCL0002-ERROS-FUNCAO
                                            TO TRUE
+2                 MOVE ARCK0001-GUSERNAME-N-EXISTS
                                            TO ETCL0002-NR-ERRO
                   MOVE ARCK0002-CAPLIC-AR  TO ETCL0002-CAPLIC-ERRO
              WHEN OTHER
                   SET  ETCL0002-ABEND-DB2  TO TRUE
+5                 MOVE VIAK0001-ERRO-DB2   TO ETCL0002-NR-ERRO
                   MOVE ARCK0002-CAPLIC-AT  TO ETCL0002-CAPLIC-ERRO
              END-EVALUATE
           END-IF.

      * VALIDAR SE O UTILIZADOR ESTA ATIVO
           IF ETCL0002-SEM-ERROS
              IF ARCD0104-ISTATUS EQUAL ARCK0002-ACTIVE-STATUS
              OR ARCD0104-ISTATUS EQUAL ARCK0002-PENDENT-STATUS
                 CONTINUE
              ELSE
                 SET  ETCL0002-ERROS-FUNCAO TO TRUE
+206             MOVE ARCK0001-UTILIZ-INACTIVO
                                            TO ETCL0002-NR-ERRO
                 MOVE ARCK0002-CAPLIC-AR    TO ETCL0002-CAPLIC-ERRO
              END-IF
           END-IF.

AF001      IF ETCL0002-SEM-ERROS
AF001        PERFORM 2200-VALIDA-PASSWORD
AF001           THRU 2200-VALIDA-PASSWORD-EXIT
AF001      END-IF.
      *
       2000-PROC-PROGRAMA-EXIT.
           EXIT.
AF001 ******************************************************************
AF001  2200-VALIDA-PASSWORD.
AF001 ******************************************************************
AF001      MOVE '2200-VALIDA-PASSWORD    ' TO VIAL0015-CALLER-ID.
AF001      IF ETCL0002-DEBUG-SIM
AF001         MOVE 'ARCD0104-DEXP    '  TO VIAL0015-CAMPO-NM (1)
AF001         MOVE  ARCD0104-DEXP       TO VIAL0015-CAMPO-VLR(1)
AF001         PERFORM VIAP0015-TRATA-DEBUG
AF001            THRU VIAP0015-TRATA-DEBUG-EXIT
AF001      END-IF.
AF001
AF001 * VALIDA SE PASSWORD ESTA CORRECTA
AF001      IF ARCL9010-GPASSWORD EQUAL ARCD0104-GPASSWORD
AF001 * AINDA NAO VALIDA SE PASSWORD ESTA EXPIRADA
AF001
AF001         EXEC SQL
AF001            SET :WS-CURRENT-TIMESTAMP = CURRENT_TIMESTAMP
AF001         END-EXEC
AF001
AF001         MOVE WS-CURRENT-TIMESTAMP TO ARCD0104-HTIMEOK
AF001         MOVE ZEROS                TO ARCD0104-NTENTATIVAS
AF001         PERFORM 2400-UPDATE-ART01
AF001            THRU 2400-UPDATE-ART01-EXIT
AF001      ELSE
AF001 * ACTUALIZA ARTO1: NTENTATIVAS E NOK E RETORNA ERRO
AF001         ADD 1                           TO ARCD0104-NTENTATIVAS
AF001
AF001         EXEC SQL
AF001            SET :WS-CURRENT-TIMESTAMP = CURRENT_TIMESTAMP
AF001         END-EXEC
AF001
AF001         MOVE WS-CURRENT-TIMESTAMP       TO ARCD0104-HTIMENOK
AF001         IF ARCD0104-NTENTATIVAS >= 3
AF001            MOVE ARCK0002-BLOQUEADO TO ARCD0104-ISTATUS
AF001         END-IF
AF001 *
AF001         PERFORM 2400-UPDATE-ART01
AF001            THRU 2400-UPDATE-ART01-EXIT
AF001
AF001         SET  ETCL0002-ERROS-FUNCAO TO TRUE
AF001         MOVE ARCK0002-CAPLIC-AR    TO ETCL0002-CAPLIC-ERRO
AF001 * Mantem o mesmo erro que estava a dar antes
AF001         MOVE ARCK0001-GUSERNAME-N-EXISTS
AF001                                    TO ETCL0002-NR-ERRO
AF001
AF001      END-IF.
AF001 *
AF001  2200-VALIDA-PASSWORD-EXIT.
AF001      EXIT.
AF001 ******************************************************************
AF001  2400-UPDATE-ART01.
AF001 ******************************************************************
AF001      MOVE '2400-UPDATE-ART01       ' TO VIAL0015-CALLER-ID.
AF001      IF ETCL0002-DEBUG-SIM
AF001         MOVE 'ARCD0104-HTIMENOK'  TO VIAL0015-CAMPO-NM (1)
AF001         MOVE  ARCD0104-HTIMENOK   TO VIAL0015-CAMPO-VLR(1)
AF001         MOVE 'ARCD0104-HTIMEOK '  TO VIAL0015-CAMPO-NM (2)
AF001         MOVE  ARCD0104-HTIMEOK      TO VIAL0015-CAMPO-VLR(2)
AF001         MOVE 'ARCD0104-NTENTATIVAS' TO VIAL0015-CAMPO-NM (3)
AF001         MOVE  ARCD0104-NTENTATIVAS  TO VIAL0015-CAMPO-VLR(3)
AF001         MOVE 'ARCD0104-ISTATUS '    TO VIAL0015-CAMPO-NM (4)
AF001         MOVE  ARCD0104-ISTATUS      TO VIAL0015-CAMPO-VLR(4)
AF001         MOVE 'ARCD0104-GUSERNAME '  TO VIAL0015-CAMPO-NM (5)
AF001         MOVE  ARCD0104-GUSERNAME    TO VIAL0015-CAMPO-VLR(5)
AF001         PERFORM VIAP0015-TRATA-DEBUG
AF001            THRU VIAP0015-TRATA-DEBUG-EXIT
AF001      END-IF.
AF001
AF001      EXEC SQL
AF001         UPDATE ART01_UTILIZADOR
AF001           SET HTIMEOK     = :ARCD0104-HTIMEOK
AF001             , HTIMENOK    = :ARCD0104-HTIMENOK
AF001             , NTENTATIVAS = :ARCD0104-NTENTATIVAS
AF001             , ISTATUS     = :ARCD0104-ISTATUS
AF001             , HTIMEST     =  CURRENT TIMESTAMP
AF001          WHERE GUSERNAME  = :ARCD0104-GUSERNAME
AF001      END-EXEC.
AF001
AF001      PERFORM 9020-DB2CHECK
AF001         THRU 9029-DB2CHECK-EXIT.
AF001
AF001      MOVE WS-ARVT0104                 TO ETCL0002-TABLE-NAME.
AF001
AF001      EVALUATE TRUE
AF001      WHEN ETCL0002-SQL-OK
AF001           CONTINUE
AF001      WHEN OTHER
AF001           SET ETCL0002-ABEND-DB2         TO TRUE
AF001           MOVE ARCK0002-CAPLIC-AR        TO ETCL0002-CAPLIC-ERRO
AF001           MOVE VIAK0001-ERRO-DB2         TO ETCL0002-NR-ERRO
AF001      END-EVALUATE.
AF001 *
AF001  2400-UPDATE-ART01-EXIT.
AF001      EXIT.
      ******************************************************************
       3000-FIM-PROGRAMA.
      ******************************************************************
           MOVE '3000-FIM-PROGRAMA        ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              MOVE ETCL0002-IND-ERROS       TO ARCL9010-IND-ERROS
              MOVE ZEROES                   TO ARCL9010-COD-ERRO-GRAVE
              MOVE SPACES                   TO ARCL9010-CAPLIC-ERRO
           ELSE
              MOVE ETCL0002-IND-ERROS       TO ARCL9010-IND-ERROS
              MOVE ETCL0002-NR-ERRO         TO ARCL9010-COD-ERRO-GRAVE
              MOVE ETCL0002-CAPLIC-ERRO     TO ARCL9010-CAPLIC-ERRO
           END-IF.

      *    PERFORM 3100-SERVICE-LOG
      *       THRU 3100-SERVICE-LOG-EXIT.

       3000-FIM-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       3100-SERVICE-LOG.
      ******************************************************************
           MOVE '3100-SERVICE-LOG         ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE DCLVIACD1300          REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

           MOVE WS-PROGNAME                 TO VIACD1300-CPROGRAM.
           MOVE ARCL9010-CUTILIZA           TO VIACD1300-CUSERID.
           MOVE ARCL9010-HTIMEST            TO VIACD1300-HTIMEST.
           MOVE ARCL9010-IND-ERROS          TO VIACD1300-INDERROS.
           MOVE ARCL9010-COD-ERRO-GRAVE     TO VIACD1300-NRERRO.
           MOVE ARCL9010-CAPLIC-ERRO        TO VIACD1300-CAPLIC.
           MOVE ARCL9010-ENTRADA            TO VIACD1300-GMSGIN.
           MOVE ARCL9010-SAIDA              TO VIACD1300-GMSGOUT.

           IF ARCL2305-IACTIVA-0
              EXEC SQL
                   INSERT INTO VIAVT1300_SERVICELOG
                        ( CPROGRAM
                        , CUSERID
                        , HTIMEST
                        , INDERROS
                        , NRERRO
                        , CAPLIC
                        , GMSGIN
                        , GMSGOUT )
                 VALUES ( :VIACD1300-CPROGRAM
                        , :VIACD1300-CUSERID
                        , :VIACD1300-HTIMEST
                        , :VIACD1300-INDERROS
                        , :VIACD1300-NRERRO
                        , :VIACD1300-CAPLIC
                        , :VIACD1300-GMSGIN
                        , :VIACD1300-GMSGOUT )
              END-EXEC

              MOVE WS-VIAVT1300             TO ETCL0002-TABLE-NAME
           ELSE
              EXEC SQL
                   INSERT INTO VIAVT2300_SERVICELOG
                        ( CPROGRAM
                        , CUSERID
                        , HTIMEST
                        , INDERROS
                        , NRERRO
                        , CAPLIC
                        , GMSGIN
                        , GMSGOUT )
                 VALUES ( :VIACD1300-CPROGRAM
                        , :VIACD1300-CUSERID
                        , :VIACD1300-HTIMEST
                        , :VIACD1300-INDERROS
                        , :VIACD1300-NRERRO
                        , :VIACD1300-CAPLIC
                        , :VIACD1300-GMSGIN
                        , :VIACD1300-GMSGOUT )
              END-EXEC

              MOVE WS-VIAVT2300             TO ETCL0002-TABLE-NAME
           END-IF.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF ETCL0002-SEM-ERROS
              EVALUATE TRUE
              WHEN ETCL0002-SQL-OK
                   CONTINUE
              WHEN OTHER
                   SET  ETCL0002-ABEND-DB2  TO TRUE
+5                 MOVE VIAK0001-ERRO-DB2   TO ETCL0002-NR-ERRO
                   MOVE ARCK0002-CAPLIC-AT  TO ETCL0002-CAPLIC-ERRO
              END-EVALUATE
           END-IF.

       3100-SERVICE-LOG-EXIT.
           EXIT.

      ******************************************************************
           COPY ETCP0021.
           COPY VIAP0015.
           COPY ARCP2305.
