       IDENTIFICATION DIVISION.
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
       PROGRAM-ID. ARM90200.
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
      ******************************************************************
      *                     CONFIGURATION SECTION                      *
      ******************************************************************
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
      *                      INPUT-OUTPUT SECTION                      *
      ******************************************************************
       FILE-CONTROL.
      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       FILE SECTION.
      ******************************************************************
      *                          FILE SECTION                          *
      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                    WORKING STORAGE SECTION                     *
      ******************************************************************
      * CONSTANTES
      ******************************************************************
       01  WS-CONSTANTES.
           05 WS-PROGNAME               PIC  X(10) VALUE 'ARM90200'.
           05 WS-ARM90010               PIC  X(10) VALUE 'ARM90010'.
           05 WS-ARM90020               PIC  X(10) VALUE 'ARM90020'.
           05 WS-ARM90190               PIC  X(10) VALUE 'ARM90190'.
           05 WS-VIAVT1300              PIC  X(10) VALUE 'VIAVT1300'.
           05 WS-VIAVT2300              PIC  X(10) VALUE 'VIAVT2300'.
      ******************************************************************
      * VARIAVEIS
      ******************************************************************
       01  WS-VARIAVEIS.
           05 WS-ANT-NNIVEL             PIC  9(01).
           05 WS-ANT-CHIERAR            PIC  X(10).
           05 WS-PAR-CHIERAR            PIC  X(10).
      ******************************************************************
      * COPYS
      ******************************************************************
           COPY ARCK0001.
           COPY ARCK0002.
           COPY ETCK0001.
           COPY ETCK0002.
           COPY ETCL0002.
           COPY VIAK0001.
           COPY VIAL0015.
           COPY ARCL2305.
           COPY ARCL9010.
           COPY ARCL9020.
           COPY ARCL9190.
      ******************************************************************
      * DB2
      ******************************************************************
           EXEC SQL INCLUDE VIACD1300 END-EXEC.
           EXEC SQL INCLUDE VIACD2300 END-EXEC.
           EXEC SQL INCLUDE SQLCA     END-EXEC.

      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'FIM DA WORKING-STORAGE'.
      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
      *                        LINKAGE SECTION                         *
      ******************************************************************
           COPY ARCL9200.
      ******************************************************************
       PROCEDURE DIVISION USING ARCL9200-COMMAREA.
      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
       0000-MAINLINE.
      ******************************************************************
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           IF ETCL0002-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2000-PROC-PROGRAMA-EXIT
           END-IF.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.

       0000-MAINLINE-EXIT.
           GOBACK.

      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************
           MOVE '1000-INICIO-PROGRAMA     ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE WS-VARIAVEIS
                      ETCL0002-COMMAREA     REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

DEBUG      SET  ETCL0002-DEBUG-SIM          TO TRUE.
           SET  ETCL0002-SEM-ERROS          TO TRUE.
           MOVE ZEROES                      TO ETCL0002-NR-ERRO.
           MOVE SPACES                      TO ETCL0002-CAPLIC-ERRO.

           IF ETCL0002-SEM-ERROS
              PERFORM 1100-FLIP-FLOP
                 THRU 1100-FLIP-FLOP-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              PERFORM 1200-VALIDAR-INPUT
                 THRU 1200-VALIDAR-INPUT-EXIT
           END-IF.

           PERFORM 1300-INIT-OUTPUT
              THRU 1300-INIT-OUTPUT-EXIT
                   VARYING ARCL9200-INDICE FROM 1 BY 1
                     UNTIL ARCL9200-MAX-OCCURS.

           MOVE ZEROES                      TO ARCL9200-INDICE.

       1000-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       1100-FLIP-FLOP.
      ******************************************************************
           MOVE '1100-FLIP-FLOP           ' TO VIAL0015-CALLER-ID.

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE ARCL2305-COMMAREA     REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

           PERFORM CALL-ARR02305
              THRU CALL-ARR02305-EXIT.

       1100-FLIP-FLOP-EXIT.
           EXIT.

      ******************************************************************
       1200-VALIDAR-INPUT.
      ******************************************************************
           MOVE '1200-VALIDAR-INPUT       ' TO VIAL0015-CALLER-ID.

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              IF ARCL9200-GUSERNAME EQUAL SPACES
                 SET  ETCL0002-ERROS-FUNCAO TO TRUE
+1446            MOVE ARCK0001-USER-POR-PREENCHER
                                            TO ETCL0002-NR-ERRO
                 MOVE ARCK0002-CAPLIC-AR    TO ETCL0002-CAPLIC-ERRO
              END-IF
           END-IF.

           IF ETCL0002-SEM-ERROS
              IF ARCL9200-GPASSWORD EQUAL SPACES
                 SET  ETCL0002-ERROS-FUNCAO TO TRUE
+1445            MOVE ARCK0001-PASS-POR-PREENCHER
                                            TO ETCL0002-NR-ERRO
                 MOVE ARCK0002-CAPLIC-AR    TO ETCL0002-CAPLIC-ERRO
              END-IF
           END-IF.

       1200-VALIDAR-INPUT-EXIT.
           EXIT.

      ******************************************************************
       1300-INIT-OUTPUT.
      ******************************************************************

           MOVE ZEROES
             TO ARCL9200-CSEQUENCIA(ARCL9200-INDICE).
           MOVE ZEROES
             TO ARCL9200-NNIVEL(ARCL9200-INDICE).
           MOVE SPACES
             TO ARCL9200-CHIERAR(ARCL9200-INDICE).
           MOVE SPACES
             TO ARCL9200-GDESC(ARCL9200-INDICE).
           MOVE SPACES
             TO ARCL9200-CURL(ARCL9200-INDICE).

       1300-INIT-OUTPUT-EXIT.
           EXIT.

      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************
           MOVE '2000-PROC-PROGRAMA       ' TO VIAL0015-CALLER-ID.

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              PERFORM 2100-LOGIN
                 THRU 2100-LOGIN-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              PERFORM 2200-USER
                 THRU 2200-USER-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              PERFORM 2300-HIERARQUIAS
                 THRU 2300-HIERARQUIAS-EXIT
           END-IF.

       2000-PROC-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2100-LOGIN.
      ******************************************************************
           MOVE '2100-LOGIN               ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE ARCL9010-COMMAREA     REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

           MOVE ARCL9200-CUTILIZA           TO ARCL9010-CUTILIZA.
           MOVE ARCL9200-HTIMEST            TO ARCL9010-HTIMEST.

           MOVE ETCL0002-IND-ERROS          TO ARCL9010-IND-ERROS.
           MOVE ETCL0002-NR-ERRO            TO ARCL9010-COD-ERRO-GRAVE.
           MOVE ETCL0002-CAPLIC-ERRO        TO ARCL9010-CAPLIC-ERRO.

           MOVE ARCL9200-GUSERNAME          TO ARCL9010-GUSERNAME.
           MOVE ARCL9200-GPASSWORD          TO ARCL9010-GPASSWORD.

           CALL WS-ARM90010
           USING
                ARCL9010-COMMAREA
           ON EXCEPTION
                SET  ETCL0002-ERROS-ARQ     TO TRUE
                MOVE VIAK0001-PROG-NOTFND   TO ETCL0002-NR-ERRO
                MOVE ETCL0002-IND-ERROS     TO ETCL0002-CAPLIC-ERRO
           END-CALL.

           MOVE ARCL9010-IND-ERROS          TO ETCL0002-IND-ERROS.
           MOVE ARCL9010-COD-ERRO-GRAVE     TO ETCL0002-NR-ERRO.
           MOVE ARCL9010-CAPLIC-ERRO        TO ETCL0002-CAPLIC-ERRO.

           IF ETCL0002-SEM-ERROS
              MOVE ARCL9010-CPERFIL         TO ARCL9200-CPERFIL
              MOVE ARCL9010-CLINGUA         TO ARCL9200-CLINGUA
              MOVE ARCL9010-CSTATUS         TO ARCL9200-CSTATUS
           END-IF.

       2100-LOGIN-EXIT.
           EXIT.

      ******************************************************************
       2200-USER.
      ******************************************************************
           MOVE '2200-USER                ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE ARCL9020-COMMAREA     REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

           MOVE ARCL9200-CUTILIZA           TO ARCL9020-CUTILIZA.
           MOVE ARCL9200-HTIMEST            TO ARCL9020-HTIMEST.

           MOVE ETCL0002-IND-ERROS          TO ARCL9020-IND-ERROS.
           MOVE ETCL0002-NR-ERRO            TO ARCL9020-COD-ERRO-GRAVE.
           MOVE ETCL0002-CAPLIC-ERRO        TO ARCL9020-CAPLIC-ERRO.

           MOVE ARCL9200-GUSERNAME          TO ARCL9020-GUSERNAME.

           CALL WS-ARM90020
           USING
                ARCL9020-COMMAREA
           ON EXCEPTION
                SET  ETCL0002-ERROS-ARQ     TO TRUE
                MOVE VIAK0001-PROG-NOTFND   TO ETCL0002-NR-ERRO
                MOVE ETCL0002-IND-ERROS     TO ETCL0002-CAPLIC-ERRO
           END-CALL.

           MOVE ARCL9020-IND-ERROS          TO ETCL0002-IND-ERROS.
           MOVE ARCL9020-COD-ERRO-GRAVE     TO ETCL0002-NR-ERRO.
           MOVE ARCL9020-CAPLIC-ERRO        TO ETCL0002-CAPLIC-ERRO.

       2200-USER-EXIT.
           EXIT.

      ******************************************************************
       2300-HIERARQUIAS.
      ******************************************************************
           MOVE '2300-HIERARQUIAS         ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCL9200-CUTILIZA           TO ARCL9190-CUTILIZA.
           MOVE ARCL9200-HTIMEST            TO ARCL9190-HTIMEST.
           MOVE ETCL0002-IND-ERROS          TO ARCL9190-IND-ERROS.
           MOVE ETCL0002-NR-ERRO            TO ARCL9190-COD-ERRO-GRAVE.
           MOVE ETCL0002-CAPLIC-ERRO        TO ARCL9190-CAPLIC-ERRO.
           MOVE ARCL9200-CPERFIL            TO ARCL9190-CPERFIL.
           MOVE ARCL9200-CLINGUA            TO ARCL9190-CLINGUA.
           MOVE ARCL9200-PAG-CSEQEUNCIA     TO ARCL9190-PAG-CSEQEUNCIA.
           MOVE ARCL9200-PAG-NNIVEL         TO ARCL9190-PAG-NNIVEL.
           MOVE ARCL9200-PAG-CHIERAR        TO ARCL9190-PAG-CHIERAR.

           CALL WS-ARM90190
           USING
                ARCL9190-COMMAREA
           ON EXCEPTION
                SET  ETCL0002-ERROS-ARQ     TO TRUE
                MOVE VIAK0001-PROG-NOTFND   TO ETCL0002-NR-ERRO
                MOVE ETCL0002-IND-ERROS     TO ETCL0002-CAPLIC-ERRO
           END-CALL.

           IF ETCL0002-SEM-ERROS
              MOVE ARCL9190-IND-ERROS       TO ETCL0002-IND-ERROS
              MOVE ARCL9190-COD-ERRO-GRAVE  TO ETCL0002-NR-ERRO
              MOVE ARCL9190-CAPLIC-ERRO     TO ETCL0002-CAPLIC-ERRO
              MOVE ARCL9190-INDICE          TO ARCL9200-INDICE
              MOVE ARCL9190-LISTA           TO ARCL9200-LISTA
           END-IF.

       2300-HIERARQUIAS-EXIT.
           EXIT.

      ******************************************************************
       3000-FIM-PROGRAMA.
      ******************************************************************
           MOVE '3000-FIM-PROGRAMA        ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           EVALUATE TRUE
           WHEN ETCL0002-SEM-ERROS
           WHEN ETCL0002-FIM-CONSULTA
                MOVE ETCL0002-IND-ERROS     TO ARCL9200-IND-ERROS
                MOVE ZEROES                 TO ARCL9200-COD-ERRO-GRAVE
                MOVE SPACES                 TO ARCL9200-CAPLIC-ERRO
           WHEN OTHER
                MOVE ETCL0002-IND-ERROS     TO ARCL9200-IND-ERROS
                MOVE ETCL0002-NR-ERRO       TO ARCL9200-COD-ERRO-GRAVE
                MOVE ETCL0002-CAPLIC-ERRO   TO ARCL9200-CAPLIC-ERRO
           END-EVALUATE.

           PERFORM 3100-SERVICE-LOG
              THRU 3100-SERVICE-LOG-EXIT.

       3000-FIM-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       3100-SERVICE-LOG.
      ******************************************************************
           MOVE '3100-SERVICE-LOG         ' TO VIAL0015-CALLER-ID

           IF ETCL0002-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE DCLVIACD1300          REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

           MOVE WS-PROGNAME                 TO VIACD1300-CPROGRAM.
           MOVE ARCL9200-CUTILIZA           TO VIACD1300-CUSERID.
           MOVE ARCL9200-HTIMEST            TO VIACD1300-HTIMEST.
           MOVE ARCL9200-IND-ERROS          TO VIACD1300-INDERROS.
           MOVE ARCL9200-COD-ERRO-GRAVE     TO VIACD1300-NRERRO.
           MOVE ARCL9200-CAPLIC-ERRO        TO VIACD1300-CAPLIC.
           MOVE ARCL9200-ENTRADA            TO VIACD1300-GMSGIN.
           MOVE ARCL9200-SAIDA              TO VIACD1300-GMSGOUT.

           IF ARCL2305-IACTIVA-0
              EXEC SQL
                   INSERT INTO VIAVT1300_SERVICELOG
                        ( CPROGRAM
                        , CUSERID
                        , HTIMEST
                        , INDERROS
                        , NRERRO
                        , CAPLIC
                        , GMSGIN
                        , GMSGOUT )
                 VALUES ( :VIACD1300-CPROGRAM
                        , :VIACD1300-CUSERID
                        , :VIACD1300-HTIMEST
                        , :VIACD1300-INDERROS
                        , :VIACD1300-NRERRO
                        , :VIACD1300-CAPLIC
                        , :VIACD1300-GMSGIN
                        , :VIACD1300-GMSGOUT )
              END-EXEC

              MOVE WS-VIAVT1300             TO ETCL0002-TABLE-NAME
           ELSE
              EXEC SQL
                   INSERT INTO VIAVT2300_SERVICELOG
                        ( CPROGRAM
                        , CUSERID
                        , HTIMEST
                        , INDERROS
                        , NRERRO
                        , CAPLIC
                        , GMSGIN
                        , GMSGOUT )
                 VALUES ( :VIACD1300-CPROGRAM
                        , :VIACD1300-CUSERID
                        , :VIACD1300-HTIMEST
                        , :VIACD1300-INDERROS
                        , :VIACD1300-NRERRO
                        , :VIACD1300-CAPLIC
                        , :VIACD1300-GMSGIN
                        , :VIACD1300-GMSGOUT )
              END-EXEC

              MOVE WS-VIAVT2300             TO ETCL0002-TABLE-NAME
           END-IF.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF ETCL0002-SEM-ERROS
              EVALUATE TRUE
              WHEN ETCL0002-SQL-OK
                   CONTINUE
              WHEN OTHER
                   SET  ETCL0002-ABEND-DB2   TO TRUE
+5                 MOVE VIAK0001-ERRO-DB2    TO ETCL0002-NR-ERRO
                   MOVE ARCK0002-CAPLIC-AT   TO ETCL0002-CAPLIC-ERRO
                   MOVE ETCL0002-IND-ERROS   TO ARCL9200-IND-ERROS
                   MOVE ETCL0002-NR-ERRO     TO ARCL9200-COD-ERRO-GRAVE
                   MOVE ETCL0002-CAPLIC-ERRO TO ARCL9200-CAPLIC-ERRO
              END-EVALUATE
           END-IF.

       3100-SERVICE-LOG-EXIT.
           EXIT.

      ******************************************************************
           COPY ETCP0021.
           COPY VIAP0015.
           COPY ARCP2305.
      ******************************************************************
