       IDENTIFICATION DIVISION.
       PROGRAM-ID.       ARR00542.
      ****************************************************************
      *  PROGRAMA : ARR00542
      *
      *           Parametrizar Hierarquias anteriores
      *
      ****************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *
       COPY VIAL0015.
       COPY VIAW0012.
       COPY VIATK001.
       COPY ARCK0001.
       COPY ARCK0002.

      ****************************************************************
      *                   DECLARACOES DB2                            *
      ****************************************************************
           EXEC SQL INCLUDE SQLCA    END-EXEC.
           EXEC SQL INCLUDE ARCD0200 END-EXEC.
      ****************************************************************
      ****************************************************************
      *                   VARIABLES                                  *
      ****************************************************************
       01 WS-VARIAVEIS.
           05 WS-CURL               PIC  X(14) VALUE SPACES.
           05 WS-CHIERAR1           PIC  X(10) VALUE SPACES.
           05 WS-CHIERAR2           PIC  X(10) VALUE SPACES.
           05 WS-CHIERAR3           PIC  X(10) VALUE SPACES.
           05 WS-CHIERAR4           PIC  X(10) VALUE SPACES.
           05 WS-CHIERAR5           PIC  X(10) VALUE SPACES.
           05 WS-CONTROLO           PIC S9(01) VALUE ZEROES.
           05 WS-CSEQUENCIA-M       PIC S9(12) VALUE ZEROES.
           05 WS-CURL1-M            PIC  X(14) VALUE SPACES.
           05 WS-CURL2-M            PIC  X(14) VALUE SPACES.
           05 WS-CURL3-M            PIC  X(14) VALUE SPACES.
           05 WS-CURL4-M            PIC  X(14) VALUE SPACES.
           05 WS-CURL5-M            PIC  X(14) VALUE SPACES.
           05 WS-CHIERAR1-M         PIC  X(10) VALUE SPACES.
           05 WS-CHIERAR2-M         PIC  X(10) VALUE SPACES.
           05 WS-CHIERAR3-M         PIC  X(10) VALUE SPACES.
           05 WS-CHIERAR4-M         PIC  X(10) VALUE SPACES.
           05 WS-CHIERAR5-M         PIC  X(10) VALUE SPACES.
      ****************************************************************
      *                   CONSTANTES                                 *
      ****************************************************************
       01 CONSTANTES.
           05 WS-PROGNAME           PIC  X(10) VALUE 'ARR00542'.
           05 CON-ARVT0200          PIC  X(10) VALUE 'ARVT0200'.
           05 CON-CURL              PIC  X(14) VALUE SPACES.
      ****************************************************************
       LINKAGE SECTION.
      *
       COPY ARCL0542.
       COPY ETCL0002.
      ****************************************************************
       PROCEDURE DIVISION USING ARCL0542-COMMAREA
                                ETCL0002-COMMAREA.
      ****************************************************************
      *           0000-MAINLINE                                      *
      ****************************************************************
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           IF ETCL0002-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2099-PROC-PROGRAMA-EXIT
                UNTIL WS-CONTROLO EQUAL 1
                   OR NOT ETCL0002-SEM-ERROS
           END-IF.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3099-FIM-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           GOBACK.
      ******************************************************************
      *                       1000-INICIO-PROGRAMA                     *
      ******************************************************************
       1000-INICIO-PROGRAMA.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA   '  TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           IF ETCL0002-SEM-ERROS
              PERFORM 1100-VALIDACOES
                 THRU 1100-VALIDACOES-EXIT
           END-IF.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
      *                       1100-VALIDACOES                          *
      ******************************************************************
       1100-VALIDACOES.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '1100-VALIDACOES     '  TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           EVALUATE TRUE
              WHEN ARCL0542-CHIERAR-2
                 MOVE 2                    TO WS-CONTROLO
              WHEN ARCL0542-CHIERAR-3
                 MOVE 3                    TO WS-CONTROLO
              WHEN ARCL0542-CHIERAR-4
                 MOVE 4                    TO WS-CONTROLO
              WHEN OTHER
                 MOVE 1                    TO WS-CONTROLO
           END-EVALUATE.
      *
       1100-VALIDACOES-EXIT.
           EXIT.

      ******************************************************************
      *                       2000-PROC-PROGRAMA                       *
      ******************************************************************
       2000-PROC-PROGRAMA.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA  '  TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           IF ETCL0002-SEM-ERROS
              PERFORM 2100-TRATA-INPUT
                 THRU 2100-TRATA-INPUT-EXIT
           END-IF.
      *
           IF ETCL0002-SEM-ERROS
              PERFORM 2200-OBTEM-CSEQUENCIA
                 THRU 2200-OBTEM-CSEQUENCIA-EXIT
           END-IF.
      *
           IF ETCL0002-SEM-ERROS
              PERFORM 2300-VALIDA-CSEQUENCIA
                 THRU 2300-VALIDA-CSEQUENCIA-EXIT
           END-IF.
      *
           IF ETCL0002-SEM-ERROS
           AND DB2-NOTFND
              PERFORM 2400-INSERIR-CSEQUENCIA
                 THRU 2400-INSERIR-CSEQUENCIA-EXIT
           END-IF.
      *
           SUBTRACT 1                      FROM WS-CONTROLO.
      *
       2099-PROC-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
      *                       2100-TRATA-INPUT                         *
      ******************************************************************
       2100-TRATA-INPUT.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2100-TRATA-INPUT    '  TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           EVALUATE WS-CONTROLO
              WHEN 1
                 MOVE SPACES               TO WS-CHIERAR1
                 MOVE SPACES               TO WS-CHIERAR2
                 MOVE SPACES               TO WS-CHIERAR3
                 MOVE SPACES               TO WS-CHIERAR4
                 MOVE SPACES               TO WS-CHIERAR5
              WHEN 2
                 MOVE ARCL0542-CHIERAR1    TO WS-CHIERAR1
                 MOVE SPACES               TO WS-CHIERAR2
                 MOVE SPACES               TO WS-CHIERAR3
                 MOVE SPACES               TO WS-CHIERAR4
                 MOVE SPACES               TO WS-CHIERAR5
              WHEN 3
                 MOVE ARCL0542-CHIERAR1    TO WS-CHIERAR1
                 MOVE ARCL0542-CHIERAR2    TO WS-CHIERAR2
                 MOVE SPACES               TO WS-CHIERAR3
                 MOVE SPACES               TO WS-CHIERAR4
                 MOVE SPACES               TO WS-CHIERAR5
              WHEN 4
                 MOVE ARCL0542-CHIERAR1    TO WS-CHIERAR1
                 MOVE ARCL0542-CHIERAR2    TO WS-CHIERAR2
                 MOVE ARCL0542-CHIERAR3    TO WS-CHIERAR3
                 MOVE SPACES               TO WS-CHIERAR4
                 MOVE SPACES               TO WS-CHIERAR5
           END-EVALUATE.
      *
       2100-TRATA-INPUT-EXIT.
           EXIT.

      ******************************************************************
      *                       2200-OBTEM-CSEQUENCIA                    *
      ******************************************************************
       2200-OBTEM-CSEQUENCIA.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2200-OBTEM-CSEQUENCIA' TO VIAL0015-CALLER-ID
              MOVE 'ARCL0542-CPERFMAS    ' TO VIAL0015-CAMPO-NM(1)
              MOVE  ARCL0542-CPERFMAS      TO VIAL0015-CAMPO-VLR(1)
              MOVE 'WS-CHIERAR1          ' TO VIAL0015-CAMPO-NM(2)
              MOVE  WS-CHIERAR1            TO VIAL0015-CAMPO-VLR(2)
              MOVE 'WS-CHIERAR2          ' TO VIAL0015-CAMPO-NM(3)
              MOVE  WS-CHIERAR2            TO VIAL0015-CAMPO-VLR(3)
              MOVE 'WS-CHIERAR3          ' TO VIAL0015-CAMPO-NM(4)
              MOVE  WS-CHIERAR3            TO VIAL0015-CAMPO-VLR(4)
              MOVE 'WS-CHIERAR4          ' TO VIAL0015-CAMPO-NM(5)
              MOVE  WS-CHIERAR4            TO VIAL0015-CAMPO-VLR(5)
              MOVE 'WS-CHIERAR5          ' TO VIAL0015-CAMPO-NM(6)
              MOVE  WS-CHIERAR5            TO VIAL0015-CAMPO-VLR(6)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           INITIALIZE DCLARCD0200.
      *
           MOVE CON-CURL                   TO ARCD0200-CURL1
                                              ARCD0200-CURL2
                                              ARCD0200-CURL3
                                              ARCD0200-CURL4
                                              ARCD0200-CURL5
           MOVE ARCL0542-CPERFMAS          TO ARCD0200-CPERFIL
           MOVE WS-CHIERAR1                TO ARCD0200-CHIERAR1
           MOVE WS-CHIERAR2                TO ARCD0200-CHIERAR2
           MOVE WS-CHIERAR3                TO ARCD0200-CHIERAR3
           MOVE WS-CHIERAR4                TO ARCD0200-CHIERAR4
           MOVE WS-CHIERAR5                TO ARCD0200-CHIERAR5
      *
           EXEC SQL
              SELECT CPERFIL
                   , CSEQUENCIA
                   , CHIERAR1
                   , CURL1
                   , CHIERAR2
                   , CURL2
                   , CHIERAR3
                   , CURL3
                   , CHIERAR4
                   , CURL4
                   , CHIERAR5
                   , CURL5
                INTO :ARCD0200-CPERFIL
                   , :ARCD0200-CSEQUENCIA
                   , :ARCD0200-CHIERAR1
                   , :ARCD0200-CURL1
                   , :ARCD0200-CHIERAR2
                   , :ARCD0200-CURL2
                   , :ARCD0200-CHIERAR3
                   , :ARCD0200-CURL3
                   , :ARCD0200-CHIERAR4
                   , :ARCD0200-CURL4
                   , :ARCD0200-CHIERAR5
                   , :ARCD0200-CURL5
                FROM ARVT0200_PERFIL
               WHERE CPERFIL    = :ARCD0200-CPERFIL
                 AND CHIERAR1   = :ARCD0200-CHIERAR1
                 AND CURL1      = :ARCD0200-CURL1
                 AND CHIERAR2   = :ARCD0200-CHIERAR2
                 AND CURL2      = :ARCD0200-CURL2
                 AND CHIERAR3   = :ARCD0200-CHIERAR3
                 AND CURL3      = :ARCD0200-CURL3
                 AND CHIERAR4   = :ARCD0200-CHIERAR4
                 AND CURL4      = :ARCD0200-CURL4
                 AND CHIERAR5   = :ARCD0200-CHIERAR5
                 AND CURL5      = :ARCD0200-CURL5
              FETCH FIRST ROW ONLY
           END-EXEC.
      *
           MOVE CON-ARVT0200               TO ETCL0002-TABLE-NAME
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE 'SQLCODE 2200        '  TO VIAL0015-CALLER-ID
              MOVE 'SQLCODE             '  TO VIAL0015-CAMPO-NM(1)
              MOVE  SQLCODE                TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           IF DB2-OK
              MOVE ARCD0200-CSEQUENCIA     TO WS-CSEQUENCIA-M
              MOVE ARCD0200-CHIERAR1       TO WS-CHIERAR1-M
              MOVE ARCD0200-CURL1          TO WS-CURL1-M
              MOVE ARCD0200-CHIERAR2       TO WS-CHIERAR2-M
              MOVE ARCD0200-CURL2          TO WS-CURL2-M
              MOVE ARCD0200-CHIERAR3       TO WS-CHIERAR3-M
              MOVE ARCD0200-CURL3          TO WS-CURL3-M
              MOVE ARCD0200-CHIERAR4       TO WS-CHIERAR4-M
              MOVE ARCD0200-CURL4          TO WS-CURL4-M
              MOVE ARCD0200-CHIERAR5       TO WS-CHIERAR5-M
              MOVE ARCD0200-CURL5          TO WS-CURL5-M
           ELSE
              SET  ETCL0002-ERROS-FUNCAO
                                           TO TRUE
              MOVE ARCK0001-CSEQUENCIA-N-EXISTS
                                           TO ETCL0002-NR-ERRO
              MOVE ARCK0002-CAPLIC-AR      TO ETCL0002-CAPLIC-ERRO
           END-IF.
      *
       2200-OBTEM-CSEQUENCIA-EXIT.
           EXIT.

      ******************************************************************
      *                       2300-VALIDA-CSEQUENCIA                   *
      ******************************************************************
       2300-VALIDA-CSEQUENCIA.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2300-VALIDA-CSEQUENCIA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           INITIALIZE DCLARCD0200.
      *
           MOVE ARCL0542-CPERFIL           TO ARCD0200-CPERFIL.
           MOVE WS-CSEQUENCIA-M            TO ARCD0200-CSEQUENCIA.
      *
           EXEC SQL
              SELECT CPERFIL
                   , CSEQUENCIA
                   , CHIERAR1
                   , CURL1
                   , CHIERAR2
                   , CURL2
                   , CHIERAR3
                   , CURL3
                   , CHIERAR4
                   , CURL4
                   , CHIERAR5
                   , CURL5
                INTO :ARCD0200-CPERFIL
                   , :ARCD0200-CSEQUENCIA
                   , :ARCD0200-CHIERAR1
                   , :ARCD0200-CURL1
                   , :ARCD0200-CHIERAR2
                   , :ARCD0200-CURL2
                   , :ARCD0200-CHIERAR3
                   , :ARCD0200-CURL3
                   , :ARCD0200-CHIERAR4
                   , :ARCD0200-CURL4
                   , :ARCD0200-CHIERAR5
                   , :ARCD0200-CURL5
                FROM ARVT0200_PERFIL
               WHERE CPERFIL    = :ARCD0200-CPERFIL
                 AND CSEQUENCIA = :ARCD0200-CSEQUENCIA
           END-EXEC.
      *
           MOVE CON-ARVT0200               TO ETCL0002-TABLE-NAME
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE 'SQLCODE 2300        '  TO VIAL0015-CALLER-ID
              MOVE 'SQLCODE             '  TO VIAL0015-CAMPO-NM(1)
              MOVE  SQLCODE                TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           EVALUATE TRUE
              WHEN DB2-OK
              WHEN DB2-NOTFND
                 CONTINUE
              WHEN OTHER
                 SET  ETCL0002-ERROS-FUNCAO
                                           TO TRUE
                 MOVE ARCK0001-CSEQUENCIA-N-EXISTS
                                           TO ETCL0002-NR-ERRO
                 MOVE ARCK0002-CAPLIC-AR   TO ETCL0002-CAPLIC-ERRO
           END-EVALUATE.
      *
       2300-VALIDA-CSEQUENCIA-EXIT.
           EXIT.

      ******************************************************************
      *                       2400-INSERIR-CSEQUENCIA                  *
      ******************************************************************
       2400-INSERIR-CSEQUENCIA.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2400-INSERIR-CSEQUENCIA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           INITIALIZE DCLARCD0200.
      *
           MOVE ARCL0542-CPERFIL           TO ARCD0200-CPERFIL.
           MOVE WS-CSEQUENCIA-M            TO ARCD0200-CSEQUENCIA.
           MOVE WS-CHIERAR1-M              TO ARCD0200-CHIERAR1.
           MOVE WS-CURL1-M                 TO ARCD0200-CURL1.
           MOVE WS-CHIERAR2-M              TO ARCD0200-CHIERAR2.
           MOVE WS-CURL2-M                 TO ARCD0200-CURL2.
           MOVE WS-CHIERAR3-M              TO ARCD0200-CHIERAR3.
           MOVE WS-CURL3-M                 TO ARCD0200-CURL3.
           MOVE WS-CHIERAR4-M              TO ARCD0200-CHIERAR4.
           MOVE WS-CURL4-M                 TO ARCD0200-CURL4.
           MOVE WS-CHIERAR5-M              TO ARCD0200-CHIERAR5.
           MOVE WS-CURL5-M                 TO ARCD0200-CURL5.
           MOVE WS-PROGNAME                TO ARCD0200-CUSERID.
      *
           EXEC SQL
              INSERT INTO ARVT0200_PERFIL
                 VALUES( :ARCD0200-CPERFIL
                       , :ARCD0200-CSEQUENCIA
                       , :ARCD0200-CHIERAR1
                       , :ARCD0200-CURL1
                       , :ARCD0200-CHIERAR2
                       , :ARCD0200-CURL2
                       , :ARCD0200-CHIERAR3
                       , :ARCD0200-CURL3
                       , :ARCD0200-CHIERAR4
                       , :ARCD0200-CURL4
                       , :ARCD0200-CHIERAR5
                       , :ARCD0200-CURL5
                       , :ARCD0200-CUSERID
                       , CURRENT_TIMESTAMP)
           END-EXEC.
      *
           MOVE CON-ARVT0200               TO ETCL0002-TABLE-NAME
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE 'SQLCODE 2400        '  TO VIAL0015-CALLER-ID
              MOVE 'SQLCODE             '  TO VIAL0015-CAMPO-NM(1)
              MOVE  SQLCODE                TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           IF NOT DB2-OK
              SET  ETCL0002-ABEND-DB2
                                           TO TRUE
              MOVE ARCK0001-CSEQUENCIA-N-EXISTS
                                           TO ETCL0002-NR-ERRO
              MOVE ARCK0002-CAPLIC-AR      TO ETCL0002-CAPLIC-ERRO
           END-IF.
      *
       2400-INSERIR-CSEQUENCIA-EXIT.
           EXIT.

      ******************************************************************
      *                       3000-FIM-PROGRAMA                        *
      ******************************************************************
       3000-FIM-PROGRAMA.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '3000-FIM-PROGRAMA   '  TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
       3099-FIM-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       COPY VIAP0015.
       COPY VIAP0012.

