       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARR00500.
      ******************************************************************
      *                                                                *
      *                      VIA CONSULTING                            *
      *                                                                *
      *    PROGRAMA   : ARR00500.                                      *
      *    DESCRICAO  : VALIDA PASSWORD                                *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      *          *        *        *                                   *
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
      *
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *
       DATA DIVISION.
      ******************************************************************
      *              D A T A   D I V I S I O N                         *
      ******************************************************************
      *                  WORKING STORAGE SECTION                       *
      ******************************************************************
       WORKING-STORAGE SECTION.
      *
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE ARR00500         '.
      ******************************************************************
      *            DECLARACOES DE DB2
      ******************************************************************
           EXEC SQL INCLUDE ARCD6901 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      ******************************************************************
      *                  CONSTANTES                                    *
      ******************************************************************
       01 CONSTANTES.
          05 WS-PROGNAME                   PIC  X(10) VALUE 'ARR00500'.
          05 CON-ARVT6901                  PIC  X(10) VALUE 'ARVT6901'.
          05 CON-CAPLIC-AR                 PIC  X(02) VALUE 'AR'.
          05 CON-PARAM-PASSWORD            PIC  X(06) VALUE 'NEWPIN'.

      ******************************************************************
      *                  FLAGS E SWITCHES                              *
      ******************************************************************
       01 SW-DEBUG                         PIC  X(01) VALUE 'N'.
          88 SW-DEBUG-SIM                             VALUE 'S'.

       01 ABEND-CALLER-ID                  PIC  X(60).
      ******************************************************************
      *                         VARIAVEIS                              *
      ******************************************************************
       01  WS-VARIAVEIS.
           05 WS-INDICE                    PIC 9(02).
           05 WS-TOTAL-REP                 PIC 9(02).

      ******************************************************************
      *              DECLARACOES DE COPYBOOKS                          *
      ******************************************************************
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY ARCL2205.
       COPY AACK0001.
       COPY ARCK0001.
       COPY ARCK0002.
       COPY AACK0002.
       COPY VIAL1020.
      ******************************************************************
      *              DECLARACOES DE CURSORES DB2                       *
      ******************************************************************

       01  WS-CURSOR-VARS.
           05 FILLER                       PIC X(01) VALUE SPACES.
           EXEC SQL
               DECLARE CURART69 CURSOR FOR
                SELECT GUSERNAME
                     , DATA
                     , HORA
                     , GPASSWORD
                     , CUSERID
                     , HTIMEST
                  FROM ARVT6901
                 WHERE UPPER(GUSERNAME)  = UPPER(:ARCD6901-GUSERNAME)
                 ORDER BY DATA DESC
                        , HORA DESC
           END-EXEC.
      ******************************************************************
       01  FILLER                          PIC X(40) VALUE
           'FIM DA WORKING-STORAGE ARR00500         '.
      ******************************************************************
      *                    LINKAGE SECTION                             *
      ******************************************************************
       LINKAGE SECTION.
       COPY ETCL0002.
       COPY ARCL0050.
      ******************************************************************
      *                  PROCEDURE DIVISION                            *
      ******************************************************************
       PROCEDURE DIVISION USING ETCL0002-COMMAREA ARCL0050-COMMAREA.
      ******************************************************************
      *    PROCESSO                                                    *
      ******************************************************************
       0000-MAINLINE.
      *
           MOVE '0000-MAINLINE'            TO ABEND-CALLER-ID.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.
      *
           IF ETCL0002-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2099-PROC-PROGRAMA-EXIT
           END-IF.
      *
           PERFORM 3000-FIM-PROGRAMA
              THRU 3099-FIM-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           GOBACK.
      ******************************************************************
      *                  1000-INICIO-PROGRAMA                          *
      ******************************************************************
       1000-INICIO-PROGRAMA.
      *
           SET ETCL0002-SEM-ERROS          TO TRUE.
           SET ARCL0050-STATUS-OK          TO TRUE.
      *
           PERFORM 1100-VALIDA-INPUT
              THRU 1100-VALIDA-INPUT-EXIT.
      *
           IF ETCL0002-SEM-ERROS
              PERFORM 1200-OBTEM-CPARAM
                 THRU 1200-OBTEM-CPARAM-EXIT
           END-IF.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
      *                  1100-VALIDA-INPUT                             *
      ******************************************************************
       1100-VALIDA-INPUT.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '1100-VALIDA-INPUT   '  TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           IF ETCL0002-SEM-ERROS
           AND ARCL0050-GPASSWORD EQUAL SPACES
              SET  ETCL0002-ERROS-FUNCAO   TO TRUE
              MOVE ARCK0001-GPASSWORD-INVALID
                                           TO ETCL0002-NR-ERRO
              MOVE AACK0002-CAPLIC         TO ETCL0002-CAPLIC-ERRO
           END-IF.

      *
           IF ETCL0002-SEM-ERROS
           AND ARCL0050-GUSERNAME EQUAL SPACES
              SET  ETCL0002-ERROS-FUNCAO   TO TRUE
              MOVE ARCK0001-GUSERNAME-INVALID
                                           TO ETCL0002-NR-ERRO
              MOVE AACK0002-CAPLIC         TO ETCL0002-CAPLIC-ERRO
           END-IF.
      *
       1100-VALIDA-INPUT-EXIT.
           EXIT.
      ******************************************************************
      *                  1200-OBTEM-CPARAM                        *
      ******************************************************************
       1200-OBTEM-CPARAM.
           IF ETCL0002-DEBUG-SIM
              MOVE '1200-OBTEM-CPARAM' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE ARCL2205-DATA.

           MOVE CON-CAPLIC-AR              TO ARCL2205-CAPLIC
           MOVE CON-PARAM-PASSWORD         TO ARCL2205-CPARAM

           PERFORM CALL-ARM2206
              THRU CALL-ARM2206-EXIT.

           IF ETCL0002-SEM-ERROS
              COMPUTE WS-TOTAL-REP
                                  = FUNCTION NUMVAL(ARCL2205-GVALOR1)
           ELSE
              SET ETCL0002-SEM-ERROS       TO TRUE
              MOVE 3                       TO WS-TOTAL-REP
           END-IF.

       1200-OBTEM-CPARAM-EXIT.
           EXIT.

      ******************************************************************
      *                  2000-PROC-PROGRAMA                            *
      ******************************************************************
       2000-PROC-PROGRAMA.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA    ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           IF ETCL0002-SEM-ERROS
              PERFORM 2020-OPEN
                 THRU 2029-OPEN-EXIT
           END-IF.
      *
           IF ETCL0002-SEM-ERROS
              PERFORM 2030-FETCH
                 THRU 2039-FETCH-EXIT
      *
              IF ETCL0002-SEM-ERROS
                 IF DB2-OK
                    PERFORM 2040-CONTINUA
                       THRU 2049-CONTINUA-EXIT
                 ELSE
                    IF DB2-NOTFND
                       SET ARCL0050-STATUS-OK
                                           TO TRUE
                    ELSE
                       SET  ETCL0002-ERROS-FUNCAO
                                           TO TRUE
                       MOVE AACK0001-ERRO-CPARAM
                                           TO ETCL0002-NR-ERRO
                       MOVE AACK0002-CAPLIC
                                           TO ETCL0002-CAPLIC-ERRO
                    END-IF
                 END-IF
              END-IF

              PERFORM 2070-CLOSE
                 THRU 2079-CLOSE-EXIT
           END-IF.
      *
           IF ETCL0002-SEM-ERROS
           AND ARCL0050-STATUS-OK
              PERFORM 2100-REGISTA-PASSWORD
                 THRU 2100-REGISTA-PASSWORD-EXIT
           END-IF.
      *
       2099-PROC-PROGRAMA-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                     2020-OPEN
      *--------------------------------------------------------------
       2020-OPEN.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2020-OPEN'             TO VIAL0015-CALLER-ID
              MOVE 'ARCL0050-GUSERNAME'    TO VIAL0015-CAMPO-NM(1)
              MOVE  ARCL0050-GUSERNAME     TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           INITIALIZE DCLARCD6901.

           MOVE ARCL0050-GUSERNAME          TO ARCD6901-GUSERNAME
      *
           EXEC SQL
               OPEN CURART69
           END-EXEC
      *
           MOVE CON-ARVT6901               TO ETCL0002-TABLE-NAME.
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF ETCL0002-DEBUG-SIM
              MOVE '2200     '             TO VIAL0015-CALLER-ID
              MOVE 'SQLCODE  '             TO VIAL0015-CAMPO-NM(1)
              MOVE  SQLCODE                TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
       2029-OPEN-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2030-FETCH
      *--------------------------------------------------------------
       2030-FETCH.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2030-FETCH'            TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           EXEC SQL
              FETCH CURART69
               INTO :ARCD6901-GUSERNAME
                  , :ARCD6901-DATA
                  , :ARCD6901-HORA
                  , :ARCD6901-GPASSWORD
                  , :ARCD6901-CUSERID
                  , :ARCD6901-HTIMEST
           END-EXEC
      *
           MOVE CON-ARVT6901               TO ETCL0002-TABLE-NAME.
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2030     '             TO VIAL0015-CALLER-ID
              MOVE 'SQLCODE  '             TO VIAL0015-CAMPO-NM(1)
              MOVE  SQLCODE                TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

       2039-FETCH-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                       2040-CONTINUA
      *--------------------------------------------------------------
       2040-CONTINUA.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2040-CONTINUA'         TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE ZEROES                     TO WS-INDICE.

           PERFORM 2050-TRATA-OCCURS
              THRU 2059-TRATA-OCCURS-EXIT
             UNTIL DB2-NOTFND
                OR WS-INDICE EQUAL WS-TOTAL-REP
                OR ARCL0050-STATUS-NOK
                OR NOT ETCL0002-SEM-ERROS.
      *
       2049-CONTINUA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2050-TRATA-OCCURS
      *--------------------------------------------------------------
       2050-TRATA-OCCURS.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2050-TRATA-OCCURS'     TO VIAL0015-CALLER-ID
              MOVE 'ARCD6901-GPASSWORD '   TO VIAL0015-CAMPO-NM(1)
              MOVE  ARCD6901-GPASSWORD     TO VIAL0015-CAMPO-VLR(1)
              MOVE 'ARCL0050-GPASSWORD '   TO VIAL0015-CAMPO-NM(2)
              MOVE  ARCL0050-GPASSWORD     TO VIAL0015-CAMPO-VLR(2)
              MOVE 'WS-INDICE          '   TO VIAL0015-CAMPO-NM(3)
              MOVE  WS-INDICE              TO VIAL0015-CAMPO-VLR(3)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           ADD 1                           TO WS-INDICE.

           IF ARCD6901-GPASSWORD EQUAL ARCL0050-GPASSWORD
              SET ARCL0050-STATUS-NOK      TO TRUE
              SET  ETCL0002-ERROS-FUNCAO   TO TRUE
              MOVE ARCK0001-GPASSWORD-INVALID
                                           TO ETCL0002-NR-ERRO
              MOVE ARCK0002-CAPLIC         TO ETCL0002-CAPLIC-ERRO
           END-IF.

           IF ETCL0002-SEM-ERROS
              PERFORM 2030-FETCH
                 THRU 2039-FETCH-EXIT
           END-IF.

       2059-TRATA-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2070-CLOSE
      *--------------------------------------------------------------
       2070-CLOSE.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2070-CLOSE'            TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           EXEC SQL
               CLOSE CURART69
           END-EXEC.
      *
       2079-CLOSE-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-REGISTA-PASSWORD
      *--------------------------------------------------------------
       2100-REGISTA-PASSWORD.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '2100-REGISTA-PASSWORD' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ARCL0050-GUSERNAME         TO ARCD6901-GUSERNAME
           MOVE ARCL0050-DATA              TO ARCD6901-DATA
           MOVE ARCL0050-HORA              TO ARCD6901-HORA
           MOVE ARCL0050-GPASSWORD         TO ARCD6901-GPASSWORD
           MOVE ARCL0050-CUSERID           TO ARCD6901-CUSERID


           EXEC SQL
              INSERT INTO ARVT6901
                    ( GUSERNAME
                    , DATA
                    , HORA
                    , GPASSWORD
                    , CUSERID
                    , HTIMEST
                    )
                 VALUES
                    ( :ARCD6901-GUSERNAME
                    , :ARCD6901-DATA
                    , :ARCD6901-HORA
                    , :ARCD6901-GPASSWORD
                    , :ARCD6901-CUSERID
                    , CURRENT TIMESTAMP
                    )
           END-EXEC

           MOVE CON-ARVT6901               TO ETCL0002-TABLE-NAME

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF ETCL0002-DEBUG-SIM
              MOVE 'SQLCODE        '       TO VIAL0015-CALLER-ID
              MOVE 'SQLCODE        '       TO VIAL0015-CAMPO-NM(1)
              MOVE  SQLCODE                TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF

           IF NOT DB2-OK
              SET  ETCL0002-ABEND-DB2      TO TRUE
              MOVE ARCK0001-GPASSWORD-INVALID
                                           TO ETCL0002-NR-ERRO
              MOVE ARCK0002-CAPLIC         TO ETCL0002-CAPLIC-ERRO
           END-IF.


       2100-REGISTA-PASSWORD-EXIT.
           EXIT.
      ******************************************************************
      *               3000-FIM-PROGRAMA                                *
      ******************************************************************
       3000-FIM-PROGRAMA.
      *
           IF ETCL0002-DEBUG-SIM
              MOVE '3000-FIM-PROGRAMA    ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
      *
       3099-FIM-PROGRAMA-EXIT.
            EXIT.
      ******************************************************************
           EXEC SQL INCLUDE VIAP0099 END-EXEC.
      ******************************************************************
       COPY VIAP0015.
       COPY ARCR2206.
