       PROCESS OPTIONS, NOMONOPRC
       IDENTIFICATION DIVISION.
      ******************************************************************
      * COMANDOS PARA COMPILAÇÃO
      ******************************************************************
      *
      * CRTCBLMOD MODULE(K_ERM_OBJ/ARW0001M) SRCFILE(K_ERM_PX/QCBLSRC)
      * SRCMBR(*MODULE) DBGVIEW(*SOURCE)
      *
      * CRTPGM PGM(K_ERM_OBJ/ARW0001P) MODULE(K_ERM_OBJ/ARW0001M)
      * BNDSRVPGM((QSYSDIR/QAXIS10CC *IMMED) (K_ERM_OBJ/ARW0001S *IMMED))
      * TGTRLS(*CURRENT)
      *
      * QSH
      * /QIBM/ProdData/OS/WebServices/V1/client/bin/wsdl2ws.sh
      *  http://10.0.1.10:8999/WS-VIA/services/Main?wsdl
      *  -o/WS_VIA -lc -s/QSYS.LIB/DEV_APP.LIB/ARW0001S.SRVPGM
      *
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
      * PROGRAM NAME
      ******************************************************************
       PROGRAM-ID. ARW0001M.
      ******************************************************************
      *                                                                *
      *                       - ARQUITECTURA -                         *
      *                                                                *
      ******************************************************************
      * Invocação webservices                                          *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      *          *        *        *                                   *
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
      ******************************************************************
      *                     CONFIGURATION SECTION                      *
      ******************************************************************
       SOURCE-COMPUTER. IBM-ISERIES.
       OBJECT-COMPUTER. IBM-ISERIES.
       SPECIAL-NAMES.
                        LINKAGE PROCEDURE FOR 'get_MainSoap_stub'
                                    USING ALL DESCRIBED
                        LINKAGE PROCEDURE FOR 'Execute'
                                    USING ALL DESCRIBED
                        LINKAGE PROCEDURE FOR 'destroy_MainSoap_stub'
                                    USING ALL DESCRIBED.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                    WORKING STORAGE SECTION                     *
      ******************************************************************
       01  WS-INPUT-MESSAGE              PIC  X(32000)  VALUE SPACES.
       01  WS-OUTPUT-MESSAGE             PIC  X(32000)  VALUE SPACES.
       01  WS-LOG                        PIC  X(32000)  VALUE SPACES.
       01  WS-N1                         PIC  9(00009)  VALUE ZEROES.
       01  WS-ENDPOINT                   PIC  X(00100).
       01  WS-STUB                                      USAGE POINTER.
       01  WS-LOG-MESSAGE-PTR                           USAGE POINTER.
       01  WS-OUTPUT-MESSAGE-PTR                        USAGE POINTER.

       01  WS-ERROR-TIMEOUT              PIC  X(00070)  VALUE
            'Erro na invocação do WebService (Timeout)'.

      ******************************************************************
      *    COPYS                                                       *
      ******************************************************************
           COPY ARCL2205.
           COPY VIAL0002.
           COPY VIAK0001.
           COPY ARCK0001.
           COPY ARCK0002.
           COPY VIAL0015.
      ******************************************************************
      *    CONSTANTES                                                  *
      ******************************************************************
       01  WS-PROGNAME                   PIC  X(10) VALUE 'ARW0001M'.
      ******************************************************************
      *    SWITCHES                                                    *
      ******************************************************************
       01  SW-DEBUG                      PIC  X(01) VALUE SPACES.
           88 SW-DEBUG-SIM                          VALUE 'S'.
           88 SW-DEBUG-NAO                          VALUE 'N'.
      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
      *                        LINKAGE SECTION                         *
      ******************************************************************
           COPY VIAL0001.
           COPY ETCL0002.

      ******************************************************************
       PROCEDURE DIVISION USING VIAL0001-COMMAREA
                                ETCL0002-COMMAREA.
      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
       0000-MAINLINE.
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2000-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.

       0000-MAINLINE-EXIT.
           GOBACK.

      ******************************************************************
      *                           Validação                            *
      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************
      *
           MOVE 'OK'                        TO VIAL0001-IND-ERROS.
           SET SW-DEBUG-SIM                 TO TRUE.
      *
           IF SW-DEBUG-SIM
              MOVE 'INICIO ARW0001M     '     TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
       1000-INICIO-PROGRAMA-EXIT.
           EXIT.
      ******************************************************************
      *                    Processamento Principal                     *
      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************
           MOVE VIAL0001-COMMAREA       TO WS-INPUT-MESSAGE.
           MOVE SPACES                  TO WS-LOG.
           SET  WS-LOG-MESSAGE-PTR      TO ADDRESS OF WS-LOG.
           SET  WS-OUTPUT-MESSAGE-PTR   TO ADDRESS OF WS-OUTPUT-MESSAGE.

ES    * Tenta obter o endpoit do WS-VIA com a aplicação do VIAL0001
           IF VIAL0001-PGMID EQUAL SPACES
SM            MOVE ARCK0002-ARWSVIA        TO ARCL2205-CPARAM
           ELSE
SM            MOVE VIAL0001-PGMID          TO ARCL2205-CPARAM
           END-IF
ES         MOVE VIAL0001-CAPLIC         TO ARCL2205-CAPLIC.
ES
ES         PERFORM CALL-ARM2206
ES            THRU CALL-ARM2206-EXIT
ES
ES         IF ETCL0002-SEM-ERROS
ES            STRING ARCL2205-GVALOR1
ES                   ARCL2205-GVALOR2
ES                   ARCL2205-GVALOR3
ES                   DELIMITED BY SIZE INTO WS-ENDPOINT
ES         ELSE
ES    * Se não encontrar endpoint com a APLIC do VIAL0001, executa com
ES    * CAPLIC = AR, como fazia antigamente
              SET  ETCL0002-SEM-ERROS      TO TRUE
              MOVE ZEROES                  TO ETCL0002-NR-ERRO
              MOVE ARCK0002-ARWSVIA        TO ARCL2205-CPARAM
              MOVE ARCK0002-CAPLIC-AR      TO ARCL2205-CAPLIC

              PERFORM CALL-ARM2206
                 THRU CALL-ARM2206-EXIT

              IF ETCL0002-SEM-ERROS
                 STRING ARCL2205-GVALOR1
                        ARCL2205-GVALOR2
                        ARCL2205-GVALOR3
                        DELIMITED BY SIZE INTO WS-ENDPOINT
              ELSE
                 MOVE SPACES               TO WS-ENDPOINT
                 SET  ETCL0002-ERROS-ARQ       TO TRUE
                 MOVE ETCL0002-IND-ERROS       TO VIAL0001-IND-ERROS
                 MOVE ARCK0001-ARWSVIA-NOK     TO ETCL0002-ST-ERRO
                                                  VIAL0001-NR-ERRO
              END-IF
           END-IF.

           IF SW-DEBUG-SIM
              MOVE 'ANTES DE CHAMAR'          TO VIAL0015-CALLER-ID
              MOVE 'WS-ENDPOINT     '         TO VIAL0015-CAMPO-NM(1)
              MOVE  WS-ENDPOINT               TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           CALL PROCEDURE 'get_MainSoap_stub'
                USING BY VALUE  ADDRESS OF WS-ENDPOINT
                RETURNING INTO             WS-STUB
           END-CALL.

           CALL PROCEDURE 'Execute'
                USING BY VALUE             WS-STUB
                                ADDRESS OF WS-INPUT-MESSAGE
                                ADDRESS OF WS-LOG
                                ADDRESS OF WS-OUTPUT-MESSAGE
                                ADDRESS OF WS-LOG-MESSAGE-PTR
                                ADDRESS OF WS-OUTPUT-MESSAGE-PTR
           END-CALL.

      * Set result variable to the result pointer
           MOVE WS-OUTPUT-MESSAGE           TO VIAL0001-COMMAREA.
           MOVE VIAL0001-IND-ERROS          TO ETCL0002-IND-ERROS.

      * Evaluate and treats error code
           IF ETCL0002-IND-ERROS EQUAL SPACES
              SET  ETCL0002-ERROS-ARQ      TO TRUE
              MOVE WS-INPUT-MESSAGE        TO VIAL0001-COMMAREA
              MOVE VIAK0001-SERV-INACTIVOS
                                           TO ETCL0002-ST-ERRO
              MOVE VIAK0001-WSTIMEOUT      TO ETCL0002-NR-ERRO
              MOVE ARCK0002-CAPLIC-AT      TO ETCL0002-CAPLIC-ERRO
              MOVE WS-ERROR-TIMEOUT        TO VIAL0001-MENSAGEM-OUTPUT
           ELSE
              IF NOT ETCL0002-SEM-ERROS
                 IF VIAL0001-NR-ERRO IS NUMERIC AND
                    VIAL0001-NR-ERRO NOT EQUAL ZEROES
                    MOVE VIAL0001-NR-ERRO  TO ETCL0002-NR-ERRO
                                              ETCL0002-ST-ERRO
                    MOVE ARCK0002-CAPLIC-AT
                                           TO ETCL0002-CAPLIC-ERRO
                 END-IF
              END-IF
           END-IF.

      * Clean up storage for the Web service stub.
           CALL PROCEDURE 'destroy_MainSoap_stub'
                USING BY VALUE             WS-STUB
           END-CALL.

       2000-PROC-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
      *                             Final                              *
      ******************************************************************
       3000-FIM-PROGRAMA.
      ******************************************************************
      *
           CONTINUE.

       3000-FIM-PROGRAMA-EXIT.
            EXIT.
      ******************************************************************
           COPY ARCR2206.
           COPY VIAP0015.
      ******************************************************************
      *                       Via Consulting Way                       *
      ******************************************************************
