       IDENTIFICATION DIVISION.
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
       PROGRAM-ID. COB04450.
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
      ******************************************************************
      *                     CONFIGURATION SECTION                      *
      ******************************************************************
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
      *                      INPUT-OUTPUT SECTION                      *
      ******************************************************************
       FILE-CONTROL.
           SELECT   COF01300-FILE
                    ASSIGN              TO DISK-COF01300
                    ORGANIZATION        IS SEQUENTIAL
                    FILE STATUS         IS VIAW0011-FSTATUS.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       FILE SECTION.
      ******************************************************************
      *                          FILE SECTION                          *
      ******************************************************************
       FD  COF01300-FILE.
           COPY COCF1300.

      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                    WORKING STORAGE SECTION                     *
      ******************************************************************
      * CONSTANTES
      ******************************************************************
       01  WS-CONSTANTES.
           05 CON-90                    PIC  9(02) VALUE 90.
           05 CON-ACTIVO                PIC  X(01) VALUE 'A'.
           05 CON-APROVADO              PIC  X(01) VALUE 'A'.
           05 CON-PENDENTE              PIC  X(01) VALUE 'N'.
           05 CON-SEP                   PIC  X(03) VALUE ' - '.
           05 CON-TOLERANCIA            PIC  X(01) VALUE 'T'.
           05 WS-PROGNAME               PIC  X(10) VALUE 'COB04450'.
           05 WS-COCF1300               PIC  X(10) VALUE 'COF01300'.
           05 WS-COVT5304               PIC  X(10) VALUE 'COVT5304'.
           05 WS-COVT6500               PIC  X(10) VALUE 'COVT6500'.
           05 WS-COVT7001               PIC  X(10) VALUE 'COVT7001'.
           05 WS-ARVT7001               PIC  X(10) VALUE 'ARVT7001'.
           05 WS-COVT5101               PIC  X(10) VALUE 'COVT5101'.
           05 WS-COVT3401               PIC  X(10) VALUE 'COVT3401'.
           05 WS-PESSOAS01              PIC  X(10) VALUE 'PESSOAS01'.

      ******************************************************************
      * VARIAVEIS
      ******************************************************************
       01  WS-VARIAVEIS.
           05 WS-CIDEMP                PIC X(08)  VALUE SPACES.
           05 FILLER REDEFINES WS-CIDEMP.
              10 WS-CIDEMP-01          PIC X(05).
              10 WS-CIDEMP-02          PIC X(03).

           05 WS-DATA-HOJE             PIC X(10)  VALUE SPACES.
           05 FILLER REDEFINES WS-DATA-HOJE.
             10 FILLER                 PIC X(08) VALUE SPACES.
             10 WS-HOJE-DD             PIC X(02) VALUE SPACES.

           05 WS-GATILHO               PIC X(05)   VALUE SPACES.

           05 WS-DADOS                 PIC X(510)  VALUE SPACES.
           05 FILLER REDEFINES WS-DADOS.
              10 WS-DADOS-01          PIC X(10).
              10 WS-DADOS-02          PIC X(500).
           05 WS-FERIAS               PIC  X(08) VALUE SPACES.
           05 WS-FERIAS-PREM          PIC  X(08) VALUE SPACES.

      ******************************************************************
      * COPYS
      ******************************************************************
           COPY VIAL1000.
           COPY VIATW300.
           COPY AQCL0001.
           COPY AQCW0109.
           COPY VIAL0015.
           COPY VIAW0011.
           COPY VIAW0012.
           COPY VIATK001.
           COPY VIATK002.
           COPY COCK0001.
           COPY COCK0002.
           COPY COCL0030.
      ******************************************************************
      * DB2
      ******************************************************************
           EXEC SQL INCLUDE SQLCA       END-EXEC.
           EXEC SQL INCLUDE COCD5305    END-EXEC.
           EXEC SQL INCLUDE COCD6500    END-EXEC.
           EXEC SQL INCLUDE COCD7001    END-EXEC.
           EXEC SQL INCLUDE ARCD7001    END-EXEC.
           EXEC SQL INCLUDE COCD5101    END-EXEC.
           EXEC SQL INCLUDE COCD3401    END-EXEC.

           EXEC SQL
                DECLARE CRS_COT53 CURSOR FOR
                SELECT ZCUNICO
                     , NTRABALHADOR
                     , GNOME
                     , CTIPVIN
                     , DADESAO
                     , DCANCEL
                     , DNASC
                     , GLOCALIDADE
                     , CNAC
                     , ISTATUS
                  FROM COVT5305_PESSOAS
                  WHERE ISTATUS = :COCD5305-ISTATUS
              ORDER BY NTRABALHADOR
           END-EXEC.

           EXEC SQL
                DECLARE CRS_COT70 CURSOR FOR
                SELECT CIDEMP
                     , DFERIAS
                     , CSITU
                     , ZHORAS
                  FROM COVT7001
                  WHERE CIDEMP  = :COCD7001-CIDEMP
                    AND DFERIAS < :COCD7001-DFERIAS
              ORDER BY CIDEMP, DFERIAS
           END-EXEC.

           EXEC SQL
                DECLARE CRS_COT51 CURSOR FOR
                SELECT CIDEMP
                     , DTPROC
                     , CSITU
                     , ZHORAS
                     , CIDPROJ
                  FROM COVT5101_TIMEREPT
                  WHERE CIDEMP  = :COCD5101-CIDEMP
                    AND CIDPROJ IN (:WS-FERIAS,
                                    :WS-FERIAS-PREM)
                    AND DTPROC  < :COCD5101-DTPROC
              ORDER BY CIDEMP, CIDPROJ, DTPROC
           END-EXEC.

      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'FIM DA WORKING-STORAGE'.
      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
      *                        LINKAGE SECTION                         *
      ******************************************************************
           COPY AQCW0009.
      ******************************************************************
       PROCEDURE DIVISION USING AQCW0009-DATA.
      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
       0000-MAINLINE.
      ******************************************************************
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           IF AQCW0009-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2000-PROC-PROGRAMA-EXIT
           END-IF.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.

       0000-MAINLINE-EXIT.
           GOBACK.

      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************
           MOVE '1000-INICIO-PROGRAMA'      TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM AQCP0100-REG-INICIO
                 THRU AQCP0100-REG-INICIO-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM AQCP0100-OBT-DADOS-ARQ
                 THRU AQCP0100-OBT-DADOS-ARQ-EXIT
           END-IF.

       1000-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************
           MOVE '2000-PROC-PROGRAMA'        TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2500-OBTEM-PERIODO
              THRU 2500-OBTEM-PERIODO-EXIT.

           IF AQCW0009-SEM-ERROS
             PERFORM 2100-OPEN-CURSOR
                THRU 2100-OPEN-CURSOR-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
             PERFORM 2200-FETCH-CURSOR
                THRU 2200-FETCH-CURSOR-EXIT
           END-IF.

           PERFORM 2300-TRATA-COLAB
              THRU 2300-TRATA-COLAB-EXIT
                UNTIL NOT DB2-OK
                   OR NOT AQCW0009-SEM-ERROS

           EXEC SQL
             CLOSE CRS_COT53
           END-EXEC.

       2000-PROC-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2100-OPEN-CURSOR.
      ******************************************************************
           MOVE '2100-OPEN-CURSOR'          TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE DCLCOCD5305.

           MOVE CON-ACTIVO TO COCD5305-ISTATUS.

           EXEC SQL
                OPEN CRS_COT53
           END-EXEC.

           MOVE WS-COVT5304                 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2100-OPEN-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2200-FETCH-CURSOR.
      ******************************************************************
           MOVE '2200-FETCH-CURSOR'         TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
                FETCH CRS_COT53
                 INTO :COCD5305-ZCUNICO
                    , :COCD5305-NTRABALHADOR
                    , :COCD5305-GNOME
                    , :COCD5305-CTIPVIN
                    , :COCD5305-DADESAO
                    , :COCD5305-DCANCEL
                    , :COCD5305-DNASC
                    , :COCD5305-GLOCALIDADE
                    , :COCD5305-CNAC
                    , :COCD5305-ISTATUS
           END-EXEC.

           MOVE WS-COVT5304                 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
           WHEN DB2-NOTFND
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2200-FETCH-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2300-TRATA-COLAB.
      ******************************************************************
           MOVE '2300-TRATA-COLAB'          TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2500-VALIDA-FERIAS
              THRU 2500-VALIDA-FERIAS-EXIT.

           PERFORM 2500-VALIDA-POR-TR
              THRU 2500-VALIDA-POR-TR-EXIT.

           PERFORM 2500-VALIDA-TOLERANCIA
              THRU 2500-VALIDA-TOLERANCIA-EXIT.

           IF AQCW0009-SEM-ERROS
              PERFORM 2200-FETCH-CURSOR
                 THRU 2200-FETCH-CURSOR-EXIT
           END-IF.

       2300-TRATA-COLAB-EXIT.
           EXIT.
      ******************************************************************
       2500-OBTEM-PERIODO.
      ******************************************************************
           MOVE '2500-OBTEM-PERIODO' TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ETCL0002-DATA-PROCESSO  TO WS-DATA-HOJE.
           MOVE '01'                    TO WS-HOJE-DD.
           MOVE WS-DATA-HOJE(1:4)       TO COCD3401-ZANO.
           MOVE WS-DATA-HOJE(6:2)       TO COCD3401-ZMES.

           EXEC SQL
              SELECT CPERIODO
                   , ZANO
                   , ZMES
                   , ZHORASU
                   , CSITU
                 INTO :COCD3401-CPERIODO
                    , :COCD3401-ZANO
                    , :COCD3401-ZMES
                    , :COCD3401-ZHORASU
                    , :COCD3401-CSITU
                FROM COVT3401_PERIODO
                  WHERE  ZANO = :COCD3401-ZANO
                    AND  ZMES = :COCD3401-ZMES
           END-EXEC.

           MOVE WS-COVT3401                 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
             IF COCD3401-CSITU EQUAL COCK0002-SITU-ABERTO
               PERFORM 2510-MES-ANTERIOR
                  THRU 2510-MES-ANTERIOR-EXIT
             END-IF
           WHEN DB2-NOTFND
             CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                MOVE COCD7001-CIDEMP        TO AQCW0100-ACCESS-KEY-GRP
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2500-OBTEM-PERIODO-EXIT.
           EXIT.
      ******************************************************************
       2510-MES-ANTERIOR.
      ******************************************************************
           MOVE '2510-MES-ANTERIOR'    TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE WS-DATA-HOJE               TO AQCW0005-DTX10
           PERFORM AQCP0005-CONV-DT10INDT8
              THRU AQCP0005-CONV-DT10INDT8-EXIT
           MOVE AQCW0005-DT98           TO VIAL1000-DAT-INPUT1

           MOVE 23                      TO VIAL1000-COD-PROCESSO.
           MOVE 1                       TO VIAL1000-PRZ-M.
           MOVE 0                       TO VIAL1000-PRZ-D.
      *
           PERFORM VIAP1000-ROTINA-DATAS
              THRU VIAP1000-EXIT.

           IF NOT VIAL1000-SEM-ERROS
             SET  AQCW0009-RCODE-APL     TO TRUE
             MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
             MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
             MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
             MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
             PERFORM AQCP0100-ESCREVE-MSG
                 THRU AQCP0100-ESCREVE-MSG-EXIT
           ELSE
             MOVE VIAL1000-DAT-RES-ED  TO WS-DATA-HOJE
           END-IF.

       2510-MES-ANTERIOR-EXIT.
           EXIT.
      ******************************************************************
       2500-VALIDA-FERIAS.
      ******************************************************************
           MOVE '2500-VALIDA-FERIAS'    TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2510-OPEN-CURSOR
              THRU 2510-OPEN-CURSOR-EXIT.

           IF AQCW0009-SEM-ERROS
             PERFORM 2510-FETCH-CURSOR
                THRU 2510-FETCH-CURSOR-EXIT
           END-IF.

           PERFORM 2510-CICLO-FERIAS
              THRU 2510-CICLO-FERIAS-EXIT
                UNTIL NOT DB2-OK
                   OR NOT AQCW0009-SEM-ERROS.

           EXEC SQL
             CLOSE CRS_COT70
           END-EXEC.

       2500-VALIDA-FERIAS-EXIT.
           EXIT.

      ******************************************************************
       2510-OPEN-CURSOR.
      ******************************************************************
           MOVE '2510-OPEN-CURSOR'          TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE DCLCOCD7001.

           MOVE COCD5305-NTRABALHADOR   TO COCD7001-CIDEMP.
      **R  MOVE ETCL0002-DATA-PROCESSO  TO WS-DATA-HOJE.
      **R  MOVE '01'                    TO WS-HOJE-DD.
           MOVE WS-DATA-HOJE            TO COCD7001-DFERIAS.

           EXEC SQL
                OPEN CRS_COT70
           END-EXEC.

           MOVE WS-COVT7001                 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2510-OPEN-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2510-FETCH-CURSOR.
      ******************************************************************
           MOVE '2510-FETCH-CURSOR'         TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
                FETCH CRS_COT70
                 INTO :COCD7001-CIDEMP
                    , :COCD7001-DFERIAS
                    , :COCD7001-CSITU
                    , :COCD7001-ZHORAS
           END-EXEC.

           MOVE WS-COVT7001                 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
           WHEN DB2-NOTFND
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2510-FETCH-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2510-CICLO-FERIAS.
      ******************************************************************
           MOVE '2510-CICLO-FERIAS'     TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2510-VALIDA-TR
              THRU 2510-VALIDA-TR-EXIT.

           IF AQCW0009-SEM-ERROS
             PERFORM 2510-FETCH-CURSOR
                THRU 2510-FETCH-CURSOR-EXIT
           END-IF.

       2510-CICLO-FERIAS-EXIT.
           EXIT.

      ******************************************************************
       2500-VALIDA-POR-TR.
      ******************************************************************
           MOVE '2500-VALIDA-POR-TR'    TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2510-OPEN-TR
              THRU 2510-OPEN-TR-EXIT.

           IF AQCW0009-SEM-ERROS
             PERFORM 2510-FETCH-TR
                THRU 2510-FETCH-TR-EXIT
           END-IF.

           PERFORM 2510-CICLO-POR-TR
              THRU 2510-CICLO-POR-TR-EXIT
                UNTIL NOT DB2-OK
                   OR NOT AQCW0009-SEM-ERROS.

           EXEC SQL
             CLOSE CRS_COT51
           END-EXEC.

       2500-VALIDA-POR-TR-EXIT.
           EXIT.

      ******************************************************************
       2510-CICLO-POR-TR.
      ******************************************************************
           MOVE '2510-CICLO-POR-TR'     TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2510-VALIDA-REG-FERIAS
              THRU 2510-VALIDA-REG-FERIAS-EXIT.

           IF AQCW0009-SEM-ERROS
             PERFORM 2510-FETCH-TR
                THRU 2510-FETCH-TR-EXIT
           END-IF.

       2510-CICLO-POR-TR-EXIT.
           EXIT.

      ******************************************************************
       2510-VALIDA-TR.
      ******************************************************************
           MOVE '2510-VALIDA-TR'        TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD7001-CIDEMP          TO COCD5101-CIDEMP
           MOVE COCD7001-DFERIAS         TO COCD5101-DTPROC
           MOVE COCK0002-CONTA-FERIAS    TO COCD5101-CIDPROJ
           MOVE COCK0002-CTA-FERIAS-PREM TO WS-FERIAS-PREM

           EXEC SQL
                SELECT  CIDEMP
                     ,  DTPROC
                     ,  CIDPROJ
                     ,  ZHORAS
             INTO :COCD5101-CIDEMP
                , :COCD5101-DTPROC
                , :COCD5101-CIDPROJ
                , :COCD5101-ZHORAS
                  FROM  COVT5101_TIMEREPT
                 WHERE  CIDEMP      =  :COCD5101-CIDEMP
                   AND  DTPROC      =  :COCD5101-DTPROC
                   AND (CIDPROJ     =  :COCD5101-CIDPROJ
                    OR  CIDPROJ     =  :WS-FERIAS-PREM)

           END-EXEC.

           MOVE WS-COVT5101                 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
             IF COCD7001-CSITU = CON-PENDENTE
      * FERIAS POR APROVAR C/ HORAS CORRECTAMENTE LANÇADAS EM TR
               IF COCD5101-ZHORAS EQUAL COCD7001-ZHORAS
                 MOVE COCK0002-GAT-FER-NAPROV-HOK TO COCL0030-CGATILHO
                 PERFORM 2500-CRIA-GATILHO
                    THRU 2500-CRIA-GATILHO-EXIT
               ELSE
      * FERIAS POR APROVAR C/ HORAS DISPARES LANÇADAS EM TR
                 MOVE COCK0002-GAT-FER-NAPROV-HNO TO COCL0030-CGATILHO
                 PERFORM 2500-CRIA-GATILHO
                    THRU 2500-CRIA-GATILHO-EXIT
               END-IF
             END-IF
           WHEN DB2-NOTFND
             IF COCD7001-CSITU = CON-APROVADO
      * FERIAS APROVADAS, SEM HORAS DE TR
               MOVE COCK0002-GAT-FER-NOTR-APROV TO COCL0030-CGATILHO
               PERFORM 2500-CRIA-GATILHO
                  THRU 2500-CRIA-GATILHO-EXIT
             ELSE
               IF COCD7001-CSITU = CON-PENDENTE
      * FERIAS POR APROVAR
                 MOVE COCK0002-GAT-FER-NOTR-NAPRO TO COCL0030-CGATILHO
                 PERFORM 2500-CRIA-GATILHO
                    THRU 2500-CRIA-GATILHO-EXIT
               END-IF
             END-IF
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                MOVE COCD7001-CIDEMP        TO AQCW0100-ACCESS-KEY-GRP
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2510-VALIDA-TR-EXIT.
           EXIT.

      ******************************************************************
       2510-OPEN-TR.
      ******************************************************************
           MOVE '2510-OPEN-TR'          TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE DCLCOCD5101.

           MOVE COCD5305-NTRABALHADOR   TO COCD5101-CIDEMP.
      **R  MOVE ETCL0002-DATA-PROCESSO  TO WS-DATA-HOJE.
      **R  MOVE '01'                    TO WS-HOJE-DD.
           MOVE WS-DATA-HOJE            TO COCD5101-DTPROC.

           EXEC SQL
                OPEN CRS_COT51
           END-EXEC.

           MOVE WS-COVT5101                 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2510-OPEN-TR-EXIT.
           EXIT.

      ******************************************************************
       2510-FETCH-TR.
      ******************************************************************
           MOVE '2510-FETCH-TR'         TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
                FETCH CRS_COT51
                 INTO :COCD5101-CIDEMP
                    , :COCD5101-DTPROC
                    , :COCD5101-CSITU
                    , :COCD5101-ZHORAS
                    , :COCD5101-CIDPROJ
           END-EXEC.

           MOVE WS-COVT5101                 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
           WHEN DB2-NOTFND
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2510-FETCH-TR-EXIT.
           EXIT.

      ******************************************************************
       2510-VALIDA-REG-FERIAS.
      ******************************************************************
           MOVE '2510-VALIDA-REG-FERIAS' TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD5101-CIDEMP          TO COCD7001-CIDEMP
           MOVE COCD5101-DTPROC          TO COCD7001-DFERIAS
           MOVE COCK0002-CONTA-FERIAS    TO WS-FERIAS
           MOVE COCK0002-CTA-FERIAS-PREM TO WS-FERIAS-PREM

           EXEC SQL
                SELECT  CIDEMP
                     ,  DFERIAS
                     ,  ZHORAS
             INTO :COCD7001-CIDEMP
                , :COCD7001-DFERIAS
                , :COCD7001-ZHORAS
                  FROM  COVT7001
                 WHERE  CIDEMP      =  :COCD7001-CIDEMP
                   AND  DFERIAS     =  :COCD7001-DFERIAS
           END-EXEC.

           MOVE WS-COVT7001                 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
             CONTINUE
           WHEN DB2-NOTFND
      * FERIAS LANÇADAS EM TR, SEM REGISTO DE DIAS DE FERIAS ACTUALIZAD
               MOVE COCK0002-GAT-TR-NOREG   TO COCL0030-CGATILHO
               PERFORM 2500-CRIA-GATILHO
                  THRU 2500-CRIA-GATILHO-EXIT
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                MOVE COCD7001-CIDEMP        TO AQCW0100-ACCESS-KEY-GRP
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2510-VALIDA-REG-FERIAS-EXIT.
           EXIT.

      ******************************************************************
       2500-VALIDA-TOLERANCIA.
      ******************************************************************
           MOVE '2500-VALIDA-TOLERANCIA' TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD5101-DTPROC          TO ARCD7001-DDATA

           EXEC SQL
             SELECT DDATA
                  , CDIASEM
                  , CTIPOFER
                 INTO :ARCD7001-DDATA
                    , :ARCD7001-CDIASEM
                    , :ARCD7001-CTIPOFER
             FROM ARVT7001
             WHERE CTIPOFER  = :CON-TOLERANCIA
               AND DDATA     = :ARCD7001-DDATA
           END-EXEC.

           MOVE WS-ARVT7001                 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
      * FERIAS LANÇADAS EM DIA DE TOLERANCIA DE PONTO
               MOVE COCK0002-GAT-TOLERNACIA TO COCL0030-CGATILHO
               PERFORM 2500-CRIA-GATILHO
                  THRU 2500-CRIA-GATILHO-EXIT
           WHEN DB2-NOTFND
             CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                MOVE COCD7001-CIDEMP        TO AQCW0100-ACCESS-KEY-GRP
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2500-VALIDA-TOLERANCIA-EXIT.
           EXIT.
      ******************************************************************
       2500-CRIA-GATILHO.
      ******************************************************************
           MOVE '2500-CRIA-GATILHO'    TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD5305-ZCUNICO              TO COCL0030-CCHAVE.
           MOVE COCD7001-DFERIAS              TO WS-DADOS-01.
           MOVE COCD5305-GNOME                TO WS-DADOS-02.
           MOVE WS-DADOS                      TO COCL0030-DADOS.

           PERFORM ETCP0003-STD-INIT
              THRU ETCP0003-STD-INIT-EXIT.

           PERFORM COCP0030-CALL-ROTINA
              THRU COCP0030-CALL-ROTINA-EXIT.

           PERFORM ETCP0003-STD-END
              THRU ETCP0003-STD-END-EXIT.

           IF NOT ETCL0002-SEM-ERROS
             SET  AQCW0009-RCODE-APL     TO TRUE
             MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
             MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
             MOVE COCD7001-CIDEMP        TO AQCW0100-ACCESS-KEY-GRP
             PERFORM AQCP0100-ESCREVE-MSG
                THRU AQCP0100-ESCREVE-MSG-EXIT
           END-IF.

       2500-CRIA-GATILHO-EXIT.
           EXIT.

      ******************************************************************
       3000-FIM-PROGRAMA.
      ******************************************************************
           MOVE '3000-FIM-PROGRAMA'         TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           CLOSE COF01300-FILE.

      * Processos finais
            PERFORM AQCP0009-TRATA-RCODE
               THRU AQCP0009-TRATA-RCODE-EXIT.

            PERFORM AQCP0002-TRATA-SYNCPOINT
               THRU AQCP0002-TRATA-SYNCPOINT-EXIT.

           PERFORM AQCP0100-REG-FIM
              THRU AQCP0100-REG-FIM-EXIT.

       3000-FIM-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
           EXEC SQL INCLUDE AQCP0002 END-EXEC.
      ******************************************************************
           COPY AQCP0009.
           COPY AQCP0109.
           COPY VIAP0011.
           COPY VIAP0012.
           COPY VIAP0015.
           COPY VIAP1000.
           COPY VIATP300.
           COPY COCP0030.

      ******************************************************************
