       IDENTIFICATION DIVISION.
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
      * PROGRAM NAME
      ******************************************************************
       PROGRAM-ID. COB03500.
      ******************************************************************
      *                                                                *
      *     Batch de renovação de Contratos (COT74)                    *
      *                                                                *
      ******************************************************************
      * MIGRACAO DE FACTURAS                                           *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      *          *        *        *                                   *
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
      ******************************************************************
      *                     CONFIGURATION SECTION                      *
      ******************************************************************
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
      *                      INPUT-OUTPUT SECTION                      *
      ******************************************************************
       FILE-CONTROL.
      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       FILE SECTION.
      ******************************************************************
      *                          FILE SECTION                          *
      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'INICIO WORKING-STORAGE'.

       01  WS-PROGRAM-CONTROL.
           05 WS-PGMNAME               PIC  X(10)  VALUE 'COB03500'.
           05 WS-PROGNAME              PIC  X(10)  VALUE 'COB03500'.
           05 WS-PASSOU-FIM-CONTRATO   PIC  X(01)  VALUE SPACES.

      ******************************************************************
      *            DECLARACOES DE DB2
      ******************************************************************
           EXEC SQL INCLUDE SQLCA    END-EXEC.
           EXEC SQL INCLUDE COCD7402 END-EXEC.

      ******************************************************************
      * CONSTANTES
      ******************************************************************
       01  CONSTANTES.
           05 CON-COVT7402             PIC  X(10) VALUE 'COVT7402'.
           05 CON-S                    PIC  X(01) VALUE 'S'.
           05 CON-ESPACOS              PIC  X(03) VALUE '   '.
           05 CON-21                   PIC  X(02) VALUE '21'.

      ******************************************************************
      * VARIAVEIS
      ******************************************************************
       01  WS-VARIAVEIS.
           05 WS-DATA-HOJE          PIC X(10)  VALUE SPACES.
           05 WS-DINIP-ORIG         PIC X(10)  VALUE SPACES.
           05 WS-DFIMP-ORIG         PIC X(10)  VALUE SPACES.

       01  WS-SWITCHES.
           05 WS-STATUS-COT74       PIC S9(03) VALUE 0.
              88 WS-COT74-OK                   VALUE 0.
              88 WS-COT74-NOTFND               VALUE 100.

      ******************************************************************
      * COPYS
      ******************************************************************
       COPY VIAL1000.
       COPY VIATW300.
       COPY ATCK0001.
       COPY ARCK0002.
       COPY COCK0002.
       COPY VIAL0015.
       COPY AQCL0001.
       COPY AQCW0109.
       COPY AQCW0009.
       COPY VIAW0030.
       COPY VIAW0012.
       COPY VIATK001.
       COPY VIATK002.
       COPY EXCK0002.
       COPY ETCL0050.

      ******************************************************************
      * DB2
      ******************************************************************
       01  WS-CURSOR-VARS.
           05 FILLER                     PIC X(01) VALUE SPACES.

           EXEC SQL
                DECLARE CURCOT74 CURSOR FOR
                SELECT
                       ZCUNICO
                     , CCONTRATO
                     , ZSEQ
                     , GREFCONT
                     , DDATINI
                     , CPRAZO
                     , DDATFIM
                     , CRENOV
                     , DDATINIU
                     , DDATFIMU
                     , CTIPPER
                     , NDIASAVI
                     , GOBSERV
                     , CUSERID
                     , HTIMEST
                     , DDATINIP
                     , DDATFIMP
                  FROM COVT7402
              WHERE CRENOV   = :CON-S
                AND CTIPPER <> :CON-ESPACOS
                AND DDATFIMU < :WS-DATA-HOJE
              FOR UPDATE OF DDATINIU
                          , DDATFIMU
                          , DDATINIP
                          , DDATFIMP
           END-EXEC.

      ******************************************************************
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COB05TEMP         '.
      *****************************************************************
      *                    LINKAGE SECTION
      *****************************************************************
       COPY VIAL0005.

      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
           EXEC SQL INCLUDE VIAP0014 END-EXEC.

       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           IF ATCK0001-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2000-PROC-PROGRAMA-EXIT
           END-IF.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.

       0000-MAINLINE-EXIT.
           GOBACK.
      ******************************************************************
      *                   INICIO PROGRAMA
      ******************************************************************
       1000-INICIO-PROGRAMA.

           INITIALIZE WS-VARIAVEIS
                    , WS-SWITCHES.

           MOVE ARCK0002-RCODE-OK         TO ATCK0001-RCODE.

      * INFORMA ARQUITECTURA BATCH
           PERFORM AQCP0100-OBT-DADOS-ARQ
              THRU AQCP0100-OBT-DADOS-ARQ-EXIT.

           MOVE AQCW0100-AT-DEBUG         TO VIAL0015-I-DEBUG.
           SET VIAL0015-DEBUG-SIM TO TRUE

           IF AQCW0009-SEM-ERROS
              PERFORM AQCP0100-REG-INICIO
                 THRU AQCP0100-REG-INICIO-EXIT
           END-IF.

       1000-INICIO-PROGRAMA-EXIT.
           EXIT.
      ******************************************************************
      *                   PROCESSA PROGRAMA
      ******************************************************************
       2000-PROC-PROGRAMA.

           IF VIAL0015-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA   ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2100-OPEN-CURCOT74
              THRU 2100-OPEN-CURCOT74-EXIT.

           IF ATCK0001-SEM-ERROS
              PERFORM 2200-FETCH-CURCOT74
                 THRU 2200-FETCH-CURCOT74-EXIT
           END-IF.

           PERFORM 2300-PROCESSA-CURCOT74
              THRU 2300-PROCESSA-CURCOT74-EXIT
             UNTIL NOT ATCK0001-SEM-ERROS
                OR NOT WS-COT74-OK.

           PERFORM 2500-CLOSE-CURCOT74
              THRU 2500-CLOSE-CURCOT74-EXIT.

       2000-PROC-PROGRAMA-EXIT.
           EXIT.
      ******************************************************************
      *                   OPEN CURCOT74
      ******************************************************************
       2100-OPEN-CURCOT74.

           IF VIAL0015-DEBUG-SIM
              MOVE '2100-OPEN-CURCOT74      ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ETCL0002-DATA-PROCESSO   TO WS-DATA-HOJE.

           EXEC SQL
                OPEN CURCOT74
           END-EXEC.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           MOVE SQLCODE                     TO WS-STATUS-COT74.

           IF  NOT DB2-OK
           AND NOT DB2-NOTFND
             SET  VIAW0030-DB2-ERROR         TO TRUE
             SET  VIAW0012-ABEND-DB2         TO TRUE
             MOVE WS-PROGNAME                TO VIAW0030-PGMNAME
             MOVE VIAL0015-CALLER-ID         TO VIAW0030-PARAGRAPH-NAME
             MOVE VIAW0012-TABLE-NAME        TO VIAW0030-TABLE-NAME
             MOVE VIAW0012-SQLCODE           TO VIAW0030-SQLCODE
             MOVE SPACES                     TO VIAW0030-ACCESS-KEY
             MOVE 'ERRO NO OPEN DO CURSOR'   TO VIAW0030-DESC1
             MOVE 'CURCOT74'                 TO VIAW0030-DESC2
             PERFORM VIAP0030-ESCREVE-SPOOL
                THRU VIAP0030-ESCREVE-SPOOL-EXIT
             PERFORM 9990-ABEND
                THRU 9999-ABEND-EXIT
           END-IF.

       2100-OPEN-CURCOT74-EXIT.
           EXIT.
      ******************************************************************
      *                   FETCH CURCOT74
      ******************************************************************
       2200-FETCH-CURCOT74.

           IF VIAL0015-DEBUG-SIM
              MOVE '2200-FETCH-CURCOT74  ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
               FETCH CURCOT74
               INTO :COCD7402-ZCUNICO
                  , :COCD7402-CCONTRATO
                  , :COCD7402-ZSEQ
                  , :COCD7402-GREFCONT
                  , :COCD7402-DDATINI
                  , :COCD7402-CPRAZO
                  , :COCD7402-DDATFIM
                  , :COCD7402-CRENOV
                  , :COCD7402-DDATINIU
                  , :COCD7402-DDATFIMU
                  , :COCD7402-CTIPPER
                  , :COCD7402-NDIASAVI
                  , :COCD7402-GOBSERV
                  , :COCD7402-CUSERID
                  , :COCD7402-HTIMEST
                  , :COCD7402-DDATINIP
                  , :COCD7402-DDATFIMP
           END-EXEC.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           MOVE SQLCODE                TO WS-STATUS-COT74.

           IF  NOT DB2-OK
           AND NOT DB2-NOTFND
             SET  VIAW0030-DB2-ERROR          TO TRUE
             SET  VIAW0012-ABEND-DB2          TO TRUE
             MOVE WS-PROGNAME                 TO VIAW0030-PGMNAME
             MOVE VIAL0015-CALLER-ID          TO VIAW0030-PARAGRAPH-NAME
             MOVE VIAW0012-TABLE-NAME         TO VIAW0030-TABLE-NAME
             MOVE VIAW0012-SQLCODE            TO VIAW0030-SQLCODE
             MOVE SPACES                      TO VIAW0030-ACCESS-KEY
             MOVE 'ERRO NO FETCH DO CURSOR'   TO VIAW0030-DESC1
             MOVE 'CURCOT74'                  TO VIAW0030-DESC2
             PERFORM VIAP0030-ESCREVE-SPOOL
                THRU VIAP0030-ESCREVE-SPOOL-EXIT
             PERFORM 9990-ABEND
                THRU 9999-ABEND-EXIT
           END-IF.

       2200-FETCH-CURCOT74-EXIT.
           EXIT.
      ******************************************************************
      *                   PROCESSA CURCOT74.
      ******************************************************************
       2300-PROCESSA-CURCOT74.

           IF VIAL0015-DEBUG-SIM
              MOVE '2300-PROCESSA-CURCOT74  ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2400-TRATA-CURCOT74
              THRU 2400-TRATA-CURCOT74-EXIT.

           IF ATCK0001-SEM-ERROS
              PERFORM 2200-FETCH-CURCOT74
                 THRU 2200-FETCH-CURCOT74-EXIT
           END-IF.

       2300-PROCESSA-CURCOT74-EXIT.
           EXIT.
      ******************************************************************
      *                   TRATA CURCOT74
      ******************************************************************
       2400-TRATA-CURCOT74.

           IF VIAL0015-DEBUG-SIM
              MOVE '2400-TRATA-CURCOT74     ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2450-ACT
              THRU 2450-ACT-EXIT.

       2400-TRATA-CURCOT74-EXIT.
           EXIT.

      ******************************************************************
      *                   2450-ACT
      ******************************************************************
       2450-ACT.

           IF VIAL0015-DEBUG-SIM
              MOVE '2450-ACT            ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
      *--- ACTUALIZAÇÃO DOS CAMPOS DATA ---*
      *
           PERFORM 2460-ACT-DATAS
              THRU 2460-ACT-DATAS-EXIT.

           IF WS-PASSOU-FIM-CONTRATO = CON-ESPACOS
              PERFORM 2900-UPDATE THRU 2900-UPDATE-EXIT
           END-IF.
      *
       2450-ACT-EXIT.
           EXIT.

      ******************************************************************
      *                   2460-ACT-DATAS
      ******************************************************************
       2460-ACT-DATAS.

           IF VIAL0015-DEBUG-SIM
              MOVE '2460-ACT-DATAS          ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

      *
           MOVE COCD7402-DDATINIP          TO COCD7402-DDATINIU
                                              WS-DINIP-ORIG.
           MOVE COCD7402-DDATFIMP          TO COCD7402-DDATFIMU
                                              WS-DFIMP-ORIG.
      *
           MOVE COCD7402-DDATFIMU          TO COCD7402-DDATINIP.
           PERFORM 2470-PRX-RENOV
              THRU 2470-PRX-RENOV-EXIT.

       2460-ACT-DATAS-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *            2470-PRX-RENOV
      *--------------------------------------------------------------
       2470-PRX-RENOV.
      *
           IF VIAL0015-DEBUG-SIM
              MOVE '2470-PRX-RENOV     ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           INITIALIZE VIAL1000-AREA-COMUNICACAO.
           MOVE CON-21                      TO VIAL1000-COD-PROCESSO.
           MOVE COCD7402-CTIPPER            TO VIAL1000-COD-PRZ.
           MOVE COCD7402-DDATINIP           TO VIATW300-DATA10.
           PERFORM VIATP300-CONV-DATA108
              THRU VIATP300-CONV-DATA108-EXIT.
           MOVE VIATW300-DATA8              TO VIAL1000-DAT-INPUT1.
           PERFORM VIAP1000-ROTINA-DATAS
              THRU VIAP1000-EXIT.
      *
           IF VIAL1000-SEM-ERROS
              MOVE VIAL1000-DAT-RES-ED      TO COCD7402-DDATFIMP
           ELSE
              MOVE VIAL1000-IND-ERROS       TO VIAL0002-IND-ERROS
              MOVE VIAL1000-COD-ERRO-GRAVE  TO VIAL0002-COD-ERRO-GRAVE
           END-IF.
      *
           IF WS-DFIMP-ORIG     > COCD7402-DDATFIM
              MOVE CON-S       TO WS-PASSOU-FIM-CONTRATO
           ELSE
              MOVE CON-ESPACOS TO WS-PASSOU-FIM-CONTRATO
           END-IF.
      *
       2470-PRX-RENOV-EXIT.
           EXIT.

      ******************************************************************
      *                   CLOSE CURCOT74
      ******************************************************************
       2500-CLOSE-CURCOT74.

           IF VIAL0015-DEBUG-SIM
              MOVE '2500-CLOSE-CURCOT74     ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
                CLOSE CURCOT74
           END-EXEC.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF  NOT DB2-OK
           AND NOT DB2-NOTFND
             SET  VIAW0030-DB2-ERROR         TO TRUE
             SET  VIAW0012-ABEND-DB2         TO TRUE
             MOVE WS-PROGNAME                TO VIAW0030-PGMNAME
             MOVE VIAL0015-CALLER-ID         TO VIAW0030-PARAGRAPH-NAME
             MOVE VIAW0012-TABLE-NAME        TO VIAW0030-TABLE-NAME
             MOVE VIAW0012-SQLCODE           TO VIAW0030-SQLCODE
             MOVE SPACES                     TO VIAW0030-ACCESS-KEY
             MOVE 'ERRO NO CLOSE DO CURSOR'  TO VIAW0030-DESC1
             MOVE 'CURCOT74'                 TO VIAW0030-DESC2
             PERFORM VIAP0030-ESCREVE-SPOOL
                THRU VIAP0030-ESCREVE-SPOOL-EXIT
             PERFORM 9990-ABEND
                THRU 9999-ABEND-EXIT
           END-IF.

       2500-CLOSE-CURCOT74-EXIT.
           EXIT.

      ******************************************************************
      *                   2900-UPDATE
      ******************************************************************
       2900-UPDATE.

           IF VIAL0015-DEBUG-SIM
              MOVE '2900-UPDATE         ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.
      *
           EXEC SQL
             UPDATE COVT7402
                SET DDATINIU    =   :COCD7402-DDATINIU
                  , DDATFIMU    =   :COCD7402-DDATFIMU
                  , DDATINIP    =   :COCD7402-DDATINIP
                  , DDATFIMP    =   :COCD7402-DDATFIMP
              WHERE CURRENT OF CURCOT74
           END-EXEC.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
             WHEN DB2-OK
               CONTINUE
             WHEN OTHER
               PERFORM 9990-ABEND
                  THRU 9999-ABEND-EXIT
           END-EVALUATE.
      *
       2900-UPDATE-EXIT.
           EXIT.

      ******************************************************************
      *                     3000-FIM-PROGRAMA.
      ******************************************************************
       3000-FIM-PROGRAMA.

           IF VIAL0015-DEBUG-SIM
              MOVE '3000-FIM-PROGRAMA       ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF NOT ATCK0001-SEM-ERROS
              EXEC SQL ROLLBACK END-EXEC
           ELSE
              EXEC SQL COMMIT   END-EXEC
           END-IF.

           IF NOT ATCK0001-SEM-ERROS
             MOVE '*** ERRO COB05TEMP ***'   TO VIAL0015-CALLER-ID
             MOVE 'ATCK0001-RCODE '        TO VIAL0015-CAMPO-NM(1)
             MOVE ATCK0001-RCODE           TO VIAL0015-CAMPO-VLR(1)
             PERFORM VIAP0015-TRATA-DEBUG
                THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM AQCP0009-TRATA-RCODE
              THRU AQCP0009-TRATA-RCODE-EXIT.

           PERFORM AQCP0002-TRATA-SYNCPOINT
              THRU AQCP0002-TRATA-SYNCPOINT-EXIT.

           IF AQCW0009-SEM-ERROS
              PERFORM AQCP0100-REG-FIM
                 THRU AQCP0100-REG-FIM-EXIT
           END-IF.

       3000-FIM-PROGRAMA-EXIT.
           EXIT.
      ******************************************************************
           COPY VIAP0015.
           COPY AQCP0109.
           COPY AQCP0009.
           COPY VIAP0030.
           COPY VIAP1000.
           COPY VIATP300.

           EXEC SQL INCLUDE VIAP9999 END-EXEC.
           EXEC SQL INCLUDE AQCP0002 END-EXEC.
           EXEC SQL INCLUDE VIAP0012 END-EXEC.
