       IDENTIFICATION DIVISION.
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
       PROGRAM-ID. COB04460.
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
      ******************************************************************
      *                     CONFIGURATION SECTION                      *
      ******************************************************************
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
      *                      INPUT-OUTPUT SECTION                      *
      ******************************************************************
       FILE-CONTROL.
           SELECT   COF04460-FILE
                    ASSIGN              TO DISK-COF04460
                    ORGANIZATION        IS SEQUENTIAL
                    FILE STATUS         IS VIAW0011-FSTATUS.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       FILE SECTION.
      ******************************************************************
      *                          FILE SECTION                          *
      ******************************************************************
       FD  COF04460-FILE.
           COPY COCF4460.

      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                    WORKING STORAGE SECTION                     *
      ******************************************************************
      * CONSTANTES
      ******************************************************************
       01  WS-CONSTANTES.
           05 CON-ESPACOS               PIC  X(10) VALUE '          '.
           05 CON-SEP                   PIC  X(03) VALUE ' - '.
           05 CON-03                    PIC  X(02) VALUE '03'.
           05 CON-A                     PIC  X(01) VALUE 'A'.
           05 CON-N                     PIC  X(01) VALUE 'N'.
           05 CON-S                     PIC  X(01) VALUE 'S'.
           05 CON-1                     PIC  X(01) VALUE '1'.
           05 CON-2                     PIC  X(01) VALUE '2'.
           05 CON-3                     PIC  X(01) VALUE '3'.
           05 CON-9                     PIC  X(01) VALUE '9'.
           05 CON-MENS001               PIC  X(150) VALUE
              'Ferias marcadas e aprovadas sem reporte em TR'.
           05 CON-MENS002               PIC  X(150) VALUE
              'Ferias marcadas (n/aprovadas) sem reporte em TR'.
           05 CON-MENS003               PIC  X(150) VALUE
              'Ferias lançadas em TR sem marcação e aprovação'.
           05 CON-MENS004               PIC  X(150) VALUE
              'Ferias por registadas sem aprovação'.
           05 CON-MENS005               PIC  X(150) VALUE
              'Ferias registadas em TR sem aprovação (c/ dif. horas)'.
           05 WS-PROGNAME               PIC  X(10) VALUE 'COB04460'.
           05 WS-COCF4460               PIC  X(10) VALUE 'COF04460'.
           05 WS-COVT5304               PIC  X(10) VALUE 'COVT5304'.
           05 WS-COVT6500               PIC  X(10) VALUE 'COVT6500'.
           05 WS-PROJFAC                PIC  X(10) VALUE 'PROJFAC '.

      ******************************************************************
      * VARIAVEIS
      ******************************************************************
       01  WS-VARIAVEIS.
           05 WS-DATA-MIN           PIC X(10)  VALUE SPACES.
           05 WS-DATA-HOJE          PIC X(10)  VALUE SPACES.
           05 WS-COLABORADOR        PIC X(10)  VALUE SPACES.
           05 WS-GAT-TR-FERIAS-1    PIC X(05)  VALUE SPACES.
           05 WS-GAT-TR-FERIAS-2    PIC X(05)  VALUE SPACES.
           05 WS-GAT-TR-FERIAS-3    PIC X(05)  VALUE SPACES.
           05 WS-GAT-TR-FERIAS-4    PIC X(05)  VALUE SPACES.
           05 WS-GAT-TR-FERIAS-5    PIC X(05)  VALUE SPACES.

      ******************************************************************
      * COPYS
      ******************************************************************
           COPY AQCL0001.
           COPY AQCW0109.
           COPY VIAL0015.
           COPY VIAW0011.
           COPY VIAW0012.
           COPY VIATK001.
           COPY VIATK002.
           COPY COCK0002.
      ******************************************************************
      * DB2
      ******************************************************************
           EXEC SQL INCLUDE SQLCA       END-EXEC.
           EXEC SQL INCLUDE ARCD0500    END-EXEC.
           EXEC SQL INCLUDE COCD6500    END-EXEC.
           EXEC SQL INCLUDE COCD5304    END-EXEC.

           EXEC SQL
                DECLARE CRS_COT65
                          CURSOR FOR
                SELECT CGATILHO
                     , DTPROC
                     , NSEQ
                     , CCHAVE
                     , DADOS
                     , CSITUACAO
                  FROM COVT6500_GATILHOS
                  WHERE CGATILHO IN (:WS-GAT-TR-FERIAS-1,
                                     :WS-GAT-TR-FERIAS-2,
                                     :WS-GAT-TR-FERIAS-3,
                                     :WS-GAT-TR-FERIAS-4,
                                     :WS-GAT-TR-FERIAS-5)
                    AND CSITUACAO = :COCD6500-CSITUACAO
           END-EXEC.

      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'FIM DA WORKING-STORAGE'.
      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
      *                        LINKAGE SECTION                         *
      ******************************************************************
           COPY AQCW0009.
      ******************************************************************
       PROCEDURE DIVISION USING AQCW0009-DATA.
      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
       0000-MAINLINE.
      ******************************************************************
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           IF AQCW0009-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2000-PROC-PROGRAMA-EXIT
           END-IF.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.

       0000-MAINLINE-EXIT.
           GOBACK.

      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************
           MOVE '1000-INICIO-PROGRAMA'      TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM AQCP0100-REG-INICIO
                 THRU AQCP0100-REG-INICIO-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM AQCP0100-OBT-DADOS-ARQ
                 THRU AQCP0100-OBT-DADOS-ARQ-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM 1100-OPEN-COCF4460
                 THRU 1100-OPEN-COCF4460-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM 1200-WRITE-HEADER
                 THRU 1200-WRITE-HEADER-EXIT
           END-IF.

       1000-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       1100-OPEN-COCF4460.
      ******************************************************************
           MOVE '1100-OPEN-COCF4460'        TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           OPEN OUTPUT COF04460-FILE.

           PERFORM 9030-FSCHECK
              THRU 9039-FSCHECK-EXIT.

           EVALUATE TRUE
           WHEN FS-OK
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE WS-COCF4460            TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0011-FSTATUS       TO AQCW0100-FILE-STATUS
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       1100-OPEN-COCF4460-EXIT.
           EXIT.

      ******************************************************************
       1200-WRITE-HEADER.
      ******************************************************************
           MOVE '1200-WRITE-HEADER'         TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

      * Preencher os titulos das colunas da tabela
           STRING 'Id;'                     DELIMITED BY SIZE
                  'Colaborador;'            DELIMITED BY SIZE
                  'Dados;'                  DELIMITED BY SIZE
                  'Tipo de Erro'            DELIMITED BY SIZE
                                            INTO COCF4460-RECORD.

           WRITE COCF4460-RECORD.

           PERFORM 9030-FSCHECK
              THRU 9039-FSCHECK-EXIT.

           EVALUATE TRUE
           WHEN FS-OK
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE WS-COCF4460            TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0011-FSTATUS       TO AQCW0100-FILE-STATUS
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       1200-WRITE-HEADER-EXIT.
           EXIT.

      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************
           MOVE '2000-PROC-PROGRAMA'        TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2100-OPEN-CURSOR
              THRU 2100-OPEN-CURSOR-EXIT.

           IF AQCW0009-SEM-ERROS
              PERFORM 2200-FETCH-CURSOR
                 THRU 2200-FETCH-CURSOR-EXIT

              PERFORM 2300-PROC-CURSOR
                 THRU 2300-PROC-CURSOR-EXIT
                      UNTIL NOT DB2-OK
                         OR NOT AQCW0009-SEM-ERROS

              EXEC SQL
                   CLOSE CRS_COT65
              END-EXEC
           END-IF.

       2000-PROC-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2100-OPEN-CURSOR.
      ******************************************************************
           MOVE '2100-OPEN-CURSOR'          TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE DCLCOCD6500.

           MOVE COCK0002-GAT-FER-NAPROV-HOK TO WS-GAT-TR-FERIAS-1.
           MOVE COCK0002-GAT-FER-NAPROV-HNO TO WS-GAT-TR-FERIAS-2.
           MOVE COCK0002-GAT-FER-NOTR-APROV TO WS-GAT-TR-FERIAS-3.
           MOVE COCK0002-GAT-FER-NOTR-NAPRO TO WS-GAT-TR-FERIAS-4.
           MOVE COCK0002-GAT-TR-NOREG       TO WS-GAT-TR-FERIAS-5.
           MOVE SPACES                      TO COCD6500-CSITUACAO.

           EXEC SQL
                OPEN CRS_COT65
           END-EXEC.

           MOVE WS-COVT6500                 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2100-OPEN-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2200-FETCH-CURSOR.
      ******************************************************************
           MOVE '2200-FETCH-CURSOR'         TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
                FETCH CRS_COT65
                 INTO :COCD6500-CGATILHO
                    , :COCD6500-DTPROC
                    , :COCD6500-NSEQ
                    , :COCD6500-CCHAVE
                    , :COCD6500-DADOS
                    , :COCD6500-CSITUACAO
           END-EXEC.

           MOVE WS-COVT6500                 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
           WHEN DB2-NOTFND
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2200-FETCH-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2300-PROC-CURSOR.
      ******************************************************************
           MOVE '2300-PROC-CURSOR'          TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM 2800-OBTEM-NOME
                 THRU 2800-OBTEM-NOME-EXIT
           END-IF.
      *
           IF AQCW0009-SEM-ERROS
             MOVE ALL ';' TO COCF4460-RECORD
             PERFORM 2700-WRITE-COCF4460
                THRU 2700-WRITE-COCF4460-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
             PERFORM 2800-ACTUALIZA-GATILHO
                THRU 2800-ACTUALIZA-GATILHO-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM 2200-FETCH-CURSOR
                 THRU 2200-FETCH-CURSOR-EXIT
           END-IF.

       2300-PROC-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2700-WRITE-COCF4460.
      ******************************************************************
           MOVE '2700-WRITE-COCF4460'       TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD5304-NTRABALHADOR  TO COCF4460-NTRABALHADOR.
           MOVE COCD5304-GNOME         TO COCF4460-COLABORADOR.
           MOVE COCD6500-DADOS(1:10)   TO COCF4460-DADOS.
           MOVE SPACES                 TO COCF4460-TIPOERRO

      **R  05 CON-MENS001               PIC  X(150) VALUE
      **R     'Ferias marcadas e aprovadas sem reporte em TR'.
      **R  05 CON-MENS002               PIC  X(150) VALUE
      **R     'Ferias marcadas (n/aprovadas) sem reporte em TR'.
      **R  05 CON-MENS003               PIC  X(150) VALUE
      **R     'Ferias lançadas em TR sem marcação e aprovação'.
      **R  05 CON-MENS004               PIC  X(150) VALUE
      **R     'Ferias registadas em TR sem aprovação'.
      **R  05 CON-MENS005               PIC  X(150) VALUE
      **R     'Ferias registadas sem aprovação (c/ dif. horas)'.

           IF COCD6500-CGATILHO = COCK0002-GAT-FER-NOTR-APROV
              MOVE CON-MENS001            TO COCF4460-TIPOERRO
           END-IF

           IF COCD6500-CGATILHO = COCK0002-GAT-FER-NOTR-NAPRO
              MOVE CON-MENS002            TO COCF4460-TIPOERRO
           END-IF

           IF COCD6500-CGATILHO = COCK0002-GAT-TR-NOREG
              MOVE CON-MENS003            TO COCF4460-TIPOERRO
           END-IF

           IF COCD6500-CGATILHO = COCK0002-GAT-FER-NAPROV-HOK
              MOVE CON-MENS004            TO COCF4460-TIPOERRO
           END-IF

           IF COCD6500-CGATILHO = COCK0002-GAT-FER-NAPROV-HNO
              MOVE CON-MENS005            TO COCF4460-TIPOERRO
           END-IF

           WRITE COCF4460-RECORD.

           PERFORM 9030-FSCHECK
              THRU 9039-FSCHECK-EXIT.

           EVALUATE TRUE
           WHEN FS-OK
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE WS-COCF4460            TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0011-FSTATUS       TO AQCW0100-FILE-STATUS
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2700-WRITE-COCF4460-EXIT.
           EXIT.
      *--------------------------------------------------------------
      * ACTUALIZA GATILHOS
      *--------------------------------------------------------------
       2800-ACTUALIZA-GATILHO.

           MOVE '2800-ACTUALIZA-GATILHO'    TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCK0002-SITU-ENCERRADO TO COCD6500-CSITUACAO.

           EXEC SQL
                UPDATE COVT6500_GATILHOS
                   SET CSITUACAO  = :COCD6500-CSITUACAO
                 WHERE CGATILHO   = :COCD6500-CGATILHO
                   AND DTPROC     = :COCD6500-DTPROC
                   AND NSEQ       = :COCD6500-NSEQ
           END-EXEC.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF NOT DB2-OK
             SET  AQCW0009-RCODE-APL     TO TRUE
             MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
             MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
             MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
             MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
             PERFORM AQCP0100-ESCREVE-MSG
                THRU AQCP0100-ESCREVE-MSG-EXIT
           END-IF.

       2800-ACTUALIZA-GATILHO-EXIT.
           EXIT.
      *--------------------------------------------------------------
      * LER PROJECTOS
      *--------------------------------------------------------------
       2800-OBTEM-NOME.

           MOVE COCD6500-CCHAVE        TO WS-COLABORADOR.
           MOVE WS-COLABORADOR         TO COCD5304-ZCUNICO.

           EXEC SQL
                 SELECT ZCUNICO
                      , NTRABALHADOR
                      , GNOME
                 INTO  :COCD5304-ZCUNICO
                    ,  :COCD5304-NTRABALHADOR
                    ,  :COCD5304-GNOME
                 FROM COVT5304_PESSOAS
                 WHERE ZCUNICO     = :COCD5304-ZCUNICO
           END-EXEC

           MOVE WS-COVT5304
             TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF DB2-OK
              CONTINUE
           ELSE
              CONTINUE
           END-IF.

       2800-OBTEM-NOME-EXIT.
           EXIT.

      ******************************************************************
       3000-FIM-PROGRAMA.
      ******************************************************************
           MOVE '3000-FIM-PROGRAMA'         TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           CLOSE COF04460-FILE.

      * Processos finais
            PERFORM AQCP0009-TRATA-RCODE
               THRU AQCP0009-TRATA-RCODE-EXIT.

            PERFORM AQCP0002-TRATA-SYNCPOINT
               THRU AQCP0002-TRATA-SYNCPOINT-EXIT.

           PERFORM AQCP0100-REG-FIM
              THRU AQCP0100-REG-FIM-EXIT.

       3000-FIM-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
           EXEC SQL INCLUDE AQCP0002 END-EXEC.
      ******************************************************************
           COPY AQCP0009.
           COPY AQCP0109.
           COPY VIAP0011.
           COPY VIAP0012.
           COPY VIAP0015.
      ******************************************************************
