       IDENTIFICATION DIVISION.
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
       PROGRAM-ID. COB02300.
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
      ******************************************************************
      *                     CONFIGURATION SECTION                      *
      ******************************************************************
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
      *                      INPUT-OUTPUT SECTION                      *
      ******************************************************************
       FILE-CONTROL.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       FILE SECTION.
      ******************************************************************
      *                          FILE SECTION                          *
      ******************************************************************

      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                    WORKING STORAGE SECTION                     *
      ******************************************************************
      * CONSTANTES
      ******************************************************************
       01  WS-CONSTANTES.
           05 CON-180                   PIC  9(03) VALUE 180.
           05 CON-22                    PIC  9(02) VALUE 22.
           05 CON-01                    PIC  X(02) VALUE '01'.
           05 CON-05                    PIC  X(02) VALUE '05'.
           05 CON-A                     PIC  X(01) VALUE 'A'.
           05 CON-S                     PIC  X(01) VALUE 'S'.
           05 CON-SEP                   PIC  X(03) VALUE ' - '.
           05 WS-PROGNAME               PIC  X(10) VALUE 'COB02300'.
           05 CON-COVT5304              PIC  X(10) VALUE 'COVT5304'.
           05 CON-COVT7100              PIC  X(10) VALUE 'COVT7100'.

      ******************************************************************
      * VARIAVEIS
      ******************************************************************
       01  WS-VARIAVEIS.
           05 WS-ANO-ANT               PIC 9(04)  VALUE ZEROS.
           05 WS-DIAS-ANT              PIC 9(04)  VALUE ZEROS.
           05 WS-NDIAS                 PIC 9(04)  VALUE ZEROS.
           05 WS-NMESES                PIC 9(03)  VALUE ZEROS.

           05 WS-DATA-HOJE             PIC X(10)  VALUE SPACES.
           05 FILLER REDEFINES WS-DATA-HOJE.
              10 WS-DATA-HOJE-ANO      PIC X(04).
              10 FILLER REDEFINES WS-DATA-HOJE-ANO.
                 15 WS-DATA-HOJE-ANO-9 PIC 9(04).
              10 WS-DATA-HOJE-SP1      PIC X(01).
              10 WS-DATA-HOJE-MES      PIC X(02).
              10 WS-DATA-HOJE-SP2      PIC X(01).
              10 WS-DATA-HOJE-DIA      PIC X(02).

           05 WS-INICIO                PIC X(10)  VALUE SPACES.
           05 FILLER REDEFINES WS-INICIO.
              10 WS-INICIO-ANO         PIC X(04).
              10 WS-INICIO-SP1         PIC X(01).
              10 WS-INICIO-MES         PIC X(02).
              10 WS-INICIO-SP2         PIC X(01).
              10 WS-INICIO-DIA         PIC X(02).

      ******************************************************************
      * COPYS
      ******************************************************************
           COPY VIAL1000.
           COPY VIATW300.
           COPY AQCL0001.
           COPY AQCW0109.
           COPY VIAL0015.
           COPY VIAW0011.
           COPY VIAW0012.
           COPY VIATK001.
           COPY VIATK002.
           COPY COCK0002.
      ******************************************************************
      * DB2
      ******************************************************************
           EXEC SQL INCLUDE SQLCA       END-EXEC.
           EXEC SQL INCLUDE COCD5304    END-EXEC.
           EXEC SQL INCLUDE COCD7100    END-EXEC.

           EXEC SQL
                DECLARE CRS_COT53 CURSOR FOR
                SELECT NTRABALHADOR
                     , GNOME
                     , CTIPVIN
                     , DADESAO
                     , DCANCEL
                     , IVIA
                     , ISUBEMP
                     , ISUBREC
                     , ISTATUS
                  FROM COVT5304_PESSOAS
                 WHERE ( IVIA      = :CON-S
                   OR    ISUBEMP   = :CON-S
                   OR    ISUBREC   = :CON-S )
                   AND   ISTATUS   = :CON-A
              ORDER BY NTRABALHADOR
           END-EXEC.

      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'FIM DA WORKING-STORAGE'.
      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
      *                        LINKAGE SECTION                         *
      ******************************************************************
           COPY AQCW0009.
      ******************************************************************
       PROCEDURE DIVISION USING AQCW0009-DATA.
      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
       0000-MAINLINE.
      ******************************************************************
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           IF AQCW0009-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2000-PROC-PROGRAMA-EXIT
           END-IF.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.

       0000-MAINLINE-EXIT.
           GOBACK.

      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************
           MOVE '1000-INICIO-PROGRAMA'      TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM AQCP0100-REG-INICIO
                 THRU AQCP0100-REG-INICIO-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM AQCP0100-OBT-DADOS-ARQ
                 THRU AQCP0100-OBT-DADOS-ARQ-EXIT
           END-IF.

      *--- Para teste força inicio do ano
           MOVE ETCL0002-DATA-PROCESSO      TO WS-DATA-HOJE.
      **R  MOVE '2020-01-01'                TO WS-DATA-HOJE.

       1000-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************
           MOVE '2000-PROC-PROGRAMA'        TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2100-OPEN-CURSOR
              THRU 2100-OPEN-CURSOR-EXIT.

           IF AQCW0009-SEM-ERROS
              PERFORM 2200-FETCH-CURSOR
                 THRU 2200-FETCH-CURSOR-EXIT

              PERFORM 2300-PROC-CURSOR
                 THRU 2300-PROC-CURSOR-EXIT
                      UNTIL NOT DB2-OK
                         OR NOT AQCW0009-SEM-ERROS

              EXEC SQL
                   CLOSE CRS_COT53
              END-EXEC
           END-IF.

       2000-PROC-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2100-OPEN-CURSOR.
      ******************************************************************
           MOVE '2100-OPEN-CURSOR'          TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE DCLCOCD5304.

           EXEC SQL
                OPEN CRS_COT53
           END-EXEC.

           MOVE CON-COVT5304             TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2100-OPEN-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2200-FETCH-CURSOR.
      ******************************************************************
           MOVE '2200-FETCH-CURSOR'         TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
                FETCH CRS_COT53
                 INTO :COCD5304-NTRABALHADOR
                    , :COCD5304-GNOME
                    , :COCD5304-CTIPVIN
                    , :COCD5304-DADESAO
                    , :COCD5304-DCANCEL
                    , :COCD5304-IVIA
                    , :COCD5304-ISUBEMP
                    , :COCD5304-ISUBREC
                    , :COCD5304-ISTATUS
           END-EXEC.

           MOVE CON-COVT5304             TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
           WHEN DB2-NOTFND
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2200-FETCH-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2300-PROC-CURSOR.
      ******************************************************************
           MOVE '2300-PROC-CURSOR'          TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

      *-----------------------------------------------------------------*
      *--- Se o ano da data de hoje for diferente do ano de adesão e ---*
      *--- se o mês da data de hoje for Janeiro e                    ---*
      *--- se o dia da data de hoje for 01                           ---*
      *--- então cria registo de crédito de férias com 22 dias.      ---*
      *-----------------------------------------------------------------*
           MOVE COCD5304-DADESAO TO WS-INICIO.

           IF AQCW0009-SEM-ERROS
             IF WS-DATA-HOJE-ANO GREATER WS-INICIO-ANO
             AND WS-DATA-HOJE-MES     EQUAL CON-01
             AND WS-DATA-HOJE-DIA     EQUAL CON-01
               PERFORM 2700-ESC-COT71-22
                  THRU 2700-ESC-COT71-22-EXIT
             ELSE
               IF WS-DATA-HOJE-ANO     EQUAL WS-INICIO-ANO
                 PERFORM 2400-VAL-REG-ANO
                    THRU 2400-VAL-REG-ANO-EXIT
                 IF AQCW0009-SEM-ERROS
                   IF DB2-NOTFND
                     PERFORM 2700-ESC-COT71-22
                        THRU 2700-ESC-COT71-22-EXIT
                   END-IF
                 END-IF
               END-IF
             END-IF
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM 2200-FETCH-CURSOR
                 THRU 2200-FETCH-CURSOR-EXIT
           END-IF.

       2300-PROC-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2700-ESC-COT71-22.
      ******************************************************************
           MOVE '2700-ESC-COT71-22'       TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD5304-NTRABALHADOR TO COCD7100-CIDEMP.
           MOVE WS-DATA-HOJE-ANO      TO COCD7100-CANO.

           IF COCD5304-CTIPVIN EQUAL COCK0002-CTIPVIN-S-TERM OR
              COCD5304-CTIPVIN EQUAL COCK0002-CTIPVIN-TERM-C OR
              COCD5304-CTIPVIN EQUAL COCK0002-CTIPVIN-TERM-I
             MOVE CON-22                TO COCD7100-NDIAS
           ELSE
             MOVE ZEROES                TO COCD7100-NDIAS
           END-IF.

           MOVE ETCL0002-CUTILIZA     TO COCD7100-CUSERID.

           EXEC SQL
                INSERT INTO COVT7100
                      (CIDEMP
                     , CANO
                     , NDIAS
                     , CUSERID
                     , HTIMEST)
                VALUES(:COCD7100-CIDEMP
                     , :COCD7100-CANO
                     , :COCD7100-NDIAS
                     , :COCD7100-CUSERID
                     ,  CURRENT_TIMESTAMP)
           END-EXEC.

           MOVE CON-COVT7100              TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
              IF DB2-OK
              OR DB2-DUPREC
                 CONTINUE
              ELSE
                 MOVE VIAK0002-ERROS-FUNCAO     TO VIAL0002-IND-ERROS
              END-IF
           END-IF.

       2700-ESC-COT71-22-EXIT.
           EXIT.

      ******************************************************************
       2400-VAL-REG-ANO.
      ******************************************************************
           MOVE '2400-VAL-REG-ANO  '        TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD5304-NTRABALHADOR TO COCD7100-CIDEMP.
           MOVE WS-DATA-HOJE-ANO      TO COCD7100-CANO.

           EXEC SQL
                SELECT CIDEMP
                     , CANO
                  INTO :COCD7100-CIDEMP
                     , :COCD7100-CANO
                  FROM COVT7100
                 WHERE CIDEMP    = :COCD7100-CIDEMP
                   AND CANO      = :COCD7100-CANO
           END-EXEC.

           MOVE CON-COVT7100           TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS AND DB2-OK
             IF DB2-OK OR DB2-NOTFND
              CONTINUE
             ELSE
               MOVE VIAL1000-IND-ERROS
                   TO VIAL0002-IND-ERROS
               MOVE VIAL1000-COD-ERRO-GRAVE
                   TO VIAL0002-COD-ERRO-GRAVE
             END-IF
           END-IF.

       2400-VAL-REG-ANO-EXIT.
           EXIT.

      ******************************************************************
       3000-FIM-PROGRAMA.
      ******************************************************************
           MOVE '3000-FIM-PROGRAMA'         TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

      * Processos finais
            PERFORM AQCP0009-TRATA-RCODE
               THRU AQCP0009-TRATA-RCODE-EXIT.

            PERFORM AQCP0002-TRATA-SYNCPOINT
               THRU AQCP0002-TRATA-SYNCPOINT-EXIT.

           PERFORM AQCP0100-REG-FIM
              THRU AQCP0100-REG-FIM-EXIT.

       3000-FIM-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
           EXEC SQL INCLUDE AQCP0002 END-EXEC.
      ******************************************************************
           COPY AQCP0009.
           COPY AQCP0109.
           COPY VIAP0011.
           COPY VIAP0012.
           COPY VIAP0015.
           COPY VIAP1000.
           COPY VIATP300.
      ******************************************************************
