       IDENTIFICATION DIVISION.
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
       PROGRAM-ID. COB99010.
      ******************************************************************
      * MIGRACAO DE REGISTOS DE PAGAMENTO (FT - FATURAS)               *
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
      ******************************************************************
      *                     CONFIGURATION SECTION                      *
      ******************************************************************
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
      *                      INPUT-OUTPUT SECTION                      *
      ******************************************************************

      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       FILE SECTION.
      ******************************************************************
      *                          FILE SECTION                          *
      ******************************************************************

      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                    WORKING STORAGE SECTION                     *
      ******************************************************************
      * CONSTANTES
      ******************************************************************
       01  WS-CONSTANTES.
           05 CON-ESPACOS               PIC  X(10) VALUE '          '.
           05 CON-FT                    PIC  X(02) VALUE 'FT'.
           05 WS-PROGNAME               PIC  X(10) VALUE 'COB99010'.
           05 CON-COVT5009              PIC  X(10) VALUE 'COVT5009'.
           05 CON-COVT6401              PIC  X(10) VALUE 'COVT6401'.

      ******************************************************************
      * VARIAVEIS
      ******************************************************************
       01  WS-VARIAVEIS.
           05 WS-NSEQ            PIC S9(10)      COMP-3 VALUE ZEROES.
           05 WS-DIF-NTOTPAG     PIC S9(15)V99   COMP-3 VALUE ZEROES.
           05 WS-DIF-NTAXPAG     PIC S9(15)V99   COMP-3 VALUE ZEROES.

      ******************************************************************
      * COPYS
      ******************************************************************
           COPY AQCL0001.
           COPY AQCW0109.
           COPY VIAL0015.
           COPY VIAW0011.
           COPY VIAW0012.
           COPY VIATK001.
           COPY VIATK002.
           COPY COCK0002.
      ******************************************************************
      * DB2
      ******************************************************************
           EXEC SQL INCLUDE SQLCA       END-EXEC.
           EXEC SQL INCLUDE COCD5009    END-EXEC.
           EXEC SQL INCLUDE COCD6401    END-EXEC.

           EXEC SQL
            DECLARE CRS_01   CURSOR FOR
             SELECT GREFINV
                  , NIDPROJECTO
                  , NIDINVOICE
                  , GCLIENTE
                  , DDATAINSER
                  , DDATAEMISS
                  , DDATAEMIS2
                  , DDATEDUE
                  , DPAG
                  , CPRAZO
                  , NTOTALAMOUNT
                  , NTAXAMOUNT
                  , NTOTRET
                  , NTAXRET
                  , GDESCINVOICE
                  , CSTATUS
                  , CTIPDOC
                  , CMOEDA
                  , CIMPOSTO
                  , NOTAS
                  , NTOTPAG
                  , NTAXPAG
               FROM COVT5009_INVOICES
      *     WHERE (CTIPDOC = :CON-FT
      *       AND  GREFNCR = :CON-ESPACOS)
      *        OR  CTIPDOC = :CON-NC
               ORDER BY NIDPROJECTO, NIDINVOICE
           END-EXEC.

      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'FIM DA WORKING-STORAGE'.
      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
      *                        LINKAGE SECTION                         *
      ******************************************************************
           COPY AQCW0009.
      ******************************************************************
       PROCEDURE DIVISION USING AQCW0009-DATA.
      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
       0000-MAINLINE.
      ******************************************************************
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           IF AQCW0009-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2000-PROC-PROGRAMA-EXIT
           END-IF.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.

       0000-MAINLINE-EXIT.
           GOBACK.

      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************
           MOVE '1000-INICIO-PROGRAMA'      TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM AQCP0100-REG-INICIO
                 THRU AQCP0100-REG-INICIO-EXIT
           END-IF.

           IF AQCW0009-SEM-ERROS
              PERFORM AQCP0100-OBT-DADOS-ARQ
                 THRU AQCP0100-OBT-DADOS-ARQ-EXIT
           END-IF.

       1000-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************
           MOVE '2000-PROC-PROGRAMA'        TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2100-OPEN-CURSOR
              THRU 2100-OPEN-CURSOR-EXIT.

           IF AQCW0009-SEM-ERROS
              PERFORM 2200-FETCH-CURSOR
                 THRU 2200-FETCH-CURSOR-EXIT

              PERFORM 2300-PROC-CURSOR
                 THRU 2300-PROC-CURSOR-EXIT
                      UNTIL NOT DB2-OK
                         OR NOT AQCW0009-SEM-ERROS

              EXEC SQL
                   CLOSE CRS_01
              END-EXEC
           END-IF.

       2000-PROC-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2100-OPEN-CURSOR.
      ******************************************************************
           MOVE '2100-OPEN-CURSOR'          TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE DCLCOCD5009.

           EXEC SQL
                OPEN CRS_01
           END-EXEC.

           MOVE CON-COVT5009   TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2100-OPEN-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2200-FETCH-CURSOR.
      ******************************************************************
           MOVE '2200-FETCH-CURSOR'         TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
                FETCH CRS_01
                 INTO :COCD5009-GREFINV
                    , :COCD5009-NIDPROJECTO
                    , :COCD5009-NIDINVOICE
                    , :COCD5009-GCLIENTE
                    , :COCD5009-DDATAINSER
                    , :COCD5009-DDATAEMISS
                    , :COCD5009-DDATAEMIS2
                    , :COCD5009-DDATEDUE
                    , :COCD5009-DPAG
                    , :COCD5009-CPRAZO
                    , :COCD5009-NTOTALAMOUNT
                    , :COCD5009-NTAXAMOUNT
                    , :COCD5009-NTOTRET
                    , :COCD5009-NTAXRET
                    , :COCD5009-GDESCINVOICE
                    , :COCD5009-CSTATUS
                    , :COCD5009-CTIPDOC
                    , :COCD5009-CMOEDA
                    , :COCD5009-CIMPOSTO
                    , :COCD5009-NOTAS
                    , :COCD5009-NTOTPAG
                    , :COCD5009-NTAXPAG
           END-EXEC.

           MOVE CON-COVT5009 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
           WHEN DB2-NOTFND
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2200-FETCH-CURSOR-EXIT.
           EXIT.

      ******************************************************************
       2300-PROC-CURSOR.
      ******************************************************************
           MOVE '2300-PROC-CURSOR'          TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

      *----------------------------------------------------------*
      *--- Se CTIPFAC = "FT"
      *---  e NTOTPAG diferente de zero
      *---  e NTAXPAG diferente de zero
      *---
      *---  verifica se existem registos em COT64_INVPAY que
      *---  somem o total de pagamentos para a factura.
      *---
      *---  Se existirem não faz nada
      *---  Se não existirem ou não somarem o valor igual
      *---  criar registo no COT64_INVPAY com a diferença.
      *----------------------------------------------------------*
           IF AQCW0009-SEM-ERROS
              IF COCD5009-NTOTPAG NOT = ZEROS
              OR COCD5009-NTAXPAG NOT = ZEROS

                 PERFORM 2600-SOMAR-COT64
                    THRU 2600-SOMAR-COT64-EXIT

                 IF  COCD5009-NTOTPAG = COCD6401-NTOTPAG
                 AND COCD5009-NTAXPAG = COCD6401-NTAXPAG
                     CONTINUE
                 ELSE
                     COMPUTE WS-DIF-NTOTPAG = COCD5009-NTOTPAG
                                            - COCD6401-NTOTPAG
                     COMPUTE WS-DIF-NTAXPAG = COCD5009-NTAXPAG
                                            - COCD6401-NTAXPAG
                     PERFORM 2800-CRIAR-COT64
                        THRU 2800-CRIAR-COT64-EXIT
                 END-IF

              END-IF
           END-IF.
      *
           IF AQCW0009-SEM-ERROS
              PERFORM 2200-FETCH-CURSOR
                 THRU 2200-FETCH-CURSOR-EXIT
           END-IF.

       2300-PROC-CURSOR-EXIT.
           EXIT.

      *--------------------------------------------------------------
      * SOMAR NTOTPAG E NTAXPAG DO COT64_INVPAY
      *--------------------------------------------------------------
       2600-SOMAR-COT64.
           MOVE '2600-SOMAR-COT64   '       TO VIAL0015-CALLER-ID.
           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD5009-NIDPROJECTO   TO COCD6401-NIDPROJECTO.
           MOVE COCD5009-NIDINVOICE    TO COCD6401-NIDINVOICE.

           EXEC SQL
             SELECT IFNULL(SUM(NTOTPAG), 0)
                  , IFNULL(SUM(NTAXPAG), 0)
               INTO :COCD6401-NTOTPAG
                  , :COCD6401-NTAXPAG
               FROM COVT6401_INVPAY
              WHERE NIDPROJECTO = :COCD6401-NIDPROJECTO
                AND NIDINVOICE  = :COCD6401-NIDINVOICE
           END-EXEC.

           MOVE CON-COVT6401 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF DB2-OK
              CONTINUE
           ELSE
              MOVE ZEROS TO COCD6401-NTOTPAG
              MOVE ZEROS TO COCD6401-NTAXPAG
           END-IF.

       2600-SOMAR-COT64-EXIT.
           EXIT.

      *--------------------------------------------------------------
      * CRIA REGISTO EM COT64 PELA DIFERENÇA
      *--------------------------------------------------------------
       2800-CRIAR-COT64.
           MOVE '2800-CRIAR-COT64   '       TO VIAL0015-CALLER-ID.
           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD5009-GREFINV         TO COCD6401-GREFINV.
           MOVE COCD5009-NIDPROJECTO     TO COCD6401-NIDPROJECTO.
           MOVE COCD5009-NIDINVOICE      TO COCD6401-NIDINVOICE.

           PERFORM 2810-OBTEM-SEQ THRU 2810-OBTEM-SEQ-EXIT.
           MOVE WS-NSEQ                  TO COCD6401-NSEQ.

           MOVE COCD5009-GCLIENTE        TO COCD6401-GCLIENTE.
           MOVE COCD5009-DDATAINSER      TO COCD6401-DDATAINSER.
           MOVE COCD5009-DDATAEMISS      TO COCD6401-DDATAEMISS.
           MOVE COCD5009-DDATAEMIS2      TO COCD6401-DDATAEMIS2.
           MOVE COCD5009-DDATEDUE        TO COCD6401-DDATEDUE.
           MOVE COCD5009-CPRAZO          TO COCD6401-CPRAZO.
           MOVE COCD5009-NTOTALAMOUNT    TO COCD6401-NTOTALAMOUNT.
           MOVE COCD5009-NTAXAMOUNT      TO COCD6401-NTAXAMOUNT.
           MOVE COCD5009-NTOTRET         TO COCD6401-NTOTRET.
           MOVE COCD5009-NTAXRET         TO COCD6401-NTAXRET.
           MOVE COCD5009-GDESCINVOICE    TO COCD6401-GDESCINVOICE.
           MOVE COCD5009-CSTATUS         TO COCD6401-CSTATUS.
      *--- Ver qual a data de pagamento a usar
           MOVE COCD5009-DPAG            TO COCD6401-DPAG.
           MOVE COCD5009-CTIPDOC         TO COCD6401-CTIPDOC.
           MOVE COCD5009-CMOEDA          TO COCD6401-CMOEDA.
           MOVE COCD5009-CIMPOSTO        TO COCD6401-CIMPOSTO.
           MOVE COCD5009-NOTAS           TO COCD6401-NOTAS.
           MOVE WS-DIF-NTOTPAG           TO COCD6401-NTOTPAG.
           MOVE WS-DIF-NTAXPAG           TO COCD6401-NTAXPAG.
      *
           IF AQCW0009-SEM-ERROS
             PERFORM 2900-INSERE-DADOS
                THRU 2900-INSERE-DADOS-EXIT
           END-IF.

       2800-CRIAR-COT64-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *            2810-OBTEM-SEQ
      *--------------------------------------------------------------
       2810-OBTEM-SEQ.
           IF AQCW0100-AT-DEBUG-SIM
              MOVE '2810-OBTEM-SEQ         '    TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD5009-NIDPROJECTO   TO COCD6401-NIDPROJECTO.
           MOVE COCD5009-NIDINVOICE    TO COCD6401-NIDINVOICE.

           EXEC SQL
              SELECT COUNT(NSEQ)
                INTO :WS-NSEQ
                FROM COVT6401_INVPAY
               WHERE NIDINVOICE  = :COCD6401-NIDINVOICE
                 AND NIDPROJECTO = :COCD6401-NIDPROJECTO
           END-EXEC.

           MOVE CON-COVT6401 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
           WHEN DB2-NOTFND
                ADD 1 TO WS-NSEQ
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2810-OBTEM-SEQ-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *            2900-INSERE-DADOS
      *--------------------------------------------------------------
       2900-INSERE-DADOS.
           IF AQCW0100-AT-DEBUG-SIM
              MOVE '2900-INSERE-DADOS      '    TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE WS-PROGNAME TO COCD6401-CUSERID.

           EXEC SQL
                INSERT INTO COVT6401_INVPAY
                (
                   NIDINVOICE
                 , NSEQ
                 , NIDPROJECTO
                 , GCLIENTE
                 , DDATAINSER
                 , DDATAEMISS
                 , DDATAEMIS2
                 , DDATEDUE
                 , CPRAZO
                 , NTOTALAMOUNT
                 , NTAXAMOUNT
                 , GDESCINVOICE
                 , CSTATUS
                 , CUSERID
                 , HTIMEST
                 , GREFINV
                 , DPAG
                 , CTIPDOC
                 , CMOEDA
                 , CIMPOSTO
                 , NOTAS
                 , CTIPFAC
                 , NTOTPAG
                 , NTAXPAG
                 , NTOTRET
                 , NTAXRET
                )
                VALUES (
                       :COCD6401-NIDINVOICE
                     , :COCD6401-NSEQ
                     , :COCD6401-NIDPROJECTO
                     , :COCD6401-GCLIENTE
                     , :COCD6401-DDATAINSER
                     , :COCD6401-DDATAEMISS
                     , :COCD6401-DDATAEMIS2
                     , :COCD6401-DDATEDUE
                     , :COCD6401-CPRAZO
                     , :COCD6401-NTOTALAMOUNT
                     , :COCD6401-NTAXAMOUNT
                     , :COCD6401-GDESCINVOICE
                     , :COCD6401-CSTATUS
                     , :COCD6401-CUSERID
                     ,  CURRENT TIMESTAMP
                     , :COCD6401-GREFINV
                     , :COCD6401-DPAG
                     , :COCD6401-CTIPDOC
                     , :COCD6401-CMOEDA
                     , :COCD6401-CIMPOSTO
                     , :COCD6401-NOTAS
                     , :COCD6401-CTIPFAC
                     , :COCD6401-NTOTPAG
                     , :COCD6401-NTAXPAG
                     , :COCD6401-NTOTRET
                     , :COCD6401-NTAXRET
                )
           END-EXEC.

           MOVE CON-COVT6401 TO VIAW0012-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           EVALUATE TRUE
           WHEN DB2-OK
                CONTINUE
           WHEN OTHER
                SET  AQCW0009-RCODE-APL     TO TRUE
                MOVE WS-PROGNAME            TO AQCW0100-PGMNAME
                MOVE VIAL0015-CALLER-ID     TO AQCW0100-PARAGRAPH
                MOVE VIAW0012-TABLE-NAME    TO AQCW0100-NM-ENTIDADE
                MOVE VIAW0012-SQLCODE       TO AQCW0100-SQLCODE
                PERFORM AQCP0100-ESCREVE-MSG
                   THRU AQCP0100-ESCREVE-MSG-EXIT
           END-EVALUATE.

       2900-INSERE-DADOS-EXIT.
           EXIT.

      ******************************************************************
       3000-FIM-PROGRAMA.
      ******************************************************************
           MOVE '3000-FIM-PROGRAMA'         TO VIAL0015-CALLER-ID.

           IF AQCW0100-AT-DEBUG-SIM
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

      * Processos finais
            PERFORM AQCP0009-TRATA-RCODE
               THRU AQCP0009-TRATA-RCODE-EXIT.

            PERFORM AQCP0002-TRATA-SYNCPOINT
               THRU AQCP0002-TRATA-SYNCPOINT-EXIT.

           PERFORM AQCP0100-REG-FIM
              THRU AQCP0100-REG-FIM-EXIT.

       3000-FIM-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
           EXEC SQL INCLUDE AQCP0002 END-EXEC.
      ******************************************************************
           COPY AQCP0009.
           COPY AQCP0109.
           COPY VIAP0011.
           COPY VIAP0012.
           COPY VIAP0015.
      ******************************************************************
