       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI15202.
      ******************************************************************
      *     PROGRAMA COI15202.
      *
      *     Opportunities
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI15202         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD5401 END-EXEC.
           EXEC SQL INCLUDE COCD0606 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV1520.
       COPY COCV1521.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.

      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT0606 PIC X(08) VALUE 'COVT0606'.
           05 CON-COVT5400 PIC X(08) VALUE 'COVT5400'.

       01  WS-VARIAVEIS.
           05 WS-COPPORTUNITY.
             10 WS-CLIENT PIC X(03).
             10 WS-YEAR PIC 9(04).
             10 WS-SEQ   PIC 9(03).

      *--------------------------------------------------------------
       01 WS-SQL-AUXILIARY.
          05 IND-NULL                       PIC S9(04) BINARY.

      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME            PIC  X(08) VALUE 'COI15202'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI15202         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

            EXEC SQL INCLUDE VIAP0009 END-EXEC.

      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV1520-MSG.
           MOVE COCV1520-ASE       TO COCV1521-ASE.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              MOVE 'COCV1520-CANO        ' TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV1520-CANO          TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV1520-ADE       TO COCV1521-ADE.

      *Validacao da chave
           IF COCV1520-CANO < 2008
              MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
              MOVE COCK0002-STATUS-ACTIVO TO COCV1521-COPPORTUNITY-S
              MOVE COCK0001-COPPORTUNITY-N-EXISTS TO
                             COCV1521-COPPORTUNITY-MSG
              MOVE COCK0002-CAPLIC TO COCV1521-COPPORTUNITY-CAPLIC
           END-IF.

      *Validacao da moeda
      *    IF VIAL0002-SEM-ERROS
      *      IF COCV1520-CMOEDA EQUAL SPACES
      *         MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
      *         MOVE COCK0002-STATUS-ACTIVO TO COCV1521-CMOEDA-S
      *         MOVE COCK0001-MOEDA-OBRIGAT TO COCV1521-CMOEDA-MSG
      *         MOVE COCK0002-CAPLIC        TO COCV1521-CMOEDA-CAPLIC
      *      END-IF
      *    END-IF.

           IF VIAL0002-SEM-ERROS
             IF COCV1520-CCLIENT NOT EQUAL SPACES
                PERFORM 2101-VALID-CCLIENT
                   THRU 2101-VALID-CCLIENT-EXIT
             ELSE
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-STATUS-ACTIVO TO COCV1521-CCLIENT-S
               MOVE COCK0001-CCLIENT-N-EXISTS TO
                              COCV1521-CCLIENT-MSG
               MOVE COCK0002-CAPLIC TO COCV1521-CCLIENT-CAPLIC
             END-IF
           END-IF.

      **R  IF WS-SEQ IS NOT NUMERIC
      **R     MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
      **R     MOVE COCK0002-STATUS-ACTIVO TO COCV1521-COPPORTUNITY-S
      **R     MOVE COCK0001-COPPORTUNITY-N-EXISTS TO
      **R                    COCV1521-COPPORTUNITY-MSG
      **R     MOVE COCK0002-CAPLIC TO COCV1521-COPPORTUNITY-CAPLIC
      **R  END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-OBTEM-DADOS
                 THRU 2199-OBTEM-DADOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2101-VALID-CCLIENT
      *--------------------------------------------------------------
       2101-VALID-CCLIENT.

           IF VIAL0001-DEBUG-SIM
              MOVE '2101-VALID-CCLIENT' TO VIAL0015-CALLER-ID
              MOVE 'COCV1520-CCLIENT     ' TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV1520-CCLIENT       TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV1520-CCLIENT TO COCD5401-CSIGLA

           EXEC SQL
                 SELECT CEMPRESA, GMARCA
                 INTO  :COCD5401-CEMPRESA,
                       :COCD5401-GMARCA
                 FROM COVT5401_EMPRESAS
                 WHERE CSIGLA = :COCD5401-CSIGLA
           END-EXEC

           MOVE CON-COVT5400 TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
             IF DB2-OK
               CONTINUE
             ELSE
               IF DB2-NOTFND
                 MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
                 MOVE COCK0002-STATUS-ACTIVO TO COCV1521-CCLIENT-S
                 MOVE COCK0001-CCLIENT-N-EXISTS TO
                                COCV1521-CCLIENT-MSG
                 MOVE COCK0002-CAPLIC TO COCV1521-CCLIENT-CAPLIC
               END-IF
             END-IF
           END-IF.

           MOVE COCD0606-COPPORTUNITY  TO COCV1521-COPPORTUNITY.

       2101-VALID-CCLIENT-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-OBTEM-DADOS
      *--------------------------------------------------------------
       2100-OBTEM-DADOS.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2100-OBTEM-DADOS' TO VIAL0015-CALLER-ID
              MOVE 'COCV1520-CCLIENT     ' TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV1520-CCLIENT       TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

      **R  MOVE COCV1520-COPPORTUNITY
      **R    TO COCD0606-COPPORTUNITY

           MOVE COCV1520-CCLIENT TO WS-CLIENT
           MOVE COCV1520-CANO    TO WS-YEAR
           MOVE ZEROES           TO WS-SEQ

           MOVE WS-COPPORTUNITY TO COCD0606-COPPORTUNITY

           MOVE COCV1520-CCLIENT
             TO COCD0606-CENTITY

           EXEC SQL
                 SELECT MAX (COPPORTUNITY)
                 INTO  :COCD0606-COPPORTUNITY :IND-NULL
                 FROM COVT0606_OPPORTUNITIES
                 WHERE CENTITY      = :COCD0606-CENTITY
                   AND COPPORTUNITY >= :COCD0606-COPPORTUNITY
           END-EXEC


           MOVE CON-COVT0606
             TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0001-DEBUG-SIM
              MOVE '2100-OBTEM-DADOS-EXIT' TO VIAL0015-CALLER-ID
              MOVE 'COCD0606-COPPORTUNITY' TO VIAL0015-CAMPO-NM(1)
              MOVE  COCD0606-COPPORTUNITY  TO VIAL0015-CAMPO-VLR(1)
              MOVE 'SQLCODE              ' TO VIAL0015-CAMPO-NM(2)
              MOVE  SQLCODE                TO VIAL0015-CAMPO-VLR(2)
              MOVE 'COCV1520-CCLIENT     ' TO VIAL0015-CAMPO-NM(3)
              MOVE  COCV1520-CCLIENT       TO VIAL0015-CAMPO-VLR(3)
              MOVE 'COCV1520-CANO        ' TO VIAL0015-CAMPO-NM(4)
              MOVE  COCV1520-CANO          TO VIAL0015-CAMPO-VLR(4)
              MOVE 'IND-NULL             ' TO VIAL0015-CAMPO-NM(5)
              MOVE  IND-NULL               TO VIAL0015-CAMPO-VLR(5)
              MOVE 'WS-COPPORTUNITY      ' TO VIAL0015-CAMPO-NM(6)
              MOVE  WS-COPPORTUNITY        TO VIAL0015-CAMPO-VLR(6)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
             IF DB2-OK
               IF COCD0606-COPPORTUNITY EQUAL SPACES
                 MOVE COCV1520-CANO    TO WS-YEAR
                 MOVE COCV1520-CCLIENT TO WS-CLIENT
                 MOVE ZEROES           TO WS-SEQ
                 MOVE 1                TO WS-SEQ
                 MOVE WS-COPPORTUNITY  TO COCD0606-COPPORTUNITY
               ELSE
                 MOVE COCD0606-COPPORTUNITY TO WS-COPPORTUNITY
                 ADD 1 TO WS-SEQ
                 MOVE WS-COPPORTUNITY TO COCD0606-COPPORTUNITY
               END-IF
             ELSE
               IF DB2-NOTFND
                 MOVE COCV1520-CANO    TO WS-YEAR
                 MOVE COCV1520-CCLIENT TO WS-CLIENT
                 MOVE ZEROES           TO WS-SEQ
                 MOVE 1                TO WS-SEQ
                 MOVE WS-COPPORTUNITY  TO COCD0606-COPPORTUNITY
               END-IF
             END-IF
           END-IF.

           MOVE COCD0606-COPPORTUNITY  TO COCV1521-COPPORTUNITY.

       2199-OBTEM-DADOS-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV1521-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV1521-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV1521-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES
             TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
