       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI15903.
      ******************************************************************
      *     PROGRAMA COI15903.
      *
      *      Browse Opportunities
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI15903         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV1590.
       COPY COCV1591.

      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY TGCL1000.
       COPY TGCL2000.
       COPY TGCK0002.

      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 WS-PROGNAME             PIC X(08) VALUE 'COI15903'.
           05 CON-CTABELA-CEMPRESA    PIC X(05) VALUE 'CO502'.
           05 CON-CTABELA-CSITUACAO   PIC X(05) VALUE 'CO504'.
           05 CON-CTABELA-D-CSITUACAO PIC X(05) VALUE 'CO504'.
           05 CON-CTABELA-D-CENTITY   PIC X(05) VALUE 'CO508'.
           05 CON-CTABELA-D-CMOEDA    PIC X(05) VALUE 'AR041'.
      *--- Mudança do Código de Pais de Numerico para Alfa
      *    05 CON-CTABELA-D-CPAIS     PIC X(05) VALUE 'AR801'.
      *    05 CON-CTABELA-CPAIS       PIC X(05) VALUE 'AR801'.
           05 CON-CTABELA-D-CPAIS     PIC X(05) VALUE 'AR047'.
           05 CON-CTABELA-CPAIS       PIC X(05) VALUE 'AR047'.
           05 CON-CTABELA-D-CEMPRESA  PIC X(05) VALUE 'CO502'.

      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-CTABELA                   PIC X(05) VALUE SPACES.
           05 WS-CCOD                      PIC X(40) VALUE SPACES.
           05 WS-C2COD                     PIC X(40) VALUE SPACES.

      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI15903         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.

           MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV1590-MSG.
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV1591-MSG.
      *    MOVE VIAL0001-MENSAGEM-OUTPUT   TO COCV1591-MSG.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-VAL-CAMPOS
                 THRU 2100-VAL-CAMPOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-VAL-CAMPOS
      *--------------------------------------------------------------
       2100-VAL-CAMPOS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2100-VAL-CAMPOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS AND COCV1590-CEMPRESA NOT EQUAL SPACES
              MOVE CON-CTABELA-CEMPRESA
                TO WS-CTABELA
              MOVE COCV1590-CEMPRESA
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL1000-CCOD-S      TO COCV1591-CEMPRESA-S
                 MOVE TGCL1000-CCOD-CAPLIC TO COCV1591-CEMPRESA-CAPLIC
                 MOVE TGCL1000-CCOD-MSG    TO COCV1591-CEMPRESA-MSG
                 MOVE TGCL1000-GDESC       TO COCV1591-XDESCCEMPRESA
              ELSE
                 MOVE TGCL1000-GDESC       TO COCV1591-XDESCCEMPRESA
              END-IF
           END-IF.

           IF VIAL0002-SEM-ERROS AND COCV1590-CSITUACAO NOT EQUAL SPACES
              MOVE CON-CTABELA-CSITUACAO
                TO WS-CTABELA
              MOVE COCV1590-CSITUACAO
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV1591-CSITUACAO-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV1591-CSITUACAO-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV1591-CSITUACAO-MSG
                 MOVE TGCL2000-GDESC       TO COCV1591-XDESCCSITUACAO
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV1590-XDESCCSITUACAO
              END-IF
           END-IF.

           IF VIAL0002-SEM-ERROS AND COCV1590-CPAIS NOT EQUAL SPACES
              MOVE CON-CTABELA-CPAIS
                TO WS-CTABELA
              MOVE COCV1590-CPAIS
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV1591-CPAIS-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV1591-CPAIS-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV1591-CPAIS-MSG
                 MOVE TGCL2000-GDESC       TO COCV1591-XDESCCPAIS
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV1590-XDESCCPAIS
              END-IF
           END-IF.

      *    IF VIAL0002-SEM-ERROS AND COCV1590-D-CMOEDA NOT EQUAL SPACES
      *       MOVE CON-CTABELA-D-CMOEDA
      *         TO WS-CTABELA
      *       MOVE COCV1590-D-CMOEDA
      *         TO WS-CCOD
      *       MOVE SPACES
      *         TO WS-C2COD
      *       PERFORM 2200-VAL-TAB-ART05
      *          THRU 2200-VAL-TAB-ART05-EXIT
      *       IF NOT VIAL0002-SEM-ERROS
      *          MOVE TGCL2000-CCOD-S      TO COCV1591-D-CMOEDA-S
      *          MOVE TGCL2000-CCOD-CAPLIC TO COCV1591-D-CMOEDA-CAPLIC
      *          MOVE TGCL2000-CCOD-MSG    TO COCV1591-D-CMOEDA-MSG
      *          MOVE TGCL2000-GDESC       TO COCV1591-XDESCD-CMOEDA
      *       ELSE
      *          MOVE TGCL2000-GDESC       TO COCV1590-XDESCD-CMOEDA
      *       END-IF
      *    END-IF.

      *    IF VIAL0002-SEM-ERROS AND COCV1590-D-CPAIS NOT EQUAL SPACES
      *       MOVE CON-CTABELA-D-CPA
      *         TO WS-CTABELA
      *       MOVE COCV1590-D-CPAIS
      *         TO WS-CCOD
      *       MOVE SPACES
      *         TO WS-C2COD
      *       PERFORM 2200-VAL-TAB-ART05
      *          THRU 2200-VAL-TAB-ART05-EXIT
      *       IF NOT VIAL0002-SEM-ERROS
      *          MOVE TGCL2000-CCOD-S      TO COCV1591-D-CPAIS-S
      *          MOVE TGCL2000-CCOD-CAPLIC TO COCV1591-D-CPAIS-CAPLIC
      *          MOVE TGCL2000-CCOD-MSG    TO COCV1591-D-CPAIS-MSG
      *          MOVE TGCL2000-GDESC       TO COCV1591-XDESCD-CPAIS
      *       ELSE
      *          MOVE TGCL2000-GDESC       TO COCV1590-XDESCD-CPAIS
      *       END-IF
      *    END-IF.

       2100-VAL-CAMPOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2200-VAL-TAB-ART05
      *--------------------------------------------------------------
       2200-VAL-TAB-ART05.

           IF VIAL0001-DEBUG-SIM
              MOVE '2200-VAL-TAB-ART05-EXIT' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE TGCL2000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL2000-CTABELA
           MOVE WS-CCOD                   TO TGCL2000-CCOD
           MOVE WS-C2COD                  TO TGCL2000-C2COD

           PERFORM CALL-TGCP2000
              THRU CALL-TGCP2000-EXIT.

       2200-VAL-TAB-ART05-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2300-VAL-TAB-OUTRA
      *--------------------------------------------------------------
       2300-VAL-TAB-OUTRA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2300-VAL-TAB-OUTRA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE TGCL1000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL1000-CTABELA
           MOVE WS-CCOD                   TO TGCL1000-CCOD
           MOVE WS-C2COD                  TO TGCL1000-C2COD
		
           PERFORM CALL-TGCP1000
              THRU CALL-TGCP1000-EXIT.

       2300-VAL-TAB-OUTRA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV1591-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV1590-MSG               TO VIAL0001-MENSAGEM-INPUT.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *==============================================================
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY TGCP1000.
           COPY TGCP2000.
