       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI15104.
      ******************************************************************
      *     PROGRAMA COI15104.                                    *
      *                                                                *
      *     Opportunities
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI15104         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD0606 END-EXEC.
           EXEC SQL INCLUDE COCD3605 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
       01 WS-SQL-AUXILIARY.
         05 IND-NULL                       PIC S9(04) BINARY.

      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV1510.
       COPY COCV1511.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0010.
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.
       COPY ETCL0002.
      *
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT0606 PIC X(08) VALUE 'COVT0606'.
           05 CON-COVT3605 PIC X(08) VALUE 'COVT3605'.
           05 CON-OG       PIC X(02) VALUE 'OG'.
           05 CON-PP       PIC X(02) VALUE 'PP'.
           05 CON-100      PIC X(03) VALUE '100'.
           05 CON-0        PIC X(02) VALUE '00'.

      *--------------------------------------------------------------
      * PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME     PIC  X(08) VALUE 'COI15104'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI15104         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV1510-MSG.
           MOVE COCV1510-ASE               TO COCV1511-ASE.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV1510-ADE               TO COCV1511-ADE.

           PERFORM 2100-VALIDACOES
              THRU 2199-VALIDACOES-EXIT

           IF VIAL0002-SEM-ERROS
              PERFORM 2200-INSERE-DADOS
                 THRU 2299-INSERE-DADOS-EXIT
           END-iF
           .
       2099-PROC-PROGRAMA-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2100-VALIDACOES
      *--------------------------------------------------------------
       2100-VALIDACOES.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2100-VALIDACOES' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF COCV1510-CPROJECT NOT EQUAL SPACES
             PERFORM 2110-VALIDA-PROJECT
                THRU 2110-VALIDA-PROJECT-EXIT
           END-IF.

       2199-VALIDACOES-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2110-VALIDA-PROJECT
      *--------------------------------------------------------------
       2110-VALIDA-PROJECT.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2110-VALIDA-PROJECT' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV1510-CPROJECT          TO COCD3605-NIDPROJECTO.
           MOVE COCK0002-NAO               TO COCD3605-ICTACUST

           EXEC SQL
                 SELECT
                       NIDPROJECTO
                 INTO
                       :COCD3605-NIDPROJECTO
                 FROM COVT3605_PROJECTS
                 WHERE NIDPROJECTO = :COCD3605-NIDPROJECTO
                   AND ICTACUST    = :COCD3605-ICTACUST
           END-EXEC

           MOVE CON-COVT3605
             TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF DB2-OK
              CONTINUE
           ELSE
              MOVE VIAK0002-ERROS-FUNCAO
                TO VIAL0002-IND-ERROS
              MOVE COCK0002-STATUS-ACTIVO
                TO COCV1511-CPROJECT-S
              MOVE COCK0001-PROJ-NAO-EXIST
                TO COCV1511-CPROJECT-MSG
              MOVE COCK0002-CAPLIC
                TO COCV1511-CPROJECT-CAPLIC
           END-IF.

       2110-VALIDA-PROJECT-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2200-INSERE-DADOS
      *--------------------------------------------------------------
       2200-INSERE-DADOS.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2200-INSERE-DADOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV1510-COPPORTUNITY
             TO COCD0606-COPPORTUNITY
           MOVE COCV1510-CPROJECT
             TO COCD0606-CPROJECT
           MOVE COCV1510-NVALOR
             TO COCD0606-NVALOR
      **R
      *    MOVE ZEROES TO COCV1510-NPROB
      **R
      *    MOVE COCV1510-NPROB
      *      TO COCD0606-NPROB

      *--- Se Situação ganha (OG)   move 100%
      *--- Se Situação perdida (PP) move 0%
           IF COCV1510-CSITUACAO EQUAL CON-OG
              MOVE CON-100           TO COCD0606-NPROB
           ELSE
              IF COCV1510-CSITUACAO EQUAL CON-PP
                 MOVE CON-0          TO COCD0606-NPROB
              ELSE
                 MOVE COCV1510-NPROB TO COCD0606-NPROB
              END-IF
           END-IF.
      *
           MOVE COCV1510-TOPPORTUNITY
             TO COCD0606-TOPPORTUNITY
           MOVE COCV1510-DOPPORTUNITY
             TO COCD0606-DOPPORTUNITY
           MOVE COCV1510-DTENV
             TO COCD0606-DTENV
           MOVE COCV1510-CSITUACAO
             TO COCD0606-CSITUACAO
           MOVE COCV1510-GJUSTPERD
             TO COCD0606-GJUSTPERD
           MOVE VIAL0001-DATA-PROCESSO-I
             TO COCD0606-DALTSTAT
           MOVE COCV1510-CMOEDA
             TO COCD0606-CMOEDA
           MOVE COCV1510-CPAIS
             TO COCD0606-CPAIS
           MOVE COCV1510-CEMPRESA
             TO COCD0606-CEMPRESA
           MOVE COCV1510-DREGISTO
             TO COCD0606-DREGISTO
           MOVE COCV1510-DCONCL
             TO COCD0606-DCONCL
           MOVE VIAL0001-CUTILIZA-I
             TO COCD0606-CUSERID


           IF VIAL0002-SEM-ERROS

           EXEC SQL
                 INSERT INTO
                COVT0606_OPPORTUNITIES
                (
                   COPPORTUNITY
                 , CPROJECT
                 , NVALOR
                 , NPROB
                 , TOPPORTUNITY
                 , DOPPORTUNITY
                 , DTENV
                 , CSITUACAO
                 , GJUSTPERD
                 , DALTSTAT
                 , CUSERID
                 , HTIMEST
                 , CMOEDA
                 , CPAIS
                 , CEMPRESA
                 , DREGISTO
                 , DCONCL
                )
                VALUES (
                       :COCD0606-COPPORTUNITY
                     , :COCD0606-CPROJECT
                     , :COCD0606-NVALOR
                     , :COCD0606-NPROB
                     , :COCD0606-TOPPORTUNITY
                     , :COCD0606-DOPPORTUNITY
                     , :COCD0606-DTENV
                     , :COCD0606-CSITUACAO
                     , :COCD0606-GJUSTPERD
                     , :COCD0606-DALTSTAT
                     , :COCD0606-CUSERID
                     , CURRENT TIMESTAMP
                     , :COCD0606-CMOEDA
                     , :COCD0606-CPAIS
                     , :COCD0606-CEMPRESA
                     , :COCD0606-DREGISTO
                     , :COCD0606-DCONCL
                )
           END-EXEC


              MOVE CON-COVT0606               TO VIAL0002-TABLE-NAME

              PERFORM 9020-DB2CHECK
                 THRU 9029-DB2CHECK-EXIT

              IF VIAL0002-SEM-ERROS
                 IF DB2-DUPREC
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                      MOVE COCK0002-STATUS-ACTIVO
                        TO COCV1511-COPPORTUNITY-S
                      MOVE COCK0001-COPPORTUNITY-A-EXISTS
                        TO COCV1511-COPPORTUNITY-MSG
                      MOVE COCK0002-CAPLIC
                        TO COCV1511-COPPORTUNITY-CAPLIC
                 ELSE
                    IF NOT DB2-OK
                       MOVE VIAK0002-ABEND-DB2
                         TO VIAL0002-IND-ERROS
                       MOVE VIAK0001-ERRO-DB2
                         TO VIAL0002-COD-ERRO-GRAVE
                    END-IF
                 END-IF
              END-IF
           END-IF

           IF VIAL0002-SEM-ERROS
                        CONTINUE
           END-IF
           .

       2299-INSERE-DADOS-EXIT.
           EXIT.


      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV1511-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV1511-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV1511-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES
             TO VIAL0001-OCORRENCIAS.


       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0010.
           COPY VIAP0016.
