       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI11106.
      ******************************************************************
      *     PROGRAMA COI11106.                                         *
      *                                                                *
      *     Contactos
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI11106         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD0201 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV1110.
       COPY COCV1111.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0010.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.
      *
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT0201 PIC X(08) VALUE 'COVT0201'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI11106         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV1110-MSG.
           MOVE COCV1110-ASE               TO COCV1111-ASE.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           MOVE COCV1110-ADE               TO COCV1111-ADE.

           PERFORM 2100-VALIDACOES
              THRU 2199-VALIDACOES-EXIT

           IF VIAL0002-SEM-ERROS
              PERFORM 2200-MODIFICA-DADOS
                 THRU 2299-MODIFICA-DADOS-EXIT
           END-IF
           .
       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-VALIDACOES
      *--------------------------------------------------------------
       2100-VALIDACOES.



           CONTINUE
           .

       2199-VALIDACOES-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2200-MODIFICA-DADOS
      *--------------------------------------------------------------
       2200-MODIFICA-DADOS.

           MOVE COCV1110-CCONTACT
             TO COCD0201-CCONTACT
           MOVE COCV1110-CENTITY
             TO COCD0201-CENTITY
           MOVE COCV1110-GNOME
             TO COCD0201-GNOME
           MOVE COCV1110-GNOMFIRST
             TO COCD0201-GNOMFIRST
           MOVE COCV1110-GNOMLAST
             TO COCD0201-GNOMLAST
           MOVE COCV1110-CCONTACTTYPE
             TO COCD0201-CCONTACTTYPE
           MOVE COCV1110-GEMAIL
             TO COCD0201-GEMAIL
           MOVE COCV1110-GTELEF
             TO COCD0201-GTELEF
           MOVE COCV1110-GTELEMOVEL
             TO COCD0201-GTELEMOVEL
           MOVE COCV1110-GFAX
             TO COCD0201-GFAX
           MOVE COCV1110-CDEPARTMENT
             TO COCD0201-CDEPARTMENT
           MOVE COCV1110-CFUNCTION
             TO COCD0201-CFUNCTION
           MOVE COCV1110-GOBSERV
             TO COCD0201-GOBSERV
           MOVE COCV1110-CRESPVIA
             TO COCD0201-CRESPVIA
           MOVE COCV1110-CCONTACTASSI
             TO COCD0201-CCONTACTASSI
           MOVE COCV1110-IEXCLUDE
             TO COCD0201-IEXCLUDE
           MOVE COCV1110-DEXCLUDE
             TO COCD0201-DEXCLUDE
           MOVE COCV1110-CLIST
             TO COCD0201-CLIST
           MOVE COCV1110-CLINK
             TO COCD0201-CLINK
           MOVE COCV1110-NSEQUENCE
             TO COCD0201-NSEQUENCE
           MOVE VIAL0001-CUTILIZA-I
             TO COCD0201-CUSERID

           EXEC SQL
                 UPDATE
                COVT0201_CONTACTS
                SET
                       CCONTACT = :COCD0201-CCONTACT
                     , CENTITY = :COCD0201-CENTITY
                     , GNOME       = :COCD0201-GNOME
                     , GNOMFIRST   = :COCD0201-GNOMFIRST
                     , GNOMLAST    = :COCD0201-GNOMLAST
                     , CCONTACTTYPE = :COCD0201-CCONTACTTYPE
                     , GEMAIL = :COCD0201-GEMAIL
                     , GTELEF = :COCD0201-GTELEF
                     , GTELEMOVEL = :COCD0201-GTELEMOVEL
                     , GFAX = :COCD0201-GFAX
                     , CDEPARTMENT = :COCD0201-CDEPARTMENT
                     , CFUNCTION = :COCD0201-CFUNCTION
                     , GOBSERV = :COCD0201-GOBSERV
                     , CRESPVIA = :COCD0201-CRESPVIA
                     , CCONTACTASSI = :COCD0201-CCONTACTASSI
                     , IEXCLUDE = :COCD0201-IEXCLUDE
                     , DEXCLUDE = :COCD0201-DEXCLUDE
                     , CLIST = :COCD0201-CLIST
                     , CLINK = :COCD0201-CLINK
                     , NSEQUENCE = :COCD0201-NSEQUENCE
                     , HTIMEST = CURRENT TIMESTAMP
                 WHERE
                    CCONTACT = :COCD0201-CCONTACT
           END-EXEC


           MOVE CON-COVT0201               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
              IF DB2-NOTFND
                 MOVE VIAK0002-ERROS-FUNCAO
                   TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV1111-CCONTACT-S
                    MOVE COCK0001-CCONTACT-N-EXISTS
                      TO COCV1111-CCONTACT-MSG
              ELSE
                 IF NOT DB2-OK
                    MOVE VIAK0002-ABEND-DB2
                      TO VIAL0002-IND-ERROS
                    MOVE VIAK0001-ERRO-DB2
                      TO VIAL0002-COD-ERRO-GRAVE
                 END-IF
              END-IF
           ELSE
              MOVE VIAK0002-ABEND-DB2
                TO VIAL0002-IND-ERROS
              MOVE VIAK0001-ERRO-DB2
                TO VIAL0002-COD-ERRO-GRAVE
           END-IF


           IF VIAL0002-SEM-ERROS
                        CONTINUE
           END-IF
           .

       2299-MODIFICA-DADOS-EXIT.
           EXIT.


      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           MOVE COCV1111-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV1111-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV1111-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES
             TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0010.
