       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI10408.
      ******************************************************************
      *     PROGRAMA COI10408.                                         *
      *                                                                *
      *     Desaprovação Ausências
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI10408         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD7601 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
       01 WS-SQL-AUXILIARY.
         05 IND-NULL                       PIC S9(04) BINARY.

      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV1040.
       COPY COCV1041.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0010.
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.
       COPY TGCL2000.
       COPY EXCL0200.
       COPY ETCL0002.
      *
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT7601 PIC X(08) VALUE 'COVT7601'.
           05 CON-CTABELA-CPAIS  PIC X(05) VALUE 'AR047'.
           05 CON-CTABELA-LNEG   PIC X(05) VALUE 'CO702'.
           05 CON-MANUAL   PIC X(06) VALUE 'MANUAL'.
           05 CON-IN       PIC X(02) VALUE 'IN'.
           05 CON-AP       PIC X(02) VALUE 'AP'.
           05 CON-01       PIC X(02) VALUE '01'.
           05 CON-8        PIC 9(01) VALUE 8.
           05 CON-SEP      PIC X(01) VALUE '-'.

      *--------------------------------------------------------------
      * PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME     PIC  X(08) VALUE 'COI10408'.
           05 WS-NIDPROJECTO       PIC X(10) VALUE SPACES.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI10408         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV1040-MSG.
           MOVE COCV1040-ASE               TO COCV1041-ASE.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV1040-ADE               TO COCV1041-ADE.

           PERFORM 2100-VALIDACOES
              THRU 2199-VALIDACOES-EXIT.

      *--- Desaprova dados occ 01
           IF  VIAL0002-SEM-ERROS
           AND COCV1040-NIDPROJECTO1 NOT = SPACES
           AND COCV1040-CSITU1           = CON-AP
               MOVE CON-IN                TO COCV1041-CSITU1
               MOVE COCV1040-NIDPROJECTO1 TO WS-NIDPROJECTO
               PERFORM 2150-DESAPROVA-DADOS
                  THRU 2150-DESAPROVA-DADOS-EXIT
           END-IF.
      *--- Desaprova dados occ 02
           IF  VIAL0002-SEM-ERROS
           AND COCV1040-NIDPROJECTO2 NOT = SPACES
           AND COCV1040-CSITU2           = CON-AP
               MOVE COCV1040-NIDPROJECTO2 TO WS-NIDPROJECTO
               MOVE CON-IN                TO COCV1041-CSITU2
               PERFORM 2150-DESAPROVA-DADOS
                  THRU 2150-DESAPROVA-DADOS-EXIT
           END-IF.
      *--- Desaprova dados occ 03
           IF  VIAL0002-SEM-ERROS
           AND COCV1040-NIDPROJECTO3 NOT = SPACES
           AND COCV1040-CSITU3           = CON-AP
               MOVE COCV1040-NIDPROJECTO3 TO WS-NIDPROJECTO
               MOVE CON-IN                TO COCV1041-CSITU3
               PERFORM 2150-DESAPROVA-DADOS
                  THRU 2150-DESAPROVA-DADOS-EXIT
           END-IF.
      *--- Desaprova dados occ 04
           IF  VIAL0002-SEM-ERROS
           AND COCV1040-NIDPROJECTO4 NOT = SPACES
           AND COCV1040-CSITU4           = CON-AP
               MOVE COCV1040-NIDPROJECTO4 TO WS-NIDPROJECTO
               MOVE CON-IN                TO COCV1041-CSITU4
               PERFORM 2150-DESAPROVA-DADOS
                  THRU 2150-DESAPROVA-DADOS-EXIT
           END-IF.
      *--- Desaprova dados occ 05
           IF  VIAL0002-SEM-ERROS
           AND COCV1040-NIDPROJECTO5 NOT = SPACES
           AND COCV1040-CSITU5           = CON-AP
               MOVE COCV1040-NIDPROJECTO5 TO WS-NIDPROJECTO
               MOVE CON-IN                TO COCV1041-CSITU5
               PERFORM 2150-DESAPROVA-DADOS
                  THRU 2150-DESAPROVA-DADOS-EXIT
           END-IF.
      *--- Desaprova dados occ 06
           IF  VIAL0002-SEM-ERROS
           AND COCV1040-NIDPROJECTO6 NOT = SPACES
           AND COCV1040-CSITU6           = CON-AP
               MOVE COCV1040-NIDPROJECTO6 TO WS-NIDPROJECTO
               MOVE CON-IN                TO COCV1041-CSITU6
               PERFORM 2150-DESAPROVA-DADOS
                  THRU 2150-DESAPROVA-DADOS-EXIT
           END-IF.
      *--- Desaprova dados occ 07
           IF  VIAL0002-SEM-ERROS
           AND COCV1040-NIDPROJECTO7 NOT = SPACES
           AND COCV1040-CSITU7           = CON-AP
               MOVE COCV1040-NIDPROJECTO7 TO WS-NIDPROJECTO
               MOVE CON-IN                TO COCV1041-CSITU7
               PERFORM 2150-DESAPROVA-DADOS
                  THRU 2150-DESAPROVA-DADOS-EXIT
           END-IF.
      *--- Desaprova dados occ 08
           IF  VIAL0002-SEM-ERROS
           AND COCV1040-NIDPROJECTO8 NOT = SPACES
           AND COCV1040-CSITU8           = CON-AP
               MOVE COCV1040-NIDPROJECTO8 TO WS-NIDPROJECTO
               MOVE CON-IN                TO COCV1041-CSITU8
               PERFORM 2150-DESAPROVA-DADOS
                  THRU 2150-DESAPROVA-DADOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2100-VALIDACOES
      *--------------------------------------------------------------
       2100-VALIDACOES.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2100-VALIDACOES' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.


       2199-VALIDACOES-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2150-DESAPROVA-DADOS
      *--------------------------------------------------------------
       2150-DESAPROVA-DADOS.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2150-DESAPROVA-DADOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV1040-CIDEMP        TO COCD7601-CIDEMP.
           MOVE COCV1040-DDATAUS       TO COCD7601-DDATAUS.
           MOVE WS-NIDPROJECTO         TO COCD7601-NIDPROJECTO.
           MOVE SPACES                 TO COCD7601-CUSERAPR.
           MOVE COCK0002-DATA-MIN      TO COCD7601-DDATAPR.


           EXEC SQL
                UPDATE COVT7601

                SET    CSITU      = :CON-IN
                     , CUSERAPR   = :COCD7601-CUSERAPR
                     , DDATAPR    = :COCD7601-DDATAPR

                WHERE CIDEMP      = :COCD7601-CIDEMP
                AND   DDATAUS     = :COCD7601-DDATAUS
                AND   NIDPROJECTO = :COCD7601-NIDPROJECTO
           END-EXEC

           MOVE CON-COVT7601     TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
              IF DB2-NOTFND
                 MOVE VIAK0002-ERROS-FUNCAO
                   TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV1041-CIDEMP-S
                    MOVE COCK0001-CIDEMP-N-EXISTS
                      TO COCV1041-CIDEMP-MSG
              ELSE
                 IF NOT DB2-OK
                    MOVE VIAK0002-ABEND-DB2
                      TO VIAL0002-IND-ERROS
                    MOVE VIAK0001-ERRO-DB2
                      TO VIAL0002-COD-ERRO-GRAVE
                 END-IF
              END-IF
           ELSE
              MOVE VIAK0002-ABEND-DB2
                TO VIAL0002-IND-ERROS
              MOVE VIAK0001-ERRO-DB2
                TO VIAL0002-COD-ERRO-GRAVE
           END-IF.


       2150-DESAPROVA-DADOS-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV1041-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV1041-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV1041-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES
             TO VIAL0001-OCORRENCIAS.


       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0010.
           COPY VIAP0016.
           COPY TGCP2000.
           COPY EXCP0200.
