       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI44900.
      ******************************************************************
      *     PROGRAMA COI44900.                                         *
      *                                                                *
      *     Browse Projects                                            *
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI44900         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD3605 END-EXEC.
           EXEC SQL INCLUDE COCD0601 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV4490.
       COPY COCV4491.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.

       COPY ARCL0039.
       COPY ETCL0002.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-CLIENTE-MIN             PIC X(03) VALUE SPACES.
           05 WS-CLIENTE-MAX             PIC X(03) VALUE SPACES.
           05 WS-NIDPROJECTO-MIN         PIC X(08) VALUE SPACES.
           05 WS-NIDPROJECTO-MAX         PIC X(08) VALUE SPACES.
           05 WS-BACTIVE-MIN             PIC X(01) VALUE SPACES.
           05 WS-BACTIVE-MAX             PIC X(01) VALUE SPACES.
           05 WS-PAIS-MIN                PIC X(03) VALUE SPACES.
           05 WS-PAIS-MAX                PIC X(03) VALUE SPACES.
           05 WS-DBEGINDATE-MIN          PIC X(10) VALUE SPACES.
           05 WS-DBEGINDATE-MAX          PIC X(10) VALUE SPACES.

           05 WS-DATA-MIN                PIC X(10) VALUE '0001-01-01'.
           05 WS-DATA-MAX                PIC X(10) VALUE '9999-12-31'.
      *--- Chave para documentos ("PRJ", NIDPROJECTO)
      *    05 WS-CCHAVE.
      *       10 WS-CCHAVE-01            PIC X(03).
      *       10 WS-CCHAVE-02            PIC X(08).
      *--- Chave para documentos (NIDPROJECTO)
           05 WS-CCHAVE.
              10 WS-CCHAVE-01            PIC X(08).
      *--------------------------------------------------------------
      *            SWITCH
      *--------------------------------------------------------------
       01  SW-SWITCH.
           05 SW-CURSOR                  PIC X(01) VALUE SPACES.
              88 SW-CURSOR-NONE                    VALUE '0'.
              88 SW-CURSOR-1                       VALUE '1'.
              88 SW-CURSOR-2                       VALUE '2'.
              88 SW-CURSOR-3                       VALUE '3'.
              88 SW-CURSOR-4                       VALUE '3'.
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT3605 PIC X(08) VALUE 'COVT3605'.
           05 CON-COVT0601 PIC X(08) VALUE 'COVT0601'.
           05 CON-PRJ      PIC X(03) VALUE 'PRJ'.

      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME     PIC  X(08) VALUE 'COI44900'.

      *--------------------------------------------------------------
      *              DECLARACOES DE CURSORES DB2                     *
      *--------------------------------------------------------------
       01  WS-CURSOR-VARS.
           05 FILLER                     PIC X(01) VALUE SPACES.
           EXEC SQL
                DECLARE CURCOT01 CURSOR FOR
                SELECT
                       NIDPROJECTO
                     , CPROJECT
                     , GDESCPROJECT
                     , DBEGINDATE
                     , DENDDATE
                     , NPERCENTALERT
                     , DALERTDATE
                     , CMOEDA
                     , BACTIVE
                     , NBUDGET
                     , PAIS
                     , CLIENTE
                     , LINHANEG
                     , RESPONS
                     , IPROJI
                     , IPROJE
                     , IACHORAS
                     , IADESPESAS
                     , TPPFAT
                     , CUSERID
                     , HTIMEST
                     , TIPONEG
                 FROM COVT3605_PROJECTS
                 WHERE   ICTACUST    =  :COCD3605-ICTACUST
                    AND  BACTIVE     >= :WS-BACTIVE-MIN
                    AND  BACTIVE     <= :WS-BACTIVE-MAX
                    AND  CLIENTE     >= :WS-CLIENTE-MIN
                    AND  CLIENTE     <= :WS-CLIENTE-MAX
                    AND  NIDPROJECTO >= :WS-NIDPROJECTO-MIN
                    AND  NIDPROJECTO <= :WS-NIDPROJECTO-MAX
                    AND  PAIS        >= :WS-PAIS-MIN
                    AND  PAIS        <= :WS-PAIS-MAX
                    AND  DBEGINDATE  >= :WS-DBEGINDATE-MIN
                    AND  DBEGINDATE  <= :WS-DBEGINDATE-MAX

                    AND (CLIENTE     >  :COCD3605-CLIENTE

                     OR (CLIENTE     =  :COCD3605-CLIENTE
                    AND  NIDPROJECTO >= :COCD3605-NIDPROJECTO))
                 ORDER BY CLIENTE,
                          NIDPROJECTO
           END-EXEC.

      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI44900         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

            EXEC SQL INCLUDE VIAP0009 END-EXEC.

      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV4490-MSG.
           MOVE COCV4490-ASE               TO COCV4491-ASE.
           MOVE CON-PRJ                    TO COCV4490-CFAMCON.
           MOVE CON-PRJ                    TO COCV4491-CFAMCON.

           MOVE ZEROES                     TO COCV4491-INDICE.

           PERFORM 1100-LIMPA-OCCURS
              THRU 1199-LIMPA-OCCURS-EXIT
                UNTIL COCV4491-PAGINA-CHEIA.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            1100-LIMPA-OCCURS
      *--------------------------------------------------------------
       1100-LIMPA-OCCURS.

           ADD 1                       TO COCV4491-INDICE.

           MOVE SPACES TO COCV4491-D-CLIENTE(COCV4491-INDICE)
                          COCV4491-D-NIDPROJECTO(COCV4491-INDICE)
                          COCV4491-D-NIDPROJECTOAUX(COCV4491-INDICE)
                          COCV4491-D-COPPORTUNITY(COCV4491-INDICE)
                          COCV4491-D-BACTIVE(COCV4491-INDICE)
                          COCV4491-D-NBUDGET(COCV4491-INDICE)
                          COCV4491-D-CMOEDA(COCV4491-INDICE)
                          COCV4491-D-PAIS(COCV4491-INDICE)
                          COCV4491-D-LINHANEG(COCV4491-INDICE)
                          COCV4491-D-TIPONEG(COCV4491-INDICE)
                          COCV4491-D-RESPONS(COCV4491-INDICE)
                          COCV4491-D-IPROJI(COCV4491-INDICE)
                          COCV4491-D-IPROJE(COCV4491-INDICE)
                          COCV4491-D-IACHORAS(COCV4491-INDICE)
                          COCV4491-D-IADESPESAS(COCV4491-INDICE).

           MOVE VIAK0002-DATA-MINIMA
             TO COCV4491-D-DBEGINDATE(COCV4491-INDICE)
                COCV4491-D-DENDDATE(COCV4491-INDICE).

       1199-LIMPA-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV4490-CLIENTE     TO COCV4491-CLIENTE.
           MOVE COCV4490-NIDPROJECTO TO COCV4491-NIDPROJECTO.
           MOVE COCV4490-BACTIVE     TO COCV4491-BACTIVE.
           MOVE COCV4490-PAIS        TO COCV4491-PAIS.
           MOVE COCV4490-DBEGINDATE  TO COCV4491-DBEGINDATE.

           PERFORM 2010-VALIDACOES
              THRU 2019-VALIDACOES-EXIT.

           IF VIAL0002-SEM-ERROS
              PERFORM 2020-OPEN
                 THRU 2029-OPEN-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2030-FETCH
                 THRU 2039-FETCH-EXIT

              IF VIAL0002-SEM-ERROS
                 IF DB2-OK
                    PERFORM 2040-CONTINUA
                       THRU 2049-CONTINUA-EXIT
                 ELSE
                    COMPUTE COCV4491-DIMINUI-LENGTH EQUAL
                         COCV4491-INDICE-INVERSO * COCV4491-LENGTH-OCCUR
                    COMPUTE COCV4491-LENGTH EQUAL COCV4491-LENGTH
                         - COCV4491-DIMINUI-LENGTH
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV4491-NIDPROJECTO-S
                    MOVE COCK0001-NIDPROJECTO-N-EXISTS
                      TO COCV4491-NIDPROJECTO-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV4491-NIDPROJECTO-CAPLIC
                 END-IF
              END-IF
              PERFORM 2070-CLOSE
                 THRU 2079-CLOSE-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2010-VALIDACOES
      *--------------------------------------------------------------
       2010-VALIDACOES.

           IF VIAL0001-DEBUG-SIM
              MOVE '2010-VALIDACOES' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

       2019-VALIDACOES-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2020-OPEN
      *--------------------------------------------------------------
       2020-OPEN.

           IF VIAL0001-DEBUG-SIM
              MOVE '2020-OPEN' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCK0002-NAO          TO COCD3605-ICTACUST

           IF COCV4490-CLIENTE     NOT EQUAL SPACES
              MOVE COCV4490-CLIENTE     TO WS-CLIENTE-MIN
                                           WS-CLIENTE-MAX
           ELSE
              MOVE ALL ' '              TO WS-CLIENTE-MIN
              MOVE ALL '9'              TO WS-CLIENTE-MAX
           END-IF

           IF COCV4490-NIDPROJECTO NOT EQUAL SPACES
              MOVE COCV4490-NIDPROJECTO TO WS-NIDPROJECTO-MIN
                                           WS-NIDPROJECTO-MAX
           ELSE
              MOVE ALL ' '              TO WS-NIDPROJECTO-MIN
              MOVE ALL '9'              TO WS-NIDPROJECTO-MAX
           END-IF.

           IF COCV4490-BACTIVE     NOT EQUAL SPACES
              MOVE COCV4490-BACTIVE     TO WS-BACTIVE-MIN
                                           WS-BACTIVE-MAX
           ELSE
              MOVE ALL ' '              TO WS-BACTIVE-MIN
              MOVE ALL '9'              TO WS-BACTIVE-MAX
           END-IF.

           IF COCV4490-PAIS        NOT EQUAL SPACES
              MOVE COCV4490-PAIS        TO WS-PAIS-MIN
                                           WS-PAIS-MAX
           ELSE
              MOVE ALL ' '              TO WS-PAIS-MIN
              MOVE ALL '9'              TO WS-PAIS-MAX
           END-IF.

           IF COCV4490-DBEGINDATE  NOT EQUAL SPACES
              MOVE COCV4490-DBEGINDATE  TO WS-DBEGINDATE-MIN
              MOVE WS-DATA-MAX          TO WS-DBEGINDATE-MAX
           ELSE
              MOVE WS-DATA-MIN          TO WS-DBEGINDATE-MIN
              MOVE WS-DATA-MAX          TO WS-DBEGINDATE-MAX
           END-IF.

           MOVE COCV4490-NIDPROJECTOPAG TO COCD3605-NIDPROJECTO
           MOVE COCV4490-CLIENTEPAG     TO COCD3605-CLIENTE

           EXEC SQL
               OPEN CURCOT01
           END-EXEC

           MOVE CON-COVT3605               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       2029-OPEN-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2030-FETCH
      *--------------------------------------------------------------
       2030-FETCH.

           IF VIAL0001-DEBUG-SIM
              MOVE '2030-FETCH' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
              FETCH  CURCOT01
               INTO
                    :COCD3605-NIDPROJECTO
                  , :COCD3605-CPROJECT
                  , :COCD3605-GDESCPROJECT
                  , :COCD3605-DBEGINDATE
                  , :COCD3605-DENDDATE
                  , :COCD3605-NPERCENTALERT
                  , :COCD3605-DALERTDATE
                  , :COCD3605-CMOEDA
                  , :COCD3605-BACTIVE
                  , :COCD3605-NBUDGET
                  , :COCD3605-PAIS
                  , :COCD3605-CLIENTE
                  , :COCD3605-LINHANEG
                  , :COCD3605-RESPONS
                  , :COCD3605-IPROJI
                  , :COCD3605-IPROJE
                  , :COCD3605-IACHORAS
                  , :COCD3605-IADESPESAS
                  , :COCD3605-TPPFAT
                  , :COCD3605-CUSERID
                  , :COCD3605-HTIMEST
                  , :COCD3605-TIPONEG
           END-EXEC.


           MOVE CON-COVT3605               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       2039-FETCH-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                       2040-CONTINUA
      *--------------------------------------------------------------
       2040-CONTINUA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2040-CONTINUA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ZEROES                     TO COCV4491-INDICE.
           PERFORM 2050-TRATA-OCCURS
              THRU 2059-TRATA-OCCURS-EXIT
             UNTIL NOT DB2-OK
                OR COCV4491-PAGINA-CHEIA
                OR NOT VIAL0002-SEM-ERROS.

           IF VIAL0002-SEM-ERROS
              IF NOT COCV4491-PAGINA-CHEIA
                    COMPUTE COCV4491-INDICE-INVERSO EQUAL
                         COCV4491-INDICE-INVERSO - COCV4491-INDICE
                    COMPUTE COCV4491-DIMINUI-LENGTH EQUAL
                         COCV4491-INDICE-INVERSO * COCV4491-LENGTH-OCCUR
                    COMPUTE COCV4491-LENGTH EQUAL COCV4491-LENGTH -
                         COCV4491-DIMINUI-LENGTH
                    SET  VIAL0002-FIM-CONSULTA TO TRUE
              END-IF
              IF DB2-NOTFND
                    SET  VIAL0002-FIM-CONSULTA TO TRUE
              END-IF
           END-IF.

       2049-CONTINUA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2050-TRATA-OCCURS
      *--------------------------------------------------------------
       2050-TRATA-OCCURS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2050-TRATA-OCCURS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           ADD 1                       TO COCV4491-INDICE.
           MOVE COCD3605-NIDPROJECTO
             TO COCV4491-D-NIDPROJECTO(COCV4491-INDICE).
      *
      *    MOVE CON-PRJ
      *      TO WS-CCHAVE-01.
           MOVE COCD3605-NIDPROJECTO
             TO WS-CCHAVE-01.
           MOVE WS-CCHAVE
             TO COCV4491-D-NIDPROJECTOAUX(COCV4491-INDICE).
      *
           MOVE COCD3605-DBEGINDATE
             TO COCV4491-D-DBEGINDATE(COCV4491-INDICE).
           MOVE COCD3605-DENDDATE
             TO COCV4491-D-DENDDATE(COCV4491-INDICE).
           MOVE COCD3605-CMOEDA
             TO COCV4491-D-CMOEDA(COCV4491-INDICE).
           MOVE COCD3605-BACTIVE
             TO COCV4491-D-BACTIVE(COCV4491-INDICE).
           MOVE COCD3605-NBUDGET
             TO COCV4491-D-NBUDGET(COCV4491-INDICE).
           MOVE COCD3605-PAIS
             TO COCV4491-D-PAIS(COCV4491-INDICE).
           MOVE COCD3605-CLIENTE
             TO COCV4491-D-CLIENTE(COCV4491-INDICE).
           MOVE COCD3605-LINHANEG
             TO COCV4491-D-LINHANEG(COCV4491-INDICE).
           MOVE COCD3605-TIPONEG
             TO COCV4491-D-TIPONEG(COCV4491-INDICE).
           MOVE COCD3605-RESPONS
             TO COCV4491-D-RESPONS(COCV4491-INDICE).
           MOVE COCD3605-IPROJI
             TO COCV4491-D-IPROJI(COCV4491-INDICE).
           MOVE COCD3605-IPROJE
             TO COCV4491-D-IPROJE(COCV4491-INDICE).
           MOVE COCD3605-IACHORAS
             TO COCV4491-D-IACHORAS(COCV4491-INDICE).
           MOVE COCD3605-IADESPESAS
             TO COCV4491-D-IADESPESAS(COCV4491-INDICE).

           PERFORM 2800-LER-OPP
              THRU 2800-LER-OPP-EXIT.

           PERFORM 2030-FETCH
              THRU 2039-FETCH-EXIT.

       2059-TRATA-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      * LER OPPORTUNITIES
      *--------------------------------------------------------------
       2800-LER-OPP.

           MOVE COCD3605-NIDPROJECTO       TO COCD0601-CPROJECT.

           EXEC SQL
                 SELECT
                       COPPORTUNITY
                     , CPROJECT
                 INTO
                       :COCD0601-COPPORTUNITY
                     , :COCD0601-CPROJECT
                 FROM COVT0601_OPPORTUNITIES
                 WHERE CPROJECT = :COCD0601-CPROJECT
                 FETCH FIRST ROW ONLY
           END-EXEC

           MOVE CON-COVT0601
             TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
              IF DB2-OK
                    MOVE COCD0601-COPPORTUNITY
                      TO COCV4491-D-COPPORTUNITY(COCV4491-INDICE)
                 ELSE
                    MOVE SPACES
                      TO COCV4491-D-COPPORTUNITY(COCV4491-INDICE)
              END-IF
           END-IF.

       2800-LER-OPP-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2070-CLOSE
      *--------------------------------------------------------------
       2070-CLOSE.

           IF VIAL0001-DEBUG-SIM
              MOVE '2070-CLOSE' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EVALUATE TRUE
               WHEN SW-CURSOR-1
                    EXEC SQL
                        CLOSE CURCOT01
                    END-EXEC
           END-EVALUATE.

       2079-CLOSE-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              MOVE 'COCV4491-D-NIDPROJECTO'   TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV4491-D-NIDPROJECTO(1) TO VIAL0015-CAMPO-VLR(1)
              MOVE 'COCV4491-D-CLIENTE'       TO VIAL0015-CAMPO-NM(2)
              MOVE  COCV4491-D-CLIENTE    (1) TO VIAL0015-CAMPO-VLR(2)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF COCV4490-NMAXLIST EQUAL ZEROES
              MOVE VIAL0001-CAPLIC         TO ARCL0039-CAPLIC
              MOVE VIAL0001-COPCAO         TO ARCL0039-COPCAO
              PERFORM ARCR0039-NMAXLIST
                 THRU ARCR0039-NMAXLIST-EXIT

              IF ETCL0002-ABEND-DB2
                 MOVE ETCL0002-TABLE-NAME  TO VIAL0002-TABLE-NAME
                 MOVE ETCL0002-SQLCA       TO VIAL0002-SQLCA
              END-IF

              MOVE ARCL0039-NMAXLIST       TO COCV4491-NMAXLIST
           ELSE
              MOVE COCV4490-NMAXLIST       TO COCV4491-NMAXLIST
           END-IF.

           MOVE COCV4491-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV4491-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV4491-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE COCV4491-INDICE            TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *==============================================================
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY ARCR0039.
