       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI44901.
      ******************************************************************
      *     PROGRAMA COI44901.                                         *
      *                                                                *
      *     Lista projectos                                            *
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI44901         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV4490.
       COPY COCV4491.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY TGCL1000.
       COPY TGCL2000.
       COPY TGCK0002.

      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 WS-PROGNAME            PIC X(08) VALUE 'COI44901'.

           05 CON-CTABELA-CLIENTE    PIC X(05) VALUE 'CO505'.
           05 CON-CTABELA-PROJECTO   PIC X(05) VALUE 'CO151'.
           05 CON-CTABELA-BACTIVE    PIC X(05) VALUE 'CO152'.

           05 CON-CTABELA-PAIS       PIC X(05) VALUE 'AR047'.
           05 CON-CTABELA-D-DCLIENTE PIC X(05) VALUE 'CO505'.
           05 CON-CTABELA-D-PROJECTO PIC X(05) VALUE 'CO151'.
           05 CON-CTABELA-D-BACTIVE  PIC X(05) VALUE 'CO152'.
           05 CON-CTABELA-D-CMOEDA   PIC X(05) VALUE 'AR041'.
      *--- Mudança do Código de Pais de Numerico para Alfa
      *    05 CON-CTABELA-D-PAIS     PIC X(05) VALUE 'AR801'.
           05 CON-CTABELA-D-PAIS     PIC X(05) VALUE 'AR047'.
           05 CON-CTABELA-D-LINHANEG PIC X(05) VALUE 'CO702'.
           05 CON-CTABELA-D-TIPONEG  PIC X(05) VALUE 'CO703'.
           05 CON-CTABELA-D-RESPONS  PIC X(05) VALUE 'CO507'.

      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-CTABELA                   PIC X(05) VALUE SPACES.
           05 WS-CCOD                      PIC X(40) VALUE SPACES.
           05 WS-C2COD                     PIC X(40) VALUE SPACES.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI44901         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

            EXEC SQL INCLUDE VIAP0009 END-EXEC.

      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.

           MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID

           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV4490-MSG.
           MOVE VIAL0001-MENSAGEM-OUTPUT   TO COCV4491-MSG.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID

           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-DESC-CAMPOS
                 THRU 2100-DESC-CAMPOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-DESC-CAMPOS
      *--------------------------------------------------------------
       2100-DESC-CAMPOS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2100-DESC-CAMPOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV4491-CLIENTE      NOT EQUAL SPACES
           AND COCV4491-XDESCCLIENTE     EQUAL SPACES

              MOVE CON-CTABELA-CLIENTE  TO WS-CTABELA
              MOVE COCV4491-CLIENTE     TO WS-CCOD
              MOVE SPACES               TO WS-C2COD

              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL1000-GDESC TO COCV4491-XDESCCLIENTE
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV4491-NIDPROJECTO  NOT EQUAL SPACES
           AND COCV4491-XDESCNIDPROJECTO EQUAL SPACES

              MOVE CON-CTABELA-PROJECTO TO WS-CTABELA
              MOVE COCV4491-NIDPROJECTO TO WS-CCOD
              MOVE SPACES               TO WS-C2COD

              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL1000-GDESC TO COCV4491-XDESCNIDPROJECTO
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV4491-BACTIVE      NOT EQUAL SPACES
           AND COCV4491-XDESCBACTIVE     EQUAL SPACES

              MOVE CON-CTABELA-BACTIVE  TO WS-CTABELA
              MOVE COCV4491-BACTIVE     TO WS-CCOD
              MOVE SPACES               TO WS-C2COD

              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC TO COCV4491-XDESCBACTIVE
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV4491-PAIS         NOT EQUAL SPACES
           AND COCV4491-XDESCPAIS        EQUAL SPACES

              MOVE CON-CTABELA-PAIS     TO WS-CTABELA
              MOVE COCV4491-PAIS        TO WS-CCOD
              MOVE SPACES               TO WS-C2COD

              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC TO COCV4491-XDESCPAIS
              END-IF
           END-IF.

           IF VIAL0002-SEM-ERROS
              MOVE ZEROS TO COCV4491-INDICE
              PERFORM 2400-DESC-OCCURS
                 THRU 2400-DESC-OCCURS-EXIT
                UNTIL COCV4491-PAGINA-CHEIA
                   OR COCV4491-INDICE >= VIAL0001-OCORRENCIAS
           END-IF.

       2100-DESC-CAMPOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2200-VAL-TAB-ART05
      *--------------------------------------------------------------
       2200-VAL-TAB-ART05.

           INITIALIZE TGCL2000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL2000-CTABELA
           MOVE WS-CCOD                   TO TGCL2000-CCOD
           MOVE WS-C2COD                  TO TGCL2000-C2COD

           PERFORM CALL-TGCP2000
              THRU CALL-TGCP2000-EXIT.

       2200-VAL-TAB-ART05-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2300-VAL-TAB-OUTRA
      *--------------------------------------------------------------
       2300-VAL-TAB-OUTRA.

           INITIALIZE TGCL1000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL1000-CTABELA
           MOVE WS-CCOD                   TO TGCL1000-CCOD
           MOVE WS-C2COD                  TO TGCL1000-C2COD

           PERFORM CALL-TGCP1000
              THRU CALL-TGCP1000-EXIT.

       2300-VAL-TAB-OUTRA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2400-DESC-OCCURS
      *--------------------------------------------------------------
       2400-DESC-OCCURS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2400-DESC-OCCURS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           ADD 1  TO COCV4491-INDICE.

           IF  VIAL0002-SEM-ERROS
           AND COCV4491-D-CLIENTE(COCV4491-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-DCLIENTE              TO WS-CTABELA
              MOVE COCV4491-D-CLIENTE(COCV4491-INDICE) TO WS-CCOD
              MOVE SPACES                              TO WS-C2COD

              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL1000-GDESC
                   TO COCV4491-XDESCD-CLIENTE(COCV4491-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV4491-XDESCD-CLIENTE(COCV4491-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV4491-D-NIDPROJECTO(COCV4491-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-PROJECTO                  TO WS-CTABELA
              MOVE COCV4491-D-NIDPROJECTO(COCV4491-INDICE) TO WS-CCOD
              MOVE SPACES                                  TO WS-C2COD

              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL1000-GDESC
                   TO COCV4491-XDESCD-NIDPROJECTO(COCV4491-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV4491-XDESCD-NIDPROJECTO(COCV4491-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV4491-D-BACTIVE(COCV4491-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-BACTIVE               TO WS-CTABELA
              MOVE COCV4491-D-BACTIVE(COCV4491-INDICE) TO WS-CCOD
              MOVE SPACES                              TO WS-C2COD

              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV4491-XDESCD-BACTIVE(COCV4491-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV4491-XDESCD-BACTIVE(COCV4491-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV4491-D-CMOEDA(COCV4491-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-CMOEDA               TO WS-CTABELA
              MOVE COCV4491-D-CMOEDA(COCV4491-INDICE) TO WS-CCOD
              MOVE SPACES                             TO WS-C2COD

              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV4491-XDESCD-CMOEDA(COCV4491-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV4491-XDESCD-CMOEDA(COCV4491-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV4491-D-PAIS(COCV4491-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-PAIS               TO WS-CTABELA
              MOVE COCV4491-D-PAIS(COCV4491-INDICE) TO WS-CCOD
              MOVE SPACES                           TO WS-C2COD

              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV4491-XDESCD-PAIS(COCV4491-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV4491-XDESCD-PAIS(COCV4491-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV4491-D-LINHANEG(COCV4491-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-LINHANEG               TO WS-CTABELA
              MOVE COCV4491-D-LINHANEG(COCV4491-INDICE) TO WS-CCOD
              MOVE SPACES                               TO WS-C2COD

              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV4491-XDESCD-LINHANEG(COCV4491-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV4491-XDESCD-LINHANEG(COCV4491-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV4491-D-TIPONEG(COCV4491-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-TIPONEG                TO WS-CTABELA
              MOVE COCV4491-D-TIPONEG(COCV4491-INDICE)  TO WS-CCOD
              MOVE COCV4491-D-LINHANEG(COCV4491-INDICE) TO WS-C2COD

              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV4491-XDESCD-TIPONEG(COCV4491-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV4491-XDESCD-TIPONEG(COCV4491-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV4491-D-RESPONS(COCV4491-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-RESPONS               TO WS-CTABELA
              MOVE COCV4491-D-RESPONS(COCV4491-INDICE) TO WS-CCOD
              MOVE SPACES                              TO WS-C2COD

              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL1000-GDESC
                   TO COCV4491-XDESCD-RESPONS(COCV4491-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV4491-XDESCD-RESPONS(COCV4491-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

       2400-DESC-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              MOVE 'COCV4491-MSG' TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV4491-MSG  TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV4491-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV4490-MSG               TO VIAL0001-MENSAGEM-INPUT.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *==============================================================
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY TGCP1000.
           COPY TGCP2000.
