       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI58302.
      ******************************************************************
      *     PROGRAMA COI58302.                                         *
      *                                                                *
      *     Pedido de emissão de facturas                              *
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI58302         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD5008 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV5830.
       COPY COCV5831.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.

      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT5008 PIC X(08) VALUE 'COVT5008'.

      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME            PIC  X(08) VALUE 'COI58302'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI58302         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

            EXEC SQL INCLUDE VIAP0009 END-EXEC.

      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA'    TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT      TO COCV5830-MSG.
           MOVE COCV5830-ASE                 TO COCV5831-ASE.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV5830-ADE       TO COCV5831-ADE.

           IF VIAL0002-SEM-ERROS
              PERFORM 2160-OBTEM-DADOS
                 THRU 2160-OBTEM-DADOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   Obtem dados resto
      *--------------------------------------------------------------
       2160-OBTEM-DADOS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2160-OBTEM-DADOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV5830-NIDINVOICE   TO COCD5008-NIDINVOICE .
           MOVE COCV5830-NIDPROJECTO  TO COCD5008-NIDPROJECTO.

           EXEC SQL
                SELECT
                       NIDINVOICE
                     , NIDPROJECTO
                     , GCLIENTE
                     , DDATAINSER
                     , DDATAEMISS
                     , DDATAEMIS2
                     , DDATEDUE
                     , CPRAZO
                     , NTOTALAMOUNT
                     , NTAXAMOUNT
                     , GDESCINVOICE
                     , CSTATUS
                     , CUSERID
                     , HTIMEST
                     , GREFINV
                     , DPAG
                     , CTIPDOC
                     , CMOEDA
                     , CIMPOSTO
                     , NOTAS
                     , CTIPFAC
                     , NTOTPAG
                     , NTAXPAG
                     , NTOTRET
                     , NTAXRET
                 INTO
                       :COCD5008-NIDINVOICE
                     , :COCD5008-NIDPROJECTO
                     , :COCD5008-GCLIENTE
                     , :COCD5008-DDATAINSER
                     , :COCD5008-DDATAEMISS
                     , :COCD5008-DDATAEMIS2
                     , :COCD5008-DDATEDUE
                     , :COCD5008-CPRAZO
                     , :COCD5008-NTOTALAMOUNT
                     , :COCD5008-NTAXAMOUNT
                     , :COCD5008-GDESCINVOICE
                     , :COCD5008-CSTATUS
                     , :COCD5008-CUSERID
                     , :COCD5008-HTIMEST
                     , :COCD5008-GREFINV
                     , :COCD5008-DPAG
                     , :COCD5008-CTIPDOC
                     , :COCD5008-CMOEDA
                     , :COCD5008-CIMPOSTO
                     , :COCD5008-NOTAS
                     , :COCD5008-CTIPFAC
                     , :COCD5008-NTOTPAG
                     , :COCD5008-NTAXPAG
                     , :COCD5008-NTOTRET
                     , :COCD5008-NTAXRET
                  FROM  COVT5008_INVOICES
                 WHERE  NIDINVOICE  = :COCD5008-NIDINVOICE
                   AND  NIDPROJECTO = :COCD5008-NIDPROJECTO
           END-EXEC.


           MOVE CON-COVT5008  TO VIAL0002-TABLE-NAME.
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
              IF DB2-OK
                 MOVE COCD5008-NIDINVOICE    TO COCV5831-NIDINVOICE
                 MOVE COCD5008-NIDPROJECTO   TO COCV5831-NIDPROJECTO
                 MOVE COCD5008-GCLIENTE      TO COCV5831-GCLIENTE
                 MOVE COCD5008-DDATAINSER    TO COCV5831-DDATAINSER
                 MOVE COCD5008-DDATAEMISS    TO COCV5831-DDATAEMISS
                 MOVE COCD5008-DDATAEMISS    TO COCV5831-DDATAEMISS-A
                 MOVE COCD5008-DDATAEMIS2    TO COCV5831-DDATAEMIS2
                 MOVE COCD5008-DDATAEMIS2    TO COCV5831-DDATAEMIS2-A
                 MOVE COCD5008-DDATEDUE      TO COCV5831-DDATEDUE
                 MOVE COCD5008-CPRAZO        TO COCV5831-CPRAZO
                 MOVE COCD5008-NTOTALAMOUNT  TO COCV5831-NTOTALAMOUNT
                 MOVE COCD5008-NTOTALAMOUNT  TO COCV5831-NTOTALAMOUNT-A
                 MOVE COCD5008-NTAXAMOUNT    TO COCV5831-NTAXAMOUNT
                 MOVE COCD5008-GDESCINVOICE  TO COCV5831-GDESCINVOICE
                 MOVE COCD5008-CSTATUS       TO COCV5831-CSTATUS
                 MOVE COCD5008-GREFINV       TO COCV5831-REFINVOICE
                 MOVE COCD5008-DPAG          TO COCV5831-DDATEPAG
                 MOVE COCD5008-CMOEDA        TO COCV5831-CMOEDA
                 MOVE COCD5008-CIMPOSTO      TO COCV5831-CIMPOSTO
                 MOVE COCD5008-CIMPOSTO      TO COCV5831-CIMPOSTO-A
                 MOVE COCD5008-NOTAS         TO COCV5831-NOTAS
                 MOVE COCD5008-CTIPFAC       TO COCV5831-CTIPFAC
                 COMPUTE COCV5831-NVALTOT = COCD5008-NTOTALAMOUNT +
                                            COCD5008-NTAXAMOUNT

                 MOVE COCD5008-NTOTPAG       TO COCV5831-NVALREC
                 MOVE COCD5008-NTAXPAG       TO COCV5831-NTAXREC

                 COMPUTE COCV5831-NVALLIQ  = COCV5831-NVALTOT      -
                                            (COCV5831-NVALREC      +
                                             COCV5831-NTAXREC)     -
                                            (COCD5008-NTOTRET      +
                                             COCD5008-NTAXRET)
              ELSE
                 MOVE VIAK0002-ERROS-FUNCAO
                   TO VIAL0002-IND-ERROS
                 MOVE COCK0002-STATUS-ACTIVO
                   TO COCV5831-NIDINVOICE-S
                 MOVE COCK0001-NIDINVOICE-N-EXISTS
                   TO COCV5831-NIDINVOICE-MSG
                 MOVE COCK0002-CAPLIC
                   TO COCV5831-NIDINVOICE-CAPLIC
              END-IF
           END-IF.

       2160-OBTEM-DADOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              MOVE 'COCV5831-GDESCINVOICE'   TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV5831-GDESCINVOICE    TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV5831-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV5831-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV5831-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES                     TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *==============================================================
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
