       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI56900.
      ******************************************************************
      *     PROGRAMA COI56900.                                         *
      *                                                                *
      *     VIA Controlo de Resultados - detalhe                       *
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI56900         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD5011 END-EXEC.
           EXEC SQL INCLUDE COCD3606 END-EXEC.
           EXEC SQL INCLUDE COCD6701 END-EXEC.
           EXEC SQL INCLUDE COCD4700 END-EXEC.
           EXEC SQL INCLUDE COCD5403 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV5690.
       COPY COCV5691.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL1000.
       COPY VIATW300.
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.
       COPY ETCL0002.
       COPY ARCL0039.

      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
      *--------------------------------------------------------------
      *            SWITCH
      *--------------------------------------------------------------
       01  SW-SWITCH.
           05 SW-CURSOR                  PIC X(01) VALUE SPACES.
              88 SW-CURSOR1-NOTFND                 VALUE '1'.
              88 SW-CURSOR2-NOTFND                 VALUE '2'.

           05 WS-IND-AUX                 PIC S9(04) VALUE 0.
              88 SW-PAGINA-CHEIA-AUX                VALUE 500.
      *
           05 SW-PESQUISA-ENT            PIC 9(01) VALUE 0.
              88 SW-ENCONTROU                      VALUE 1.
              88 SW-NAO-ENCONTROU                  VALUE 0.
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-D        PIC X(03) VALUE 'D'.
           05 CON-S        PIC X(03) VALUE 'S'.
           05 CON-33       PIC X(03) VALUE '33'.
           05 CON-U01      PIC X(03) VALUE 'U01'.
           05 CON-U99      PIC X(03) VALUE 'U99'.
           05 CON-000      PIC X(03) VALUE '000'.
           05 CON-03       PIC X(02) VALUE '03'.
           05 CON-11       PIC X(02) VALUE '11'.
           05 CON-COVT5011 PIC X(08) VALUE 'COVT5011'.
           05 CON-COVT6401 PIC X(08) VALUE 'COVT6401'.
           05 CON-COVT3606 PIC X(08) VALUE 'COVT3606'.
           05 CON-COVT4700 PIC X(08) VALUE 'COVT4700'.
           05 CON-COVT6701 PIC X(08) VALUE 'COVT6701'.
           05 CON-COVT5403 PIC X(08) VALUE 'COVT5403'.
           05 CON-1        PIC 9(01) VALUE 1.
           05 CON-CS-0     PIC X(01) VALUE '0'.
           05 CON-CS-1     PIC X(01) VALUE '1'.
           05 CON-CS-2     PIC X(01) VALUE '2'.
           05 CON-CS-3     PIC X(01) VALUE '3'.
           05 CON-CD-01    PIC X(02) VALUE '01'.
           05 CON-CD-02    PIC X(02) VALUE '02'.
           05 CON-CD-03    PIC X(02) VALUE '03'.
           05 CON-CD-AT    PIC X(02) VALUE 'AT'.

      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME         PIC X(08) VALUE 'COI56900'.
           05 WS-DATA-MIN         PIC X(10) VALUE '0001-01-01'.
           05 WS-DATA-MAX         PIC X(10) VALUE '9999-12-31'.
           05 WS-REFINVOICE       PIC X(10) VALUE SPACES.
           05 WS-NIDPROJECTO-MIN  PIC X(08) VALUE SPACES.
           05 WS-NIDPROJECTO-MAX  PIC X(08) VALUE SPACES.
           05 WS-GCLIENTE-MIN     PIC X(10) VALUE SPACES.
           05 WS-GCLIENTE-MAX     PIC X(10) VALUE SPACES.
           05 WS-NSEQ             PIC 9(10) VALUE ZEROS.
      *
      * Tabela interna de configuracao de contas
          05 WS-CONFIG-CNT.
             10 FILLER               OCCURS  500 TIMES.
                15 WS-CNT-LINHANEG      PIC  X(03).
                15 WS-CNT-TIPONEG       PIC  X(03).
                15 WS-CNT-ICAIXA        PIC  X(01).
                15 WS-CNT-IRESULT       PIC  X(01).
                15 WS-CNT-CRESULT       PIC  X(02).
      *
          05 WS-CRESULT                 PIC X(02) VALUE SPACES.
      *
          05 WS-IRESULT                 PIC X(01) VALUE SPACES.
             88 SW-AFETA-RESULTADOS               VALUE 'S'.
             88 SW-NAO-AFETA-RESULTADOS           VALUE 'N'.

      *
          05 WS-ICAIXA                  PIC X(01) VALUE SPACES.
             88 SW-AFETA-CAIXA                    VALUE 'S'.
             88 SW-NAO-AFETA-CAIXA                VALUE 'N'.

      *
      * Classes de Resultados
      *
          05 WS-CLASSE-RESULT           PIC X(02) VALUE SPACES.
             88 SW-RECEITAS                       VALUE '01'.
             88 SW-DESPESAS-FIX                   VALUE '02'.
             88 SW-DESPESAS-VAR                   VALUE '03'.
             88 SW-IMPOSTOS                       VALUE '04'.
             88 SW-AMORTIZACOES                   VALUE '05'.
             88 SW-IMPARIDADES                    VALUE '06'.

          05 WS-DATA-INI                  PIC X(10).
          05 FILLER REDEFINES WS-DATA-INI.
             10 WS-DATA-INI-ANO           PIC X(04).
             10 WS-DATA-INI-SP1           PIC X(01).
             10 WS-DATA-INI-MES           PIC X(02).
             10 WS-DATA-INI-SP2           PIC X(01).
             10 WS-DATA-INI-DIA           PIC X(02).

          05 WS-DATA-FIM                  PIC X(10).
          05 FILLER REDEFINES WS-DATA-FIM.
             10 WS-DATA-FIM-ANO           PIC X(04).
             10 WS-DATA-FIM-SP1           PIC X(01).
             10 WS-DATA-FIM-MES           PIC X(02).
             10 WS-DATA-FIM-SP2           PIC X(01).
             10 WS-DATA-FIM-DIA           PIC X(02).

          05 WS-DATA-BOA                  PIC X(10).
          05 FILLER REDEFINES WS-DATA-BOA.
             10 WS-DATA-BOA-ANO           PIC 9(04).
             10 WS-DATA-BOA-SP1           PIC X(01).
             10 WS-DATA-BOA-MES           PIC 9(02).
             10 WS-DATA-BOA-SP2           PIC X(01).
             10 WS-DATA-BOA-DIA           PIC 9(02).

          05 WS-QUO                       PIC 9(04).
          05 WS-RES                       PIC 9(04).
          05 WS-ANO-X                     PIC X(04).
          05 FILLER REDEFINES WS-ANO-X.
             10 WS-ANO-9                  PIC 9(04).
          05 WS-CREVPG                    PIC X(03).
          05 FILLER REDEFINES WS-CREVPG.
             10 WS-CREVPG-01              PIC X(01).
             10 WS-CREVPG-02              PIC 9(02).

           05 WS-D-TRAB                    PIC X(10).
           05 FILLER REDEFINES WS-D-TRAB.
              10 WS-D-TRAB-ANO             PIC X(04).
              10 WS-D-TRAB-SP1             PIC X(01).
              10 WS-D-TRAB-MES             PIC X(02).
              10 WS-D-TRAB-SP2             PIC X(01).
              10 WS-D-TRAB-DIA             PIC X(02).

           05 WS-TRATA-DATA                PIC X(10).
           05 FILLER REDEFINES WS-TRATA-DATA.
              10 WS-TRATA-DATA-ANO         PIC 9(04).
              10 WS-TRATA-DATA-SP1         PIC X(01).
              10 WS-TRATA-DATA-MES         PIC 9(02).
              10 WS-TRATA-DATA-SP2         PIC X(01).
              10 WS-TRATA-DATA-DIA         PIC 9(02).
      *
           05 WS-NTOTALAMOUNT               PIC S9(15)V99 VALUE ZEROES.
           05 WS-NTAXAMOUNT                 PIC S9(15)V99 VALUE ZEROES.
           05 WS-NTOTPAG                    PIC S9(15)V99 VALUE ZEROES.
           05 WS-NTAXPAG                    PIC S9(15)V99 VALUE ZEROES.
           05 WS-NTOTRET                    PIC S9(15)V99 VALUE ZEROES.
           05 WS-NTAXRET                    PIC S9(15)V99 VALUE ZEROES.
           05 WS-MVOR                       PIC S9(15)V99 VALUE ZEROES.
      *
      *--------------------------------------------------------------
      *              DECLARACOES DE CURSORES DB2                     *
      *--------------------------------------------------------------
       01  WS-CURSOR-VARS.
           05 FILLER                     PIC X(01) VALUE SPACES.

      *
      * Cursor para configuracao de contas
      *
           EXEC SQL
                DECLARE CUR47 CURSOR FOR
                SELECT
                       LINHANEG
                     , TIPONEG
                     , ICAIXA
                     , IRESULT
                     , CRESULT
                 FROM COVT4700
                 ORDER BY LINHANEG
                        , TIPONEG
           END-EXEC.


           EXEC SQL
                DECLARE CURCOT50 CURSOR FOR
                 SELECT
                       NIDINVOICE
                     , NIDPROJECTO
                     , GCLIENTE
                     , DDATAINSER
                     , DDATAEMISS
                     , DDATAEMIS2
                     , DDATEDUE
                     , CPRAZO
                     , NTOTALAMOUNT
                     , NTAXAMOUNT
                     , GDESCINVOICE
                     , CSTATUS
                     , CUSERID
                     , HTIMEST
                     , GREFINV
                     , DPAG
                     , CMOEDA
                     , CIMPOSTO
                     , NTOTCTRV
                     , NTAXCTRV
                     , NTOTPAG
                     , NTAXPAG
                     , NTOTRET
                     , NTAXRET
                 FROM COVT5011_INVOICES
                 WHERE  GCLIENTE     = :COCD5011-GCLIENTE
                 AND    NTOTALAMOUNT >  0
                 AND  ( CSTATUS      =  :CON-CS-0
                 OR     CSTATUS      =  :CON-CS-1
                 OR     CSTATUS      =  :CON-CS-2
                 OR     CSTATUS      =  :CON-CS-3 )

                   AND (NIDPROJECTO  >  :COCD5011-NIDPROJECTO

                    OR (NIDPROJECTO  = :COCD5011-NIDPROJECTO
                   AND  NIDINVOICE  >= :COCD5011-NIDINVOICE))

                 ORDER  BY NIDPROJECTO,
                        NIDINVOICE
           END-EXEC.

      *--- Cursor para obter as Saídas (Despesas)
           EXEC SQL
                DECLARE CURCOT67 CURSOR FOR
                 SELECT NIDINVOICE
                      , NIDPROJECTO
                      , GCLIENTE
                      , DDATAINSER
                      , DDATAEMISS
                      , DDATAEMIS2
                      , DDATEDUE
                      , CPRAZO
                      , NTOTALAMOUNT
                      , NTAXAMOUNT
                      , GDESCINVOICE
                      , CSTATUS
                      , CUSERID
                      , HTIMEST
                      , GREFINV
                      , DPAG
                      , CTIPDOC
                      , CMOEDA
                      , CIMPOSTO
                      , NOTAS
                      , NTOTCTRV
                      , NTAXCTRV
                      , CTIPFAC
                      , NTOTPAG
                      , NTAXPAG
                      , NTOTRET
                      , NTAXRET
                      , CIBAN
                      , MVOR
                 FROM COVT6701_EXPENSES
                 WHERE (NTOTALAMOUNT  >  0
                    OR  MVOR          >  0)
                   AND (CSTATUS       =  :CON-CD-01
                    OR  CSTATUS       =  :CON-CD-02
                    OR  CSTATUS       =  :CON-CD-03
                    OR  CSTATUS       =  :CON-CD-AT)
                   AND  NIDPROJECTO   = :COCD6701-NIDPROJECTO

                   AND  NIDINVOICE   >= :COCD6701-NIDINVOICE

                 ORDER  BY NIDPROJECTO,
                        NIDINVOICE
           END-EXEC.

      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI56900         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

           EXEC SQL INCLUDE VIAP0009 END-EXEC.

      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV5690-MSG.
           MOVE COCV5690-ASE               TO COCV5691-ASE.

           MOVE ZEROES                     TO COCV5691-INDICE.
           PERFORM 1100-LIMPA-OCCURS
              THRU 1199-LIMPA-OCCURS-EXIT
             UNTIL COCV5691-PAGINA-CHEIA.

           PERFORM 1200-CARREGA-PARAM
              THRU 1200-CARREGA-PARAM-EXIT.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            1100-LIMPA-OCCURS
      *--------------------------------------------------------------
       1100-LIMPA-OCCURS.

           ADD 1                       TO COCV5691-INDICE.

           MOVE ZEROES TO   COCV5691-D-NIDINVOICE(COCV5691-INDICE)
                            COCV5691-D-NSEQ(COCV5691-INDICE)
                            COCV5691-D-NTOTALAMOUNT(COCV5691-INDICE)
                            COCV5691-D-NTAXAMOUNT(COCV5691-INDICE)
                            COCV5691-D-NVALTOT(COCV5691-INDICE)
                            COCV5691-D-NVALLIQ(COCV5691-INDICE)
                            COCV5691-D-NTOTVALREC(COCV5691-INDICE)
                            COCV5691-D-NTOTTAXREC(COCV5691-INDICE)
                            COCV5691-D-NTOTVALRET(COCV5691-INDICE)
                            COCV5691-D-NTOTTAXRET(COCV5691-INDICE)

           MOVE SPACES TO   COCV5691-D-GCLIENTE(COCV5691-INDICE)
                            COCV5691-D-NIDPROJECTO(COCV5691-INDICE)
                            COCV5691-D-REFINVOICE(COCV5691-INDICE)
                            COCV5691-D-CPRAZO(COCV5691-INDICE)
                            COCV5691-D-CSTATUS(COCV5691-INDICE)
                            COCV5691-D-CIMPOSTO(COCV5691-INDICE)
                            COCV5691-D-CMOEDA(COCV5691-INDICE)

           MOVE VIAK0002-DATA-MINIMA TO
                            COCV5691-D-DDATAINSER(COCV5691-INDICE)
                            COCV5691-D-DDATAEMISS(COCV5691-INDICE)
                            COCV5691-D-DDATAEMIS2(COCV5691-INDICE)
                            COCV5691-D-DDATEDUE(COCV5691-INDICE)
                            COCV5691-D-DDATEPAG(COCV5691-INDICE).

       1199-LIMPA-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            1200-CARREGA-PARAM
      *--------------------------------------------------------------
       1200-CARREGA-PARAM.

           IF VIAL0001-DEBUG-SIM
              MOVE '1200-CARREGA-PARAM' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ZEROES                     TO WS-IND-AUX.

           PERFORM 1210-LIMPA-CONFIG
              THRU 1210-LIMPA-CONFIG-EXIT
                UNTIL SW-PAGINA-CHEIA-AUX.

           PERFORM 1220-OPEN-PARAM-CNT
              THRU 1220-OPEN-PARAM-CNT-EXIT

           IF VIAL0002-SEM-ERROS
             PERFORM 1230-FETCH-PARAM-CNT
                THRU 1230-FETCH-PARAM-CNT-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              MOVE ZEROES                  TO WS-IND-AUX
              PERFORM 1240-TRATA-PARAM-CNT
                 THRU 1240-TRATA-PARAM-CNT-EXIT
                UNTIL NOT DB2-OK
                   OR NOT VIAL0002-SEM-ERROS
           END-IF.

           PERFORM 1250-CLOSE-PARAM-CNT
              THRU 1250-CLOSE-PARAM-CNT-EXIT.

       1200-CARREGA-PARAM-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            1210-LIMPA-CONFIG
      *--------------------------------------------------------------
       1210-LIMPA-CONFIG.

           ADD 1                       TO WS-IND-AUX.

           MOVE SPACES TO WS-CNT-LINHANEG(WS-IND-AUX)
                          WS-CNT-TIPONEG(WS-IND-AUX)
                          WS-CNT-ICAIXA(WS-IND-AUX)
                          WS-CNT-IRESULT(WS-IND-AUX)
                          WS-CNT-CRESULT(WS-IND-AUX).

       1210-LIMPA-CONFIG-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     1220-OPEN-PARAM-CNT
      *--------------------------------------------------------------
       1220-OPEN-PARAM-CNT.

           IF VIAL0001-DEBUG-SIM
              MOVE '1220-OPEN-PARAM-CNT' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
               OPEN CUR47
           END-EXEC

           MOVE CON-COVT4700               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       1220-OPEN-PARAM-CNT-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                     1230-FETCH-PARAM-CNT
      *--------------------------------------------------------------
       1230-FETCH-PARAM-CNT.

           IF VIAL0001-DEBUG-SIM
              MOVE '1230-FETCH-PARAM-CNT' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
              FETCH CUR47
               INTO
                   :COCD4700-LINHANEG
                 , :COCD4700-TIPONEG
                 , :COCD4700-ICAIXA
                 , :COCD4700-IRESULT
                 , :COCD4700-CRESULT
           END-EXEC.

           MOVE CON-COVT4700               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       1230-FETCH-PARAM-CNT-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                     1240-TRATA-PARAM-CNT
      *--------------------------------------------------------------
       1240-TRATA-PARAM-CNT.

           IF VIAL0001-DEBUG-SIM
              MOVE '1240-TRATA-PARAM-CNT' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           ADD  CON-1                 TO WS-IND-AUX

           MOVE COCD4700-LINHANEG     TO WS-CNT-LINHANEG(WS-IND-AUX)
           MOVE COCD4700-TIPONEG      TO WS-CNT-TIPONEG(WS-IND-AUX)
           MOVE COCD4700-ICAIXA       TO WS-CNT-ICAIXA(WS-IND-AUX)
           MOVE COCD4700-IRESULT      TO WS-CNT-IRESULT(WS-IND-AUX)
           MOVE COCD4700-CRESULT      TO WS-CNT-CRESULT(WS-IND-AUX)

           PERFORM 1230-FETCH-PARAM-CNT
              THRU 1230-FETCH-PARAM-CNT-EXIT.

       1240-TRATA-PARAM-CNT-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                     1250-CLOSE-PARAM-CNT
      *--------------------------------------------------------------
       1250-CLOSE-PARAM-CNT.

           IF VIAL0001-DEBUG-SIM
              MOVE '1250-CLOSE-PARAM-CNT' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
               CLOSE CUR47
           END-EXEC.

       1250-CLOSE-PARAM-CNT-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV5690-CSIGLA       TO COCV5691-CSIGLA.
           MOVE COCV5690-AANO         TO COCV5691-AANO.
           MOVE COCV5690-CRUBRICA     TO COCV5691-CRUBRICA.
           MOVE COCV5690-GRUBRICA     TO COCV5691-GRUBRICA.
           MOVE COCV5690-CONTA        TO COCV5691-CONTA.
           MOVE COCV5690-CMES         TO COCV5691-CMES.

           PERFORM 2010-VALIDACOES
              THRU 2010-VALIDACOES-EXIT.

           IF VIAL0002-SEM-ERROS
              PERFORM 2020-OPEN-CUR1
                 THRU 2029-OPEN-CUR1-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2030-FETCH-CUR1
                 THRU 2039-FETCH-CUR1-EXIT

              IF VIAL0002-SEM-ERROS
                 IF DB2-OK
                    PERFORM 2040-CONTINUA-CUR1
                       THRU 2049-CONTINUA-CUR1-EXIT
                 ELSE
                    COMPUTE COCV5691-DIMINUI-LENGTH EQUAL
                         COCV5691-INDICE-INVERSO * COCV5691-LENGTH-OCCUR
                    COMPUTE COCV5691-LENGTH EQUAL COCV5691-LENGTH
                         - COCV5691-DIMINUI-LENGTH
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV5691-CSIGLA-S
                    MOVE COCK0001-SEM-DADOS
                      TO COCV5691-CSIGLA-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV5691-CSIGLA-CAPLIC
                 END-IF
              END-IF

              PERFORM 2090-CLOSE-CUR1
                 THRU 2099-CLOSE-CUR1-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2010-VALIDACOES
      *--------------------------------------------------------------
       2010-VALIDACOES.

           IF VIAL0001-DEBUG-SIM
              MOVE '2010-VALIDACOES' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              IF COCV5690-CMES EQUAL SPACES
                 MOVE COCV5690-AANO            TO WS-DATA-INI-ANO
                 MOVE '-'                      TO WS-DATA-INI-SP1
                 MOVE '01'                     TO WS-DATA-INI-MES
                 MOVE '-'                      TO WS-DATA-INI-SP2
                 MOVE '01'                     TO WS-DATA-INI-DIA
                 MOVE COCV5690-AANO            TO WS-DATA-FIM-ANO
                 MOVE '-'                      TO WS-DATA-FIM-SP1
                 MOVE '12'                     TO WS-DATA-FIM-MES
                 MOVE '-'                      TO WS-DATA-FIM-SP2
                 MOVE '31'                     TO WS-DATA-FIM-DIA
              ELSE
                 MOVE COCV5690-AANO            TO WS-DATA-INI-ANO
                 MOVE '-'                      TO WS-DATA-INI-SP1
                 MOVE COCV5690-CMES            TO WS-DATA-INI-MES
                 MOVE '-'                      TO WS-DATA-INI-SP2
                 MOVE '01'                     TO WS-DATA-INI-DIA
                 MOVE COCV5690-AANO            TO WS-DATA-FIM-ANO
                 MOVE '-'                      TO WS-DATA-FIM-SP1
                 MOVE COCV5690-CMES            TO WS-DATA-FIM-MES
                 MOVE '-'                      TO WS-DATA-FIM-SP2

                 EVALUATE COCV5690-CMES
                     WHEN '01'
                     WHEN '03'
                     WHEN '05'
                     WHEN '07'
                     WHEN '08'
                     WHEN '10'
                     WHEN '12'
                          MOVE '31'            TO WS-DATA-FIM-DIA
                     WHEN '04'
                     WHEN '06'
                     WHEN '09'
                     WHEN '11'
                          MOVE '30'            TO WS-DATA-FIM-DIA
                     WHEN '02'
                          MOVE ZEROS TO WS-RES
                          MOVE COCV5690-AANO TO WS-ANO-X
                          DIVIDE WS-ANO-9 BY 4 GIVING WS-QUO
                                 REMAINDER WS-RES

                          IF WS-RES = ZEROS
                             MOVE '29'         TO WS-DATA-FIM-DIA
                          ELSE
                             MOVE '28'         TO WS-DATA-FIM-DIA
                          END-IF
                 END-EVALUATE
              END-IF
           END-IF.

           MOVE COCV5690-CSIGLA                TO COCD5403-CSIGLA
           PERFORM 2015-OBTEM-EMPRESA
              THRU 2015-OBTEM-EMPRESA-EXIT.

           IF VIAL0001-DEBUG-SIM
              MOVE '2010-VALIDACOES-EXIT'  TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

       2010-VALIDACOES-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2015-OBTEM-EMPRESA
      *--------------------------------------------------------------
       2015-OBTEM-EMPRESA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2015-OBTEM-EMPRESA' TO VIAL0015-CALLER-ID
              MOVE 'COCD5403-CSIGLA     ' TO VIAL0015-CAMPO-NM (1)
              MOVE  COCD5403-CSIGLA       TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           EXEC SQL
             SELECT CEMPRESA
               INTO :COCD5403-CEMPRESA
               FROM COVT5403_EMPRESAS
            WHERE CSIGLA       = :COCD5403-CSIGLA
           END-EXEC.
      *
           MOVE CON-COVT5403               TO VIAL0002-TABLE-NAME.
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           IF VIAL0002-SEM-ERROS
             IF DB2-OK
               CONTINUE
             ELSE
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-STATUS-ACTIVO TO COCV5691-CSIGLA-S
               MOVE COCK0001-CEMPRESA-N-EXISTS TO COCV5691-CSIGLA-MSG
               MOVE COCK0002-CAPLIC TO COCV5691-CSIGLA-CAPLIC
             END-IF
           END-IF.

           IF VIAL0001-DEBUG-SIM
              MOVE '2015-OBTEM-EMPRESA-EXIT' TO VIAL0015-CALLER-ID
              MOVE 'VIAL0002-IND-ERROS  ' TO VIAL0015-CAMPO-NM (1)
              MOVE  VIAL0002-IND-ERROS    TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

       2015-OBTEM-EMPRESA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2020-OPEN-CUR1
      *--------------------------------------------------------------
       2020-OPEN-CUR1.

           IF VIAL0001-DEBUG-SIM
              MOVE '2020-OPEN-CUR1' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV5690-CRUBRICA       TO WS-CLASSE-RESULT

           IF SW-RECEITAS
              MOVE COCV5690-CONTA         TO COCD5011-GCLIENTE
              MOVE COCV5690-NIDPROJECTOP  TO COCD5011-NIDPROJECTO
              MOVE COCV5690-NIDINVOICEP   TO COCD5011-NIDINVOICE

              EXEC SQL
                  OPEN CURCOT50
              END-EXEC

              MOVE CON-COVT5011           TO VIAL0002-TABLE-NAME
           ELSE
              MOVE COCV5690-CONTA         TO COCD6701-NIDPROJECTO
              MOVE COCV5690-NIDINVOICEP   TO COCD6701-NIDINVOICE

              EXEC SQL
                  OPEN CURCOT67
              END-EXEC

              MOVE CON-COVT6701           TO VIAL0002-TABLE-NAME
           END-IF.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       2029-OPEN-CUR1-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2030-FETCH-CUR1
      *--------------------------------------------------------------
       2030-FETCH-CUR1.

           IF VIAL0001-DEBUG-SIM
              MOVE '2030-FETCH-CUR1' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE SPACES           TO SW-CURSOR

           IF SW-RECEITAS
              EXEC SQL
                 FETCH CURCOT50
                  INTO
                      :COCD5011-NIDINVOICE
                    , :COCD5011-NIDPROJECTO
                    , :COCD5011-GCLIENTE
                    , :COCD5011-DDATAINSER
                    , :COCD5011-DDATAEMISS
                    , :COCD5011-DDATAEMIS2
                    , :COCD5011-DDATEDUE
                    , :COCD5011-CPRAZO
                    , :COCD5011-NTOTALAMOUNT
                    , :COCD5011-NTAXAMOUNT
                    , :COCD5011-GDESCINVOICE
                    , :COCD5011-CSTATUS
                    , :COCD5011-CUSERID
                    , :COCD5011-HTIMEST
                    , :COCD5011-GREFINV
                    , :COCD5011-DPAG
                    , :COCD5011-CMOEDA
                    , :COCD5011-CIMPOSTO
                    , :COCD5011-NTOTCTRV
                    , :COCD5011-NTAXCTRV
                    , :COCD5011-NTOTPAG
                    , :COCD5011-NTAXPAG
                    , :COCD5011-NTOTRET
                    , :COCD5011-NTAXRET
              END-EXEC

              MOVE CON-COVT5011            TO VIAL0002-TABLE-NAME
           ELSE
              EXEC SQL
                 FETCH CURCOT67
                  INTO
                      :COCD6701-NIDINVOICE
                    , :COCD6701-NIDPROJECTO
                    , :COCD6701-GCLIENTE
                    , :COCD6701-DDATAINSER
                    , :COCD6701-DDATAEMISS
                    , :COCD6701-DDATAEMIS2
                    , :COCD6701-DDATEDUE
                    , :COCD6701-CPRAZO
                    , :COCD6701-NTOTALAMOUNT
                    , :COCD6701-NTAXAMOUNT
                    , :COCD6701-GDESCINVOICE
                    , :COCD6701-CSTATUS
                    , :COCD6701-CUSERID
                    , :COCD6701-HTIMEST
                    , :COCD6701-GREFINV
                    , :COCD6701-DPAG
                    , :COCD6701-CTIPDOC
                    , :COCD6701-CMOEDA
                    , :COCD6701-CIMPOSTO
                    , :COCD6701-NOTAS
                    , :COCD6701-NTOTCTRV
                    , :COCD6701-NTAXCTRV
                    , :COCD6701-CTIPFAC
                    , :COCD6701-NTOTPAG
                    , :COCD6701-NTAXPAG
                    , :COCD6701-NTOTRET
                    , :COCD6701-NTAXRET
                    , :COCD6701-CIBAN
                    , :COCD6701-MVOR
              END-EXEC

              MOVE CON-COVT6701            TO VIAL0002-TABLE-NAME
           END-IF.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF DB2-NOTFND
              SET SW-CURSOR1-NOTFND        TO TRUE
           END-IF.

       2039-FETCH-CUR1-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                       2040-CONTINUA-CUR1
      *--------------------------------------------------------------
       2040-CONTINUA-CUR1.

           IF VIAL0001-DEBUG-SIM
              MOVE '2040-CONTINUA-CUR1' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV5690-NSEQP         TO WS-NSEQ.

           MOVE ZEROES                     TO COCV5691-INDICE.
           PERFORM 2050-TRATA-OCCURS
              THRU 2050-TRATA-OCCURS-EXIT
             UNTIL SW-CURSOR1-NOTFND
                OR COCV5691-PAGINA-CHEIA
                OR NOT VIAL0002-SEM-ERROS.

           IF VIAL0002-SEM-ERROS
              IF NOT COCV5691-PAGINA-CHEIA
                    COMPUTE COCV5691-INDICE-INVERSO EQUAL
                         COCV5691-INDICE-INVERSO - COCV5691-INDICE
                    COMPUTE COCV5691-DIMINUI-LENGTH EQUAL
                         COCV5691-INDICE-INVERSO * COCV5691-LENGTH-OCCUR
                    COMPUTE COCV5691-LENGTH EQUAL COCV5691-LENGTH -
                         COCV5691-DIMINUI-LENGTH
                    SET  VIAL0002-FIM-CONSULTA TO TRUE
              END-IF
           END-IF.

       2049-CONTINUA-CUR1-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2050-TRATA-OCCURS
      *--------------------------------------------------------------
       2050-TRATA-OCCURS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2050-TRATA-OCCURS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           PERFORM 2055-OBTEM-CNT
              THRU 2055-OBTEM-CNT-EXIT

           IF  VIAL0002-SEM-ERROS
           AND COCD5403-CEMPRESA     EQUAL COCD3606-CEMPRESA
              PERFORM 2056-OBTEM-CONFIG-CNT
                 THRU 2056-OBTEM-CONFIG-CNT-EXIT

              IF VIAL0002-SEM-ERROS
              AND SW-AFETA-RESULTADOS
                 IF WS-NSEQ               EQUAL ZEROS
                    PERFORM 2060-TRATA-OCCURS-CUR1
                       THRU 2069-TRATA-OCCURS-CUR1-EXIT
                 END-IF
              END-IF
           END-IF.

           MOVE ZEROS            TO WS-NSEQ.
           PERFORM 2030-FETCH-CUR1
              THRU 2039-FETCH-CUR1-EXIT.

       2050-TRATA-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2055-OBTEM-CNT
      *--------------------------------------------------------------
       2055-OBTEM-CNT.

           IF VIAL0001-DEBUG-SIM
              MOVE '2055-OBTEM-CNT' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF SW-RECEITAS
              MOVE COCD5011-NIDPROJECTO    TO COCD3606-NIDPROJECTO
           ELSE
              MOVE COCD6701-NIDPROJECTO    TO COCD3606-NIDPROJECTO
           END-IF.
      *
           EXEC SQL
             SELECT LINHANEG
                  , TIPONEG
                  , CREVPG
                  , CEMPRESA
                  , CMOEDA
               INTO :COCD3606-LINHANEG
                  , :COCD3606-TIPONEG
                  , :COCD3606-CREVPG
                  , :COCD3606-CEMPRESA
                  , :COCD3606-CMOEDA
               FROM COVT3606_PROJECTS
            WHERE NIDPROJECTO  = :COCD3606-NIDPROJECTO
           END-EXEC.
      *
           MOVE CON-COVT3606               TO VIAL0002-TABLE-NAME.
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           IF VIAL0002-SEM-ERROS
             IF DB2-OK
               CONTINUE
             ELSE
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-STATUS-ACTIVO TO COCV5691-CSIGLA-S
               MOVE COCK0001-NIDPROJECTO-N-EXISTS
                                           TO COCV5691-CSIGLA-MSG
               MOVE COCK0002-CAPLIC TO COCV5691-CSIGLA-CAPLIC
             END-IF
           END-IF.

           IF VIAL0001-DEBUG-SIM
              MOVE '2055-OBTEM-EMPRESA-EXIT' TO VIAL0015-CALLER-ID
              MOVE 'VIAL0002-IND-ERROS  ' TO VIAL0015-CAMPO-NM (1)
              MOVE  VIAL0002-IND-ERROS    TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

       2055-OBTEM-CNT-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2056-OBTEM-CONFIG-CNT
      *--------------------------------------------------------------
       2056-OBTEM-CONFIG-CNT.

           IF VIAL0001-DEBUG-SIM
              MOVE '2056-OBTEM-CONFIG-CNT' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           SET SW-NAO-ENCONTROU TO TRUE

           MOVE CON-1           TO WS-IND-AUX

           PERFORM VARYING WS-IND-AUX FROM 1 BY 1
             UNTIL SW-PAGINA-CHEIA-AUX
                OR SW-ENCONTROU
                OR WS-CNT-LINHANEG(WS-IND-AUX) EQUAL SPACES

                   IF  COCD3606-LINHANEG EQUAL
                       WS-CNT-LINHANEG(WS-IND-AUX)
                   AND COCD3606-TIPONEG EQUAL
                       WS-CNT-TIPONEG(WS-IND-AUX)

                       MOVE WS-CNT-ICAIXA(WS-IND-AUX)  TO WS-ICAIXA
                       MOVE WS-CNT-IRESULT(WS-IND-AUX) TO WS-IRESULT
                       MOVE WS-CNT-CRESULT(WS-IND-AUX) TO WS-CRESULT

                       SET SW-ENCONTROU     TO TRUE
                   END-IF
           END-PERFORM

           IF SW-NAO-ENCONTROU
              MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
              MOVE COCK0002-STATUS-ACTIVO TO COCV5691-CSIGLA-S
              MOVE COCK0001-CONFIG-CNT-N-EXISTS TO COCV5691-CSIGLA-MSG
              MOVE COCK0002-CAPLIC TO COCV5691-CSIGLA-CAPLIC
           END-IF.

       2056-OBTEM-CONFIG-CNT-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2060-TRATA-OCCURS-CUR1
      *--------------------------------------------------------------
       2060-TRATA-OCCURS-CUR1.

           IF VIAL0001-DEBUG-SIM
              MOVE '2060-TRATA-OCCURS-CUR1' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF SW-RECEITAS
PA    *       IF COCD5011-CSTATUS  NOT EQUAL CON-CS-3
                 IF COCD5011-DDATAEMIS2 NOT EQUAL WS-DATA-MIN
                    MOVE COCD5011-DDATAEMIS2      TO WS-DATA-BOA
                 ELSE
                    IF COCD5011-DDATAEMISS < VIAL0001-DATA-PROCESSO-I
                       MOVE VIAL0001-DATA-PROCESSO-I TO WS-DATA-BOA
                    ELSE
                       MOVE COCD5011-DDATAEMISS      TO WS-DATA-BOA
                    END-IF
                 END-IF

                 IF  WS-DATA-BOA >= WS-DATA-INI
                 AND WS-DATA-BOA <= WS-DATA-FIM

                     PERFORM 2070-FORMATA-OCCURS-1
                        THRU 2079-FORMATA-OCCURS-1-EXIT
                 END-IF
PA    *       END-IF
           ELSE
PA    *       IF  COCD6701-CSTATUS  NOT EQUAL CON-CD-03
PA    *       AND COCD6701-CSTATUS  NOT EQUAL CON-CD-AT
                 IF COCD6701-DDATAEMIS2 NOT EQUAL WS-DATA-MIN
                    MOVE COCD6701-DDATAEMIS2      TO WS-DATA-BOA
                 ELSE
                    IF COCD6701-DDATAEMISS < VIAL0001-DATA-PROCESSO-I
                       IF COCD3606-CREVPG = CON-000
                          MOVE COCD6701-DDATAEMISS TO WS-DATA-BOA
                       ELSE
                          PERFORM 8000-CALCULO-CREVPG
                             THRU 8000-CALCULO-CREVPG-EXIT
                       END-IF
                    ELSE
                       MOVE COCD6701-DDATAEMISS      TO WS-DATA-BOA
                    END-IF
                 END-IF

                 IF  WS-DATA-BOA >= WS-DATA-INI
                 AND WS-DATA-BOA <= WS-DATA-FIM

                     PERFORM 2070-FORMATA-OCCURS-1
                        THRU 2079-FORMATA-OCCURS-1-EXIT
                 END-IF
PA    *       END-IF
           END-IF.

       2069-TRATA-OCCURS-CUR1-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2070-FORMATA-OCCURS-1
      *--------------------------------------------------------------
       2070-FORMATA-OCCURS-1.

           IF VIAL0001-DEBUG-SIM
              MOVE '2070-FORMATA-OCCURS-1' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           ADD 1                       TO COCV5691-INDICE.

           IF SW-RECEITAS
              MOVE COCD5011-GREFINV
                TO COCV5691-D-REFINVOICE(COCV5691-INDICE)
              MOVE COCD5011-NIDINVOICE
                TO COCV5691-D-NIDINVOICE(COCV5691-INDICE)
              MOVE ZEROS
                TO COCV5691-D-NSEQ(COCV5691-INDICE)
              MOVE COCD5011-NIDPROJECTO
                TO COCV5691-D-NIDPROJECTO(COCV5691-INDICE)
              MOVE COCD5011-GCLIENTE
                TO COCV5691-D-GCLIENTE(COCV5691-INDICE)
              MOVE COCD5011-DDATAINSER
                TO COCV5691-D-DDATAINSER(COCV5691-INDICE)
              MOVE COCD5011-DDATAEMISS
                TO COCV5691-D-DDATAEMISS(COCV5691-INDICE)
              MOVE COCD5011-DDATAEMIS2
                TO COCV5691-D-DDATAEMIS2(COCV5691-INDICE)
              MOVE COCD5011-DDATEDUE
                TO COCV5691-D-DDATEDUE(COCV5691-INDICE)
              MOVE COCD5011-DPAG
                TO COCV5691-D-DDATEPAG(COCV5691-INDICE)
              MOVE COCD5011-CPRAZO
                TO COCV5691-D-CPRAZO(COCV5691-INDICE)
              MOVE COCD5011-CSTATUS
                TO COCV5691-D-CSTATUS(COCV5691-INDICE)
              MOVE COCD5011-CMOEDA
                TO COCV5691-D-CMOEDA(COCV5691-INDICE)
              MOVE COCD5011-CIMPOSTO
                TO COCV5691-D-CIMPOSTO(COCV5691-INDICE)

              IF COCD5011-CMOEDA EQUAL COCD3606-CMOEDA
                 MOVE COCD5011-NTOTALAMOUNT TO WS-NTOTALAMOUNT
                 MOVE COCD5011-NTAXAMOUNT   TO WS-NTAXAMOUNT
                 MOVE COCD5011-NTOTPAG      TO WS-NTOTPAG
                 MOVE COCD5011-NTAXPAG      TO WS-NTAXPAG
                 MOVE COCD5011-NTOTRET      TO WS-NTOTRET
                 MOVE COCD5011-NTAXRET      TO WS-NTAXRET
              ELSE
      * ATE SEREM CRIADOS OS CONTRAVALORES PARA NTOTPAG, NTAXPAG
      * NTOTRET E NTAXRET CONSIDERA-SE O CONTRAVALOR DO VALOR E TAXA
      * DA FATURA NO PRESSUPOSTO DE QUE O PAGAMENTO DE FATURAS EM
      * MOEDA DIFERENTE DA MOEDA DA EMPRESA NAO TERAO PAGAMENTOS
      * PARCIAIS NEM RETENCOES DE VALOR E TAXA
                 MOVE COCD5011-NTOTCTRV     TO WS-NTOTALAMOUNT
                 MOVE COCD5011-NTAXCTRV     TO WS-NTAXAMOUNT
                 MOVE ZEROS                 TO WS-NTOTPAG
                 MOVE ZEROS                 TO WS-NTAXPAG
                 MOVE ZEROS                 TO WS-NTOTRET
                 MOVE ZEROS                 TO WS-NTAXRET
              END-IF

              MOVE WS-NTOTALAMOUNT
                TO COCV5691-D-NTOTALAMOUNT(COCV5691-INDICE)
              MOVE WS-NTAXAMOUNT
                TO COCV5691-D-NTAXAMOUNT(COCV5691-INDICE)
              MOVE WS-NTOTPAG
                TO COCV5691-D-NTOTVALREC (COCV5691-INDICE)
              MOVE WS-NTAXPAG
                TO COCV5691-D-NTOTTAXREC (COCV5691-INDICE)
              MOVE WS-NTOTRET
                TO COCV5691-D-NTOTVALRET (COCV5691-INDICE)
              MOVE WS-NTAXRET
                TO COCV5691-D-NTOTTAXRET (COCV5691-INDICE)

              COMPUTE COCV5691-D-NVALTOT(COCV5691-INDICE) =
                      WS-NTOTALAMOUNT +
                      WS-NTAXAMOUNT

              COMPUTE COCV5691-D-NVALLIQ(COCV5691-INDICE)  =
                      COCV5691-D-NVALTOT(COCV5691-INDICE)  -
                     (WS-NTOTPAG + WS-NTAXPAG) -
                     (WS-NTOTRET + WS-NTAXRET)
           ELSE
              MOVE COCD6701-GREFINV
                TO COCV5691-D-REFINVOICE(COCV5691-INDICE)
              MOVE COCD6701-NIDINVOICE
                TO COCV5691-D-NIDINVOICE(COCV5691-INDICE)
              MOVE ZEROS
                TO COCV5691-D-NSEQ(COCV5691-INDICE)
              MOVE COCD6701-NIDPROJECTO
                TO COCV5691-D-NIDPROJECTO(COCV5691-INDICE)
              MOVE COCD6701-GCLIENTE
                TO COCV5691-D-GCLIENTE(COCV5691-INDICE)
              MOVE COCD6701-DDATAINSER
                TO COCV5691-D-DDATAINSER(COCV5691-INDICE)
              MOVE COCD6701-DDATAEMISS
                TO COCV5691-D-DDATAEMISS(COCV5691-INDICE)
              MOVE COCD6701-DDATAEMIS2
                TO COCV5691-D-DDATAEMIS2(COCV5691-INDICE)
              MOVE COCD6701-DDATEDUE
                TO COCV5691-D-DDATEDUE(COCV5691-INDICE)
              MOVE COCD6701-DPAG
                TO COCV5691-D-DDATEPAG(COCV5691-INDICE)
              MOVE COCD6701-CPRAZO
                TO COCV5691-D-CPRAZO(COCV5691-INDICE)
              MOVE COCD6701-CSTATUS
                TO COCV5691-D-CSTATUS(COCV5691-INDICE)
              MOVE COCD6701-CMOEDA
                TO COCV5691-D-CMOEDA(COCV5691-INDICE)
              MOVE COCD6701-CIMPOSTO
                TO COCV5691-D-CIMPOSTO(COCV5691-INDICE)

              IF COCD6701-NTOTALAMOUNT NOT = ZEROS
                 IF COCD6701-CMOEDA EQUAL COCD3606-CMOEDA
                    MOVE COCD6701-NTOTALAMOUNT TO WS-NTOTALAMOUNT
                    MOVE COCD6701-NTAXAMOUNT   TO WS-NTAXAMOUNT
                    MOVE COCD6701-NTOTPAG      TO WS-NTOTPAG
                    MOVE COCD6701-NTAXPAG      TO WS-NTAXPAG
                    MOVE COCD6701-NTOTRET      TO WS-NTOTRET
                    MOVE COCD6701-NTAXRET      TO WS-NTAXRET
                 ELSE
      *    ATE SEREM CRIADOS OS CONTRAVALORES PARA NTOTPAG, NTAXPAG
      *    NTOTRET E NTAXRET CONSIDERA-SE O CONTRAVALOR DO VALOR E TAXA
      *    DA FATURA NO PRESSUPOSTO DE QUE O PAGAMENTO DE FATURAS EM
      *    MOEDA DIFERENTE DA MOEDA DA EMPRESA NAO TERAO PAGAMENTOS
      *    PARCIAIS NEM RETENCOES DE VALOR E TAXA
                    MOVE COCD6701-NTOTCTRV     TO WS-NTOTALAMOUNT
                    MOVE COCD6701-NTAXCTRV     TO WS-NTAXAMOUNT
                    MOVE ZEROS                 TO WS-NTOTPAG
                    MOVE ZEROS                 TO WS-NTAXPAG
                    MOVE ZEROS                 TO WS-NTOTRET
                    MOVE ZEROS                 TO WS-NTAXRET
                 END-IF
              ELSE
                 IF COCD6701-CMOEDA EQUAL COCD3606-CMOEDA
                    MOVE COCD6701-MVOR         TO WS-NTOTALAMOUNT
                 ELSE
      *     COM A DESPESA POR EMITIR MVOR E PREENCHIDO COM ZERO
      *     ATE SER CRIADO O CONTRAVALOR PARA O VALOR ORCAMENTADO (MVOR)
                    MOVE ZEROS                 TO WS-NTOTALAMOUNT
                 END-IF

                 MOVE ZEROS                 TO WS-NTAXAMOUNT
                                               WS-NTOTPAG
                                               WS-NTAXPAG
                                               WS-NTOTRET
                                               WS-NTAXRET
              END-IF

              MOVE WS-NTOTALAMOUNT
                TO COCV5691-D-NTOTALAMOUNT(COCV5691-INDICE)
              MOVE WS-NTAXAMOUNT
                TO COCV5691-D-NTAXAMOUNT(COCV5691-INDICE)
              MOVE WS-NTOTPAG
                TO COCV5691-D-NTOTVALREC (COCV5691-INDICE)
              MOVE WS-NTAXPAG
                TO COCV5691-D-NTOTTAXREC (COCV5691-INDICE)
              MOVE WS-NTOTRET
                TO COCV5691-D-NTOTVALRET (COCV5691-INDICE)
              MOVE WS-NTAXRET
                TO COCV5691-D-NTOTTAXRET (COCV5691-INDICE)

              COMPUTE COCV5691-D-NVALTOT(COCV5691-INDICE) =
                      WS-NTOTALAMOUNT +
                      WS-NTAXAMOUNT

              COMPUTE COCV5691-D-NVALLIQ(COCV5691-INDICE)  =
                      COCV5691-D-NVALTOT(COCV5691-INDICE)  -
                     (WS-NTOTPAG + WS-NTAXPAG) -
                     (WS-NTOTRET + WS-NTAXRET)
           END-IF.

       2079-FORMATA-OCCURS-1-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2090-CLOSE-CUR1
      *--------------------------------------------------------------
       2090-CLOSE-CUR1.

           IF VIAL0001-DEBUG-SIM
              MOVE '2090-CLOSE-CUR1' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF SW-RECEITAS
              EXEC SQL
                  CLOSE CURCOT50
              END-EXEC
           ELSE
              EXEC SQL
                  CLOSE CURCOT67
              END-EXEC
           END-IF.

       2099-CLOSE-CUR1-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     8000-CALCULO-CREVPG
      *--------------------------------------------------------------
       8000-CALCULO-CREVPG.

           IF VIAL0001-DEBUG-SIM
              MOVE '8000-CALCULO-CREVPG ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD3606-CREVPG TO WS-CREVPG.

      *--- Soma (nn) dias à DDATEDUE
           IF WS-CREVPG-01 = CON-D
              INITIALIZE VIAL1000-AREA-COMUNICACAO
              MOVE CON-33              TO VIAL1000-COD-PROCESSO

              MOVE COCD6701-DDATEDUE   TO VIATW300-DATA10
              PERFORM VIATP300-CONV-DATA108
                 THRU VIATP300-CONV-DATA108-EXIT
              MOVE VIATW300-DATA8      TO VIAL1000-DAT-INPUT1

              MOVE WS-CREVPG-02        TO VIAL1000-PRZ-D

              PERFORM VIAP1000-ROTINA-DATAS
                 THRU VIAP1000-EXIT

              MOVE VIAL1000-DAT-RES-ED TO WS-DATA-BOA
           END-IF.

      *--- Calcula o primeiro dia útil do mês seguinte
      *--- da data do processamento
           IF WS-CREVPG = CON-U01
              INITIALIZE VIAL1000-AREA-COMUNICACAO
              MOVE CON-11              TO VIAL1000-COD-PROCESSO

              MOVE VIAL0001-DATA-PROCESSO-I TO WS-TRATA-DATA
              MOVE 01                       TO WS-TRATA-DATA-DIA
              ADD  01                       TO WS-TRATA-DATA-MES
              IF WS-TRATA-DATA-MES > 12
                 MOVE 01 TO WS-TRATA-DATA-MES
                 ADD  01 TO WS-TRATA-DATA-ANO
              END-IF

              MOVE WS-TRATA-DATA       TO VIATW300-DATA10
              PERFORM VIATP300-CONV-DATA108
                 THRU VIATP300-CONV-DATA108-EXIT
              MOVE VIATW300-DATA8      TO VIAL1000-DAT-INPUT1

              PERFORM VIAP1000-ROTINA-DATAS
                 THRU VIAP1000-EXIT

              MOVE VIAL1000-DAT-RES-ED TO WS-DATA-BOA
           END-IF.

      *--- Calcula o ultimo dia útil do mês seguinte
      *--- da data do processamento
           IF WS-CREVPG = CON-U99
              INITIALIZE VIAL1000-AREA-COMUNICACAO
              MOVE CON-03              TO VIAL1000-COD-PROCESSO

              MOVE VIAL0001-DATA-PROCESSO-I TO WS-TRATA-DATA
              MOVE 01                       TO WS-TRATA-DATA-DIA
              ADD  01                       TO WS-TRATA-DATA-MES
              IF WS-TRATA-DATA-MES > 12
                 MOVE 01 TO WS-TRATA-DATA-MES
                 ADD  01 TO WS-TRATA-DATA-ANO
              END-IF

              MOVE WS-TRATA-DATA       TO VIATW300-DATA10
              PERFORM VIATP300-CONV-DATA108
                 THRU VIATP300-CONV-DATA108-EXIT
              MOVE VIATW300-DATA8      TO VIAL1000-DAT-INPUT1

              PERFORM VIAP1000-ROTINA-DATAS
                 THRU VIAP1000-EXIT

              MOVE VIAL1000-DAT-RES-ED TO WS-DATA-BOA
           END-IF.

       8000-CALCULO-CREVPG-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF COCV5690-NMAXLIST EQUAL ZEROES
              MOVE VIAL0001-CAPLIC         TO ARCL0039-CAPLIC
              MOVE VIAL0001-COPCAO         TO ARCL0039-COPCAO
              PERFORM ARCR0039-NMAXLIST
                 THRU ARCR0039-NMAXLIST-EXIT

              IF ETCL0002-ABEND-DB2
                 MOVE ETCL0002-TABLE-NAME  TO VIAL0002-TABLE-NAME
                 MOVE ETCL0002-SQLCA       TO VIAL0002-SQLCA
              END-IF

              MOVE ARCL0039-NMAXLIST       TO COCV5691-NMAXLIST
           ELSE
              MOVE COCV5690-NMAXLIST       TO COCV5691-NMAXLIST
           END-IF.

           MOVE COCV5691-MSG       TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV5691-LENGTH    TO VIAL0001-LENGTH-MSG.
           MOVE COCV5691-NR-CAMPOS TO VIAL0001-NR-CAMPOS.
           MOVE COCV5691-INDICE    TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *==============================================================
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY VIAP1000.
           COPY VIATP300.
           COPY ARCR0039.
