       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI56901.
      ******************************************************************
      *     PROGRAMA COI56901.                                         *
      *                                                                *
      *     VIA Controlo de Resultados - detalhe                       *
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI56901         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV5690.
       COPY COCV5691.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY TGCL1000.
       COPY TGCL2000.
       COPY TGCK0002.

      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 WS-PROGNAME            PIC X(08) VALUE 'COI56901'.

           05 CON-CTABELA-CSIGLA     PIC X(05) VALUE 'CO510'.
           05 CON-CTABELA-CMES       PIC X(05) VALUE 'AR112'.
           05 CON-CTABELA-AANO       PIC X(05) VALUE 'AR111'.

           05 CON-CTABELA-D-PROJECTO PIC X(05) VALUE 'CO151'.
           05 CON-CTABELA-D-CONTA    PIC X(05) VALUE 'CO153'.
           05 CON-CTABELA-D-CPRAZO   PIC X(05) VALUE 'AR046'.
           05 CON-CTABELA-D-CSTATUS  PIC X(05) VALUE 'CO100'.
           05 CON-CTABELA-D-CSTATUS2 PIC X(05) VALUE 'CO005'.
           05 CON-CTABELA-D-CIMPOSTO PIC X(05) VALUE 'CO023'.
           05 CON-CTABELA-D-CMOEDA   PIC X(05) VALUE 'AR041'.
      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-CTABELA                   PIC X(05) VALUE SPACES.
           05 WS-CCOD                      PIC X(40) VALUE SPACES.
           05 WS-C2COD                     PIC X(40) VALUE SPACES.
           05 WS-CLASSE-RESULT           PIC X(02) VALUE SPACES.
              88 SW-RECEITAS                       VALUE '01'.
              88 SW-DESPESAS-FIX                   VALUE '02'.
              88 SW-DESPESAS-VAR                   VALUE '03'.
              88 SW-IMPOSTOS                       VALUE '04'.
              88 SW-AMORTIZACOES                   VALUE '05'.
              88 SW-IMPARIDADES                    VALUE '06'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI56901         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

            EXEC SQL INCLUDE VIAP0009 END-EXEC.

      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.

           MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID

           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV5690-MSG.
           MOVE VIAL0001-MENSAGEM-OUTPUT   TO COCV5691-MSG.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID

           IF VIAL0001-DEBUG-SIM
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV5690-CRUBRICA               TO WS-CLASSE-RESULT

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-DESC-CAMPOS
                 THRU 2100-DESC-CAMPOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-DESC-CAMPOS
      *--------------------------------------------------------------
       2100-DESC-CAMPOS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2100-DESC-CAMPOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV5691-XDESCCSIGLA    EQUAL SPACES
           AND COCV5691-CSIGLA     NOT EQUAL SPACES
              MOVE CON-CTABELA-CSIGLA    TO WS-CTABELA
              MOVE COCV5691-CSIGLA       TO WS-CCOD
              MOVE SPACES                TO WS-C2COD

              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL1000-GDESC     TO COCV5691-XDESCCSIGLA
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV5691-XDESCAANO EQUAL SPACES
           AND COCV5691-AANO    NOT EQUAL SPACES
              MOVE CON-CTABELA-AANO
                TO WS-CTABELA
              MOVE COCV5691-AANO
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV5691-XDESCAANO
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV5691-XDESCCMES   EQUAL SPACES
           AND COCV5691-CMES    NOT EQUAL SPACES
              MOVE CON-CTABELA-CMES
                TO WS-CTABELA
              MOVE COCV5691-CMES
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV5691-XDESCCMES
              END-IF
           END-IF.

           IF VIAL0002-SEM-ERROS
              MOVE ZEROS TO COCV5691-INDICE
              PERFORM 2400-DESC-OCCURS
                 THRU 2400-DESC-OCCURS-EXIT
                UNTIL COCV5691-PAGINA-CHEIA
                   OR COCV5691-INDICE >= VIAL0001-OCORRENCIAS
           END-IF.

       2100-DESC-CAMPOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2200-VAL-TAB-ART05
      *--------------------------------------------------------------
       2200-VAL-TAB-ART05.

           INITIALIZE TGCL2000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL2000-CTABELA
           MOVE WS-CCOD                   TO TGCL2000-CCOD
           MOVE WS-C2COD                  TO TGCL2000-C2COD

           PERFORM CALL-TGCP2000
              THRU CALL-TGCP2000-EXIT.

       2200-VAL-TAB-ART05-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2300-VAL-TAB-OUTRA
      *--------------------------------------------------------------
       2300-VAL-TAB-OUTRA.

           INITIALIZE TGCL1000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL1000-CTABELA
           MOVE WS-CCOD                   TO TGCL1000-CCOD
           MOVE WS-C2COD                  TO TGCL1000-C2COD

           PERFORM CALL-TGCP1000
              THRU CALL-TGCP1000-EXIT.

       2300-VAL-TAB-OUTRA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2400-DESC-OCCURS
      *--------------------------------------------------------------
       2400-DESC-OCCURS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2400-DESC-OCCURS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           ADD 1  TO COCV5691-INDICE.

           IF  VIAL0002-SEM-ERROS
           AND COCV5691-D-NIDPROJECTO(COCV5691-INDICE) NOT EQUAL SPACES
              IF SW-RECEITAS
                 MOVE CON-CTABELA-D-PROJECTO               TO WS-CTABELA
              ELSE
                 MOVE CON-CTABELA-D-CONTA                  TO WS-CTABELA
              END-IF
              MOVE COCV5691-D-NIDPROJECTO(COCV5691-INDICE) TO WS-CCOD
              MOVE SPACES                                  TO WS-C2COD

              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL1000-GDESC
                   TO COCV5691-XDESCD-NIDPROJECTO(COCV5691-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV5691-XDESCD-NIDPROJECTO(COCV5691-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV5691-D-CPRAZO(COCV5691-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-CPRAZO                TO WS-CTABELA
              MOVE COCV5691-D-CPRAZO(COCV5691-INDICE) TO WS-CCOD
              MOVE SPACES                              TO WS-C2COD

              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV5691-XDESCD-CPRAZO(COCV5691-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV5691-XDESCD-CPRAZO(COCV5691-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV5691-D-CSTATUS(COCV5691-INDICE) NOT EQUAL SPACES
              IF SW-RECEITAS
                 MOVE CON-CTABELA-D-CSTATUS            TO WS-CTABELA
              ELSE
                 MOVE CON-CTABELA-D-CSTATUS2           TO WS-CTABELA
              END-IF
              MOVE COCV5691-D-CSTATUS(COCV5691-INDICE) TO WS-CCOD
              MOVE SPACES                              TO WS-C2COD

              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV5691-XDESCD-CSTATUS(COCV5691-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV5691-XDESCD-CSTATUS(COCV5691-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV5691-D-CIMPOSTO(COCV5691-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-CIMPOSTO              TO WS-CTABELA
              MOVE COCV5691-D-CIMPOSTO(COCV5691-INDICE) TO WS-CCOD
              MOVE SPACES                              TO WS-C2COD

              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV5691-XDESCD-CIMPOSTO(COCV5691-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV5691-XDESCD-CIMPOSTO(COCV5691-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV5691-D-CMOEDA(COCV5691-INDICE) NOT EQUAL SPACES
              MOVE CON-CTABELA-D-CMOEDA                TO WS-CTABELA
              MOVE COCV5691-D-CMOEDA(COCV5691-INDICE) TO WS-CCOD
              MOVE SPACES                              TO WS-C2COD

              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT

              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV5691-XDESCD-CMOEDA(COCV5691-INDICE)
              ELSE
                 MOVE SPACES
                 TO COCV5691-XDESCD-CMOEDA(COCV5691-INDICE)
                 IF VIAL0002-ERROS-FUNCAO
                     SET VIAL0002-SEM-ERROS     TO TRUE
                 END-IF
              END-IF
           END-IF.

       2400-DESC-OCCURS-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              MOVE 'COCV5691-MSG' TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV5691-MSG  TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV5691-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV5690-MSG               TO VIAL0001-MENSAGEM-INPUT.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *==============================================================
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY TGCP1000.
           COPY TGCP2000.
