       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI62201.
      ******************************************************************
      *     PROGRAMA COI62201.
      *
      *      Pessoas Particulares
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI62201         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV6220.
       COPY COCV6221.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY TGCL1000.
       COPY TGCL2000.
       COPY TGCK0002.
      *
      *
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 WS-PROGNAME  PIC X(08) VALUE 'COI62201'.
           05 CON-CTABELA-CEMPRESA  PIC X(05) VALUE 'CO500'.
           05 CON-CTABELA-CUTILIZA  PIC X(05) VALUE 'AR001'.
           05 CON-CTABELA-ISTATUS   PIC X(05) VALUE 'CO009'.
           05 CON-CTABELA-CTITULO   PIC X(05) VALUE 'CO008'.
           05 CON-CTABELA-CCATPROF  PIC X(05) VALUE 'CO010'.
           05 CON-CTABELA-CHABILIT  PIC X(05) VALUE 'CO011'.
           05 CON-CTABELA-CTIPDOC   PIC X(05) VALUE 'CO014'.
           05 CON-CTABELA-CGENERO   PIC X(05) VALUE 'CL002'.
           05 CON-CTABELA-CESTCIVIL PIC X(05) VALUE 'AR020'.
           05 CON-CTABELA-CCONTACTO PIC X(05) VALUE 'GR012'.
           05 CON-CTABELA-CIDIOMA   PIC X(05) VALUE 'AR001'.
           05 CON-CTABELA-CTIPVIN   PIC X(05) VALUE 'CO600'.
           05 CON-CTABELA-CNAC      PIC X(05) VALUE 'AR047'.
      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-CTABELA                   PIC X(05) VALUE SPACES.
           05 WS-CCOD                      PIC X(40) VALUE SPACES.
           05 WS-C2COD                     PIC X(40) VALUE SPACES.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI62201         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
      *
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID

      *    IF VIAL0001-DEBUG-SIM
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV6220-MSG.
           MOVE VIAL0001-MENSAGEM-OUTPUT   TO COCV6221-MSG.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID

      *    IF VIAL0001-DEBUG-SIM
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-DESC-CAMPOS
                 THRU 2100-DESC-CAMPOS-EXIT
           END-IF
           .
       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-DESC-CAMPOS
      *--------------------------------------------------------------
       2100-DESC-CAMPOS.
      *
           MOVE '2100-DESC-CAMPOS' TO VIAL0015-CALLER-ID

      *    IF VIAL0001-DEBUG-SIM
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.
      *
           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCEMPRESA EQUAL SPACES
           AND COCV6221-CEMPRESA NOT EQUAL SPACES
              MOVE CON-CTABELA-CEMPRESA
                TO WS-CTABELA
              MOVE COCV6221-CEMPRESA
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL1000-GDESC
                   TO COCV6221-XDESCCEMPRESA
              END-IF
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCUTILIZA EQUAL SPACES
           AND COCV6221-CUTILIZA NOT EQUAL SPACES
              MOVE CON-CTABELA-CUTILIZA
                TO WS-CTABELA
              MOVE COCV6221-CUTILIZA
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL1000-GDESC
                   TO COCV6221-XDESCCUTILIZA
              END-IF
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCISTATUS EQUAL SPACES
           AND COCV6221-ISTATUS NOT EQUAL SPACES
              MOVE CON-CTABELA-ISTATUS
                TO WS-CTABELA
              MOVE COCV6221-ISTATUS
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV6221-XDESCISTATUS
              END-IF
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCTITULO EQUAL SPACES
           AND COCV6221-CTITULO NOT EQUAL SPACES
              MOVE CON-CTABELA-CTITULO
                TO WS-CTABELA
              MOVE COCV6221-CTITULO
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV6221-XDESCCTITULO
              END-IF
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCCATPROF EQUAL SPACES
           AND COCV6221-CCATPROF NOT EQUAL SPACES
              MOVE CON-CTABELA-CCATPROF
                TO WS-CTABELA
              MOVE COCV6221-CCATPROF
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV6221-XDESCCCATPROF
              END-IF
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCHABILIT EQUAL SPACES
           AND COCV6221-CHABILIT NOT EQUAL SPACES
              MOVE CON-CTABELA-CHABILIT
                TO WS-CTABELA
              MOVE COCV6221-CHABILIT
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV6221-XDESCCHABILIT
              END-IF
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCTIPDOC EQUAL SPACES
           AND COCV6221-CTIPDOC NOT EQUAL SPACES
              MOVE CON-CTABELA-CTIPDOC
                TO WS-CTABELA
              MOVE COCV6221-CTIPDOC
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV6221-XDESCCTIPDOC
              END-IF
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCTIPDOC2 EQUAL SPACES
           AND COCV6221-CTIPDOC2 NOT EQUAL SPACES
              MOVE CON-CTABELA-CTIPDOC
                TO WS-CTABELA
              MOVE COCV6221-CTIPDOC2
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV6221-XDESCCTIPDOC2
              END-IF
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCGENERO EQUAL SPACES
           AND COCV6221-CGENERO NOT EQUAL SPACES
              MOVE CON-CTABELA-CGENERO
                TO WS-CTABELA
              MOVE COCV6221-CGENERO
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV6221-XDESCCGENERO
              END-IF
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCESTCIVIL EQUAL SPACES
           AND COCV6221-CESTCIVIL NOT EQUAL SPACES
              MOVE CON-CTABELA-CESTCIVIL
                TO WS-CTABELA
              MOVE COCV6221-CESTCIVIL
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV6221-XDESCCESTCIVIL
              END-IF
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCCONTACTO EQUAL SPACES
           AND COCV6221-CCONTACTO NOT EQUAL SPACES
              MOVE CON-CTABELA-CCONTACTO
                TO WS-CTABELA
              MOVE COCV6221-CCONTACTO
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV6221-XDESCCCONTACTO
              END-IF
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCIDIOMA EQUAL SPACES
           AND COCV6221-CIDIOMA NOT EQUAL SPACES
              MOVE CON-CTABELA-CIDIOMA
                TO WS-CTABELA
              MOVE COCV6221-CIDIOMA
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV6221-XDESCCIDIOMA
              END-IF
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCTIPVIN EQUAL SPACES
           AND COCV6221-CTIPVIN NOT EQUAL SPACES
              MOVE CON-CTABELA-CTIPVIN
                TO WS-CTABELA
              MOVE COCV6221-CTIPVIN
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV6221-XDESCCTIPVIN
              END-IF
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV6221-XDESCCNAC    EQUAL SPACES
           AND COCV6221-CNAC    NOT EQUAL SPACES
              MOVE CON-CTABELA-CNAC
                TO WS-CTABELA
              MOVE COCV6221-CNAC
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF VIAL0002-SEM-ERROS
                 MOVE TGCL2000-GDESC
                   TO COCV6221-XDESCCNAC
              END-IF
           END-IF.

       2100-DESC-CAMPOS-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2200-VAL-TAB-ART05
      *--------------------------------------------------------------
       2200-VAL-TAB-ART05.
      *
           INITIALIZE TGCL2000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL2000-CTABELA
           MOVE WS-CCOD                   TO TGCL2000-CCOD
           MOVE WS-C2COD                  TO TGCL2000-C2COD

           PERFORM CALL-TGCP2000
              THRU CALL-TGCP2000-EXIT.

       2200-VAL-TAB-ART05-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2300-VAL-TAB-OUTRA
      *--------------------------------------------------------------
       2300-VAL-TAB-OUTRA.
      *

           INITIALIZE TGCL1000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL1000-CTABELA
           MOVE WS-CCOD                   TO TGCL1000-CCOD
           MOVE WS-C2COD                  TO TGCL1000-C2COD

           PERFORM CALL-TGCP1000
              THRU CALL-TGCP1000-EXIT.

       2300-VAL-TAB-OUTRA-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID

      *    IF VIAL0001-DEBUG-SIM
      *       MOVE 'COCV6221-MSG' TO VIAL0015-CAMPO-NM(1)
      *       MOVE  COCV6221-MSG  TO VIAL0015-CAMPO-VLR(1)
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.

           MOVE COCV6221-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV6220-MSG               TO VIAL0001-MENSAGEM-INPUT.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY TGCP1000.
           COPY TGCP2000.

