       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI62406.
      ******************************************************************
      *     PROGRAMA COI62406.                                         *
      *                                                                *
      *     Dados Complementares Pessoas
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI62406         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD7301 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV6240.
       COPY COCV6241.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0010.
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.
       COPY VIAL1000.
       COPY VIATW300.
      *
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT7301 PIC X(08) VALUE 'COVT7301'.

      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME     PIC  X(08) VALUE 'COI62406'.
           05 WS-IBAN                      PIC X(34).
           05 FILLER REDEFINES WS-IBAN.
              10 WS-IBAN-01                PIC X(02).
              10 WS-IBAN-02                PIC X(02).
              10 WS-IBAN-03                PIC X(21).
              10 WS-IBAN-04                PIC X(09).
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI62406         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2000-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3000-FINAL-PROGRAMA-EXIT.
      *
       0000-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *--------------------------------------------------------------
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV6240-MSG.
           MOVE COCV6240-ASE               TO COCV6241-ASE.
      *
       1000-INICIO-PROGRAMA-EXIT.
           EXIT.

      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *--------------------------------------------------------------
           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE COCV6240-ADE               TO COCV6241-ADE.
      *
           IF VIAL0002-SEM-ERROS
              PERFORM 2200-VALIDACOES
                 THRU 2200-VALIDACOES-EXIT
           END-IF.
      *
           IF VIAL0002-SEM-ERROS
              PERFORM 2300-MODIFICA-DADOS
                 THRU 2300-MODIFICA-DADOS-EXIT
           END-IF.
      *
       2000-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
       2200-VALIDACOES.
      *--------------------------------------------------------------
           IF VIAL0001-DEBUG-SIM
              MOVE '2200-VALIDACOES' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE COCV6240-CNIB TO WS-IBAN.

           IF  VIAL0002-SEM-ERROS
           AND COCV6240-CNIB NOT EQUAL SPACES
           AND WS-IBAN-01 NUMERIC
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-STATUS-ACTIVO TO COCV6241-CNIB-S
               MOVE COCK0001-CIBAN-INV     TO COCV6241-CNIB-MSG
               MOVE COCK0002-CAPLIC        TO COCV6241-CNIB-CAPLIC
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV6240-CNIB NOT EQUAL SPACES
           AND WS-IBAN-02 NOT NUMERIC
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-STATUS-ACTIVO TO COCV6241-CNIB-S
               MOVE COCK0001-CIBAN-INV     TO COCV6241-CNIB-MSG
               MOVE COCK0002-CAPLIC        TO COCV6241-CNIB-CAPLIC
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV6240-CNIB NOT EQUAL SPACES
           AND WS-IBAN-03 NOT NUMERIC
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-STATUS-ACTIVO TO COCV6241-CNIB-S
               MOVE COCK0001-CIBAN-INV     TO COCV6241-CNIB-MSG
               MOVE COCK0002-CAPLIC        TO COCV6241-CNIB-CAPLIC
           END-IF.

       2200-VALIDACOES-EXIT.
           EXIT.

      *--------------------------------------------------------------
       2300-MODIFICA-DADOS.
      *--------------------------------------------------------------
           IF VIAL0001-DEBUG-SIM
              MOVE '2300-MODIFICA-DADOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE COCV6240-ZCUNICO           TO COCD7301-ZCUNICO.
           MOVE COCV6240-NVENC             TO COCD7301-NVENC  .
           MOVE COCV6240-NOUTABN           TO COCD7301-NOUTABN.
           MOVE COCV6240-NDEPEND           TO COCD7301-NDEPEND.
           MOVE COCV6240-NHORSEM           TO COCD7301-NHORSEM.
           MOVE COCV6240-CNIB              TO COCD7301-CNIB   .
           MOVE COCV6240-CSNS              TO COCD7301-CSNS   .
           MOVE VIAL0001-CUTILIZA-I        TO COCD7301-CUSERID.
      *
           EXEC SQL
                 UPDATE
                COVT7301
                SET
                       ZCUNICO    = :COCD7301-ZCUNICO
                     , NVENC      = :COCD7301-NVENC
                     , NOUTABN    = :COCD7301-NOUTABN
                     , NDEPEND    = :COCD7301-NDEPEND
                     , NHORSEM    = :COCD7301-NHORSEM
                     , CNIB       = :COCD7301-CNIB
                     , CSNS       = :COCD7301-CSNS
                     , CUSERID    = :COCD7301-CUSERID
                     , HTIMEST    = CURRENT TIMESTAMP
                 WHERE
                    ZCUNICO = :COCD7301-ZCUNICO
           END-EXEC
      *
           MOVE CON-COVT7301 TO VIAL0002-TABLE-NAME.
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           IF VIAL0002-SEM-ERROS
              IF DB2-NOTFND
                 MOVE VIAK0002-ERROS-FUNCAO
                   TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV6241-ZCUNICO-S
                    MOVE COCK0001-CPESSOA-N-EXISTS
                      TO COCV6241-ZCUNICO-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV6241-ZCUNICO-CAPLIC
              ELSE
                 IF NOT DB2-OK
                    MOVE VIAK0002-ABEND-DB2
                      TO VIAL0002-IND-ERROS
                    MOVE VIAK0001-ERRO-DB2
                      TO VIAL0002-COD-ERRO-GRAVE
                 END-IF
              END-IF
           ELSE
              MOVE VIAK0002-ABEND-DB2
                TO VIAL0002-IND-ERROS
              MOVE VIAK0001-ERRO-DB2
                TO VIAL0002-COD-ERRO-GRAVE
           END-IF.
      *
       2300-MODIFICA-DADOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE COCV6241-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV6241-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV6241-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES                     TO VIAL0001-OCORRENCIAS.
      *
       3000-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0010.
           COPY VIAP0016.
           COPY VIAP1000.
           COPY VIATP300.
