       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI62302.
      ******************************************************************
      *     PROGRAMA COI62302.
      *
      *     Emissão Ficha Cadastro Pessoal
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI62302         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD5303 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV6230.
       COPY COCV6231.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.
      *
      *
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT5303 PIC X(08) VALUE 'COVT5303'.
      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME            PIC  X(08) VALUE 'COI62302'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI62302         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
      *
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.
      *
           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.
      *
           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA'  TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV6230-MSG.
           MOVE COCV6230-ASE               TO COCV6231-ASE.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE COCV6230-ADE       TO COCV6231-ADE.
      *
           IF VIAL0002-SEM-ERROS
              PERFORM 2100-OBTEM-DADOS
                 THRU 2199-OBTEM-DADOS-EXIT
           END-IF.
      *
       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-OBTEM-DADOS
      *--------------------------------------------------------------
       2100-OBTEM-DADOS.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2100-OBTEM-DADOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE COCV6230-CPESSOA           TO COCD5303-CPESSOA
      *
           EXEC SQL
                 SELECT
                       CPESSOA
                     , CTIPO
                     , ZCUNICO
                     , IVIA
                     , ISUBEMP
                     , ISUBREC
                     , ICLIENTE
                     , IOUTROS
                     , CEMPRESA
                     , NTRABALHADOR
                     , CUTILIZA
                     , CFUNCIONARIO
                     , GNOME
                     , GNOMER
                     , CPARMNEM
                     , ISTATUS
                     , CTITULO
                     , CCPP
                     , CHABILIT
                     , CTIPPARTI
                     , DADESAO
                     , DCANCEL
                     , CTIPDOC
                     , CNUMDOC
                     , CBENEFIC
                     , CCATPROF
                     , DNASC
                     , GLOCALIDADE
                     , DOBITO
                     , CGENERO
                     , CESTCIVIL
                     , CCONTACTO
                     , CIDIOMA
                     , CUSERID
                     , HTIMEST
                     , IENVCOMP
                     , CCUSTO
                     , CTARIFA
                     , CTIPDOC2
                     , CNUMDOC2
                 INTO
                       :COCD5303-CPESSOA
                     , :COCD5303-CTIPO
                     , :COCD5303-ZCUNICO
                     , :COCD5303-IVIA
                     , :COCD5303-ISUBEMP
                     , :COCD5303-ISUBREC
                     , :COCD5303-ICLIENTE
                     , :COCD5303-IOUTROS
                     , :COCD5303-CEMPRESA
                     , :COCD5303-NTRABALHADOR
                     , :COCD5303-CUTILIZA
                     , :COCD5303-CFUNCIONARIO
                     , :COCD5303-GNOME
                     , :COCD5303-GNOMER
                     , :COCD5303-CPARMNEM
                     , :COCD5303-ISTATUS
                     , :COCD5303-CTITULO
                     , :COCD5303-CCPP
                     , :COCD5303-CHABILIT
                     , :COCD5303-CTIPPARTI
                     , :COCD5303-DADESAO
                     , :COCD5303-DCANCEL
                     , :COCD5303-CTIPDOC
                     , :COCD5303-CNUMDOC
                     , :COCD5303-CBENEFIC
                     , :COCD5303-CCATPROF
                     , :COCD5303-DNASC
                     , :COCD5303-GLOCALIDADE
                     , :COCD5303-DOBITO
                     , :COCD5303-CGENERO
                     , :COCD5303-CESTCIVIL
                     , :COCD5303-CCONTACTO
                     , :COCD5303-CIDIOMA
                     , :COCD5303-CUSERID
                     , :COCD5303-HTIMEST
                     , :COCD5303-IENVCOMP
                     , :COCD5303-CCUSTO
                     , :COCD5303-CTARIFA
                     , :COCD5303-CTIPDOC2
                     , :COCD5303-CNUMDOC2
                 FROM COVT5303_PESSOAS
                 WHERE
                    CPESSOA = :COCD5303-CPESSOA
           END-EXEC
      *
           MOVE CON-COVT5303
             TO VIAL0002-TABLE-NAME.
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           IF VIAL0002-SEM-ERROS
              IF DB2-OK
                 IF VIAL0001-CRIACAO
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV6231-CPESSOA-S
                    MOVE COCK0001-CPESSOA-EXISTS
                      TO COCV6231-CPESSOA-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV6231-CPESSOA-CAPLIC
                 ELSE
                    MOVE COCD5303-CPESSOA
                      TO COCV6231-CPESSOA
                    MOVE COCD5303-CTIPO
                      TO COCV6231-CTIPO
                    MOVE COCD5303-ZCUNICO
                      TO COCV6231-ZCUNICO
                    MOVE COCD5303-IVIA
                      TO COCV6231-IVIA
                    MOVE COCD5303-ISUBEMP
                      TO COCV6231-ISUBEMP
                    MOVE COCD5303-ISUBREC
                      TO COCV6231-ISUBREC
                    MOVE COCD5303-ICLIENTE
                      TO COCV6231-ICLIENTE
                    MOVE COCD5303-IOUTROS
                      TO COCV6231-IOUTROS
                    MOVE COCD5303-CEMPRESA
                      TO COCV6231-CEMPRESA
                    MOVE COCD5303-NTRABALHADOR
                      TO COCV6231-NTRABALHADOR
                    MOVE COCD5303-CUTILIZA
                      TO COCV6231-CUTILIZA
                    MOVE COCD5303-CFUNCIONARIO
                      TO COCV6231-CFUNCIONARIO
                    MOVE COCD5303-GNOME
                      TO COCV6231-GNOME
                    MOVE COCD5303-GNOMER
                      TO COCV6231-GNOMER
                    MOVE COCD5303-CPARMNEM
                      TO COCV6231-CPARMNEM
                    MOVE COCD5303-ISTATUS
                      TO COCV6231-ISTATUS
                    MOVE COCD5303-CTITULO
                      TO COCV6231-CTITULO
                    MOVE COCD5303-CCPP
                      TO COCV6231-CCPP
                    MOVE COCD5303-CHABILIT
                      TO COCV6231-CHABILIT
                    MOVE COCD5303-CTIPPARTI
                      TO COCV6231-CTIPPARTI
                    MOVE COCD5303-DADESAO
                      TO COCV6231-DADESAO
                    MOVE COCD5303-DCANCEL
                      TO COCV6231-DCANCEL
                    MOVE COCD5303-CTIPDOC
                      TO COCV6231-CTIPDOC
                    MOVE COCD5303-CNUMDOC
                      TO COCV6231-CNUMDOC
                    MOVE COCD5303-CTIPDOC2
                      TO COCV6231-CTIPDOC2
                    MOVE COCD5303-CNUMDOC2
                      TO COCV6231-CNUMDOC2
                    MOVE COCD5303-CBENEFIC
                      TO COCV6231-CBENEFIC
                    MOVE COCD5303-CCATPROF
                      TO COCV6231-CCATPROF
                    MOVE COCD5303-DNASC
                      TO COCV6231-DNASC
                    MOVE COCD5303-GLOCALIDADE
                      TO COCV6231-GLOCALIDADE
                    MOVE COCD5303-DOBITO
                      TO COCV6231-DOBITO
                    MOVE COCD5303-CGENERO
                      TO COCV6231-CGENERO
                    MOVE COCD5303-CESTCIVIL
                      TO COCV6231-CESTCIVIL
                    MOVE COCD5303-CCONTACTO
                      TO COCV6231-CCONTACTO
                    MOVE COCD5303-CIDIOMA
                      TO COCV6231-CIDIOMA
                    MOVE COCD5303-CUSERID
                      TO COCV6231-CUSERID
                    MOVE COCD5303-HTIMEST
                      TO COCV6231-HTIMEST
                    MOVE COCD5303-IENVCOMP
                      TO COCV6231-IENVCOMP
                    MOVE COCD5303-CCUSTO
                      TO COCV6231-CCUSTO
                    MOVE COCD5303-CTARIFA
                      TO COCV6231-CTARIFA
                    IF NOT VIAL0001-VISUALIZACAO
                        CONTINUE
                    END-IF
                 END-IF
              ELSE
                 IF NOT VIAL0001-CRIACAO
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV6231-CPESSOA-S
                    MOVE COCK0001-CPESSOA-N-EXISTS
                      TO COCV6231-CPESSOA-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV6231-CPESSOA-CAPLIC
                 END-IF
              END-IF
           END-IF.
      *
       2199-OBTEM-DADOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE COCV6231-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV6231-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV6231-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES                     TO VIAL0001-OCORRENCIAS.
      *
       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
