       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI62203.
      ******************************************************************
      *     PROGRAMA COI62203.
      *
      *      Pessoas Particulares
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI62203         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV6220.
       COPY COCV6221.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY TGCL1000.
       COPY TGCL2000.
       COPY TGCK0002.
      *
      *
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 WS-PROGNAME  PIC X(08) VALUE 'COI62203'.
           05 CON-CTABELA-CEMPRESA   PIC X(05) VALUE 'CO500'.
           05 CON-CTABELA-CUTILIZA   PIC X(05) VALUE 'AR001'.
           05 CON-CTABELA-ISTATUS    PIC X(05) VALUE 'CO009'.
           05 CON-CTABELA-CTITULO    PIC X(05) VALUE 'CO008'.
           05 CON-CTABELA-CCATPROF   PIC X(05) VALUE 'CO010'.
           05 CON-CTABELA-CHABILIT   PIC X(05) VALUE 'CO011'.
           05 CON-CTABELA-CTIPDOC    PIC X(05) VALUE 'CO014'.
           05 CON-CTABELA-CGENERO    PIC X(05) VALUE 'CL002'.
           05 CON-CTABELA-CESTCIVIL  PIC X(05) VALUE 'AR020'.
           05 CON-CTABELA-CCONTACTO  PIC X(05) VALUE 'GR012'.
           05 CON-CTABELA-CIDIOMA    PIC X(05) VALUE 'AR001'.
           05 CON-CTABELA-CTIPVIN    PIC X(05) VALUE 'CO600'.
           05 CON-CTABELA-CNAC       PIC X(05) VALUE 'AR047'.
      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-CTABELA                   PIC X(05) VALUE SPACES.
           05 WS-CCOD                      PIC X(40) VALUE SPACES.
           05 WS-C2COD                     PIC X(40) VALUE SPACES.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI62203         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
      *
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
      *    IF VIAL0001-DEBUG-SIM
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV6220-MSG.
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV6221-MSG.
      *    MOVE VIAL0001-MENSAGEM-OUTPUT   TO COCV6221-MSG.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
      *    IF VIAL0001-DEBUG-SIM
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-VAL-CAMPOS
                 THRU 2100-VAL-CAMPOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-VAL-CAMPOS
      *--------------------------------------------------------------
       2100-VAL-CAMPOS.
      *
           MOVE '2100-VAL-CAMPOS' TO VIAL0015-CALLER-ID
      *    IF VIAL0001-DEBUG-SIM
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.
      *

           IF VIAL0002-SEM-ERROS AND COCV6220-CEMPRESA NOT EQUAL SPACES
              MOVE CON-CTABELA-CEMPRESA
                TO WS-CTABELA
              MOVE COCV6220-CEMPRESA
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL1000-CCOD-S      TO COCV6221-CEMPRESA-S
                 MOVE TGCL1000-CCOD-CAPLIC TO COCV6221-CEMPRESA-CAPLIC
                 MOVE TGCL1000-CCOD-MSG    TO COCV6221-CEMPRESA-MSG
                 MOVE TGCL1000-GDESC       TO COCV6221-XDESCCEMPRESA
              ELSE
                 MOVE TGCL1000-GDESC       TO COCV6220-XDESCCEMPRESA
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-CUTILIZA NOT EQUAL SPACES
              MOVE CON-CTABELA-CUTILIZA
                TO WS-CTABELA
              MOVE COCV6220-CUTILIZA
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL1000-CCOD-S      TO COCV6221-CUTILIZA-S
                 MOVE TGCL1000-CCOD-CAPLIC TO COCV6221-CUTILIZA-CAPLIC
                 MOVE TGCL1000-CCOD-MSG    TO COCV6221-CUTILIZA-MSG
                 MOVE TGCL1000-GDESC       TO COCV6221-XDESCCUTILIZA
              ELSE
                 MOVE TGCL1000-GDESC       TO COCV6220-XDESCCUTILIZA
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-ISTATUS NOT EQUAL SPACES
              MOVE CON-CTABELA-ISTATUS
                TO WS-CTABELA
              MOVE COCV6220-ISTATUS
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6221-ISTATUS-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6221-ISTATUS-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6221-ISTATUS-MSG
                 MOVE TGCL2000-GDESC       TO COCV6221-XDESCISTATUS
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6220-XDESCISTATUS
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-CTITULO NOT EQUAL SPACES
              MOVE CON-CTABELA-CTITULO
                TO WS-CTABELA
              MOVE COCV6220-CTITULO
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6221-CTITULO-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6221-CTITULO-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6221-CTITULO-MSG
                 MOVE TGCL2000-GDESC       TO COCV6221-XDESCCTITULO
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6220-XDESCCTITULO
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-CCATPROF NOT EQUAL SPACES
              MOVE CON-CTABELA-CCATPROF
                TO WS-CTABELA
              MOVE COCV6220-CCATPROF
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6221-CCATPROF-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6221-CCATPROF-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6221-CCATPROF-MSG
                 MOVE TGCL2000-GDESC       TO COCV6221-XDESCCCATPROF
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6220-XDESCCCATPROF
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-CHABILIT NOT EQUAL SPACES
              MOVE CON-CTABELA-CHABILIT
                TO WS-CTABELA
              MOVE COCV6220-CHABILIT
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6221-CHABILIT-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6221-CHABILIT-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6221-CHABILIT-MSG
                 MOVE TGCL2000-GDESC       TO COCV6221-XDESCCHABILIT
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6220-XDESCCHABILIT
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-CTIPDOC NOT EQUAL SPACES
              MOVE CON-CTABELA-CTIPDOC
                TO WS-CTABELA
              MOVE COCV6220-CTIPDOC
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6221-CTIPDOC-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6221-CTIPDOC-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6221-CTIPDOC-MSG
                 MOVE TGCL2000-GDESC       TO COCV6221-XDESCCTIPDOC
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6220-XDESCCTIPDOC
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-CTIPDOC2 NOT EQUAL SPACES
              MOVE CON-CTABELA-CTIPDOC
                TO WS-CTABELA
              MOVE COCV6220-CTIPDOC2
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6221-CTIPDOC2-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6221-CTIPDOC2-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6221-CTIPDOC2-MSG
                 MOVE TGCL2000-GDESC       TO COCV6221-XDESCCTIPDOC2
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6220-XDESCCTIPDOC2
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-CGENERO NOT EQUAL SPACES
              MOVE CON-CTABELA-CGENERO
                TO WS-CTABELA
              MOVE COCV6220-CGENERO
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6221-CGENERO-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6221-CGENERO-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6221-CGENERO-MSG
                 MOVE TGCL2000-GDESC       TO COCV6221-XDESCCGENERO
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6220-XDESCCGENERO
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-CESTCIVIL NOT EQUAL SPACES
              MOVE CON-CTABELA-CESTCIVIL
                TO WS-CTABELA
              MOVE COCV6220-CESTCIVIL
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6221-CESTCIVIL-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6221-CESTCIVIL-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6221-CESTCIVIL-MSG
                 MOVE TGCL2000-GDESC       TO COCV6221-XDESCCESTCIVIL
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6220-XDESCCESTCIVIL
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-CCONTACTO NOT EQUAL SPACES
              MOVE CON-CTABELA-CCONTACTO
                TO WS-CTABELA
              MOVE COCV6220-CCONTACTO
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6221-CCONTACTO-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6221-CCONTACTO-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6221-CCONTACTO-MSG
                 MOVE TGCL2000-GDESC       TO COCV6221-XDESCCCONTACTO
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6220-XDESCCCONTACTO
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-CIDIOMA NOT EQUAL SPACES
              MOVE CON-CTABELA-CIDIOMA
                TO WS-CTABELA
              MOVE COCV6220-CIDIOMA
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6221-CIDIOMA-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6221-CIDIOMA-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6221-CIDIOMA-MSG
                 MOVE TGCL2000-GDESC       TO COCV6221-XDESCCIDIOMA
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6220-XDESCCIDIOMA
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-CTIPVIN NOT EQUAL SPACES
              MOVE CON-CTABELA-CTIPVIN
                TO WS-CTABELA
              MOVE COCV6220-CTIPVIN
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6221-CTIPVIN-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6221-CTIPVIN-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6221-CTIPVIN-MSG
                 MOVE TGCL2000-GDESC       TO COCV6221-XDESCCTIPVIN
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6220-XDESCCTIPVIN
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6220-CNAC NOT EQUAL SPACES
              MOVE CON-CTABELA-CNAC
                TO WS-CTABELA
              MOVE COCV6220-CNAC
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6221-CNAC-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6221-CNAC-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6221-CNAC-MSG
                 MOVE TGCL2000-GDESC       TO COCV6221-XDESCCNAC
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6220-XDESCCNAC
              END-IF
           END-IF.
      *
       2100-VAL-CAMPOS-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2200-VAL-TAB-ART05
      *--------------------------------------------------------------
       2200-VAL-TAB-ART05.
      *
           MOVE '2200-VAL-TAB-ART05' TO VIAL0015-CALLER-ID

      *
           INITIALIZE TGCL2000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL2000-CTABELA
           MOVE WS-CCOD                   TO TGCL2000-CCOD
           MOVE WS-C2COD                  TO TGCL2000-C2COD

           PERFORM CALL-TGCP2000
              THRU CALL-TGCP2000-EXIT.

      *    IF VIAL0001-DEBUG-SIM
      *       MOVE '2200-VAL-TAB-ART05-EXIT' TO VIAL0015-CALLER-ID
      *       MOVE 'TGCL2000-CTABELA    '    TO VIAL0015-CAMPO-NM(1)
      *       MOVE  TGCL2000-CTABELA         TO VIAL0015-CAMPO-VLR(1)
      *       MOVE 'TGCL2000-CCOD       '    TO VIAL0015-CAMPO-NM(2)
      *       MOVE  TGCL2000-CCOD            TO VIAL0015-CAMPO-VLR(2)
      *       MOVE 'TGCL2000-C2COD      '    TO VIAL0015-CAMPO-NM(3)
      *       MOVE  TGCL2000-C2COD           TO VIAL0015-CAMPO-VLR(3)
      *       MOVE 'TGCL2000-GDESC      '    TO VIAL0015-CAMPO-NM(4)
      *       MOVE  TGCL2000-GDESC           TO VIAL0015-CAMPO-VLR(4)
      *       MOVE 'VIAL0002-IND-ERROS  '    TO VIAL0015-CAMPO-NM(5)
      *       MOVE  VIAL0002-IND-ERROS       TO VIAL0015-CAMPO-VLR(5)
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.

       2200-VAL-TAB-ART05-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2300-VAL-TAB-OUTRA
      *--------------------------------------------------------------
       2300-VAL-TAB-OUTRA.
      *
           MOVE '2300-VAL-TAB-OUTRA' TO VIAL0015-CALLER-ID

           INITIALIZE TGCL1000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL1000-CTABELA
           MOVE WS-CCOD                   TO TGCL1000-CCOD
           MOVE WS-C2COD                  TO TGCL1000-C2COD
		
           PERFORM CALL-TGCP1000
              THRU CALL-TGCP1000-EXIT.

      *    IF VIAL0001-DEBUG-SIM
      *       MOVE 'TGCL1000-CTABELA    '    TO VIAL0015-CAMPO-NM(1)
      *       MOVE  TGCL1000-CTABELA         TO VIAL0015-CAMPO-VLR(1)
      *       MOVE 'TGCL1000-CCOD       '    TO VIAL0015-CAMPO-NM(2)
      *       MOVE  TGCL1000-CCOD            TO VIAL0015-CAMPO-VLR(2)
      *       MOVE 'TGCL1000-C2COD      '    TO VIAL0015-CAMPO-NM(3)
      *       MOVE  TGCL1000-C2COD           TO VIAL0015-CAMPO-VLR(3)
      *       MOVE 'TGCL1000-GDESC      '    TO VIAL0015-CAMPO-NM(4)
      *       MOVE  TGCL1000-GDESC           TO VIAL0015-CAMPO-VLR(4)
      *       MOVE 'VIAL0002-IND-ERROS  '    TO VIAL0015-CAMPO-NM(5)
      *       MOVE  VIAL0002-IND-ERROS       TO VIAL0015-CAMPO-VLR(5)
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.

       2300-VAL-TAB-OUTRA-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
      *    IF VIAL0001-DEBUG-SIM
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.

           MOVE COCV6221-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV6220-MSG               TO VIAL0001-MENSAGEM-INPUT.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY TGCP1000.
           COPY TGCP2000.

