       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI65102.
      ******************************************************************
      *     PROGRAMA COI65102.
      *
      *     Histórico Contactos
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI65102         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD5600 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV6510.
       COPY COCV6511.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.
      *
      *
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT5600 PIC X(08) VALUE 'COVT5600'.
      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME            PIC  X(08) VALUE 'COI65102'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI65102         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
      *
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV6510-MSG.
           MOVE COCV6510-ASE       TO COCV6511-ASE.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV6510-ADE       TO COCV6511-ADE.



           IF VIAL0002-SEM-ERROS
              PERFORM 2100-OBTEM-DADOS
                 THRU 2199-OBTEM-DADOS-EXIT
           END-IF

           .
       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-OBTEM-DADOS
      *--------------------------------------------------------------
       2100-OBTEM-DADOS.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2100-OBTEM-DADOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV6510-ZCUNICO
             TO COCD5600-ZCUNICO
           MOVE COCV6510-ZSEQOCCUR
             TO COCD5600-ZSEQOCCUR

           EXEC SQL
                 SELECT
                       ZCUNICO
                     , ZSEQOCCUR
                     , ITELEFONE1
                     , ITELEFONE2
                     , ITELEFONE3
                     , IFAX
                     , IEMAILEMP
                     , IEMAILPROF
                     , IEMAILPES
                     , IMORADA
                     , IPAIS
                     , ICIDADE
                     , ICODPOST
                     , GTELEFONE1
                     , GTELEFONE2
                     , GTELEFONE3
                     , GFAX
                     , GEMAILEMP
                     , GEMAILPROF
                     , GEMAILPES
                     , GMORADA
                     , CPAIS
                     , GCIDADE
                     , CCODPOST
                     , CUSERID
                     , HTIMEST
                     , IENVCOMP
                 INTO
                       :COCD5600-ZCUNICO
                     , :COCD5600-ZSEQOCCUR
                     , :COCD5600-ITELEFONE1
                     , :COCD5600-ITELEFONE2
                     , :COCD5600-ITELEFONE3
                     , :COCD5600-IFAX
                     , :COCD5600-IEMAILEMP
                     , :COCD5600-IEMAILPROF
                     , :COCD5600-IEMAILPES
                     , :COCD5600-IMORADA
                     , :COCD5600-IPAIS
                     , :COCD5600-ICIDADE
                     , :COCD5600-ICODPOST
                     , :COCD5600-GTELEFONE1
                     , :COCD5600-GTELEFONE2
                     , :COCD5600-GTELEFONE3
                     , :COCD5600-GFAX
                     , :COCD5600-GEMAILEMP
                     , :COCD5600-GEMAILPROF
                     , :COCD5600-GEMAILPES
                     , :COCD5600-GMORADA
                     , :COCD5600-CPAIS
                     , :COCD5600-GCIDADE
                     , :COCD5600-CCODPOST
                     , :COCD5600-CUSERID
                     , :COCD5600-HTIMEST
                     , :COCD5600-IENVCOMP
                 FROM COVT5600_CONTACTOSH
                 WHERE
                    ZCUNICO = :COCD5600-ZCUNICO
                     AND ZSEQOCCUR = :COCD5600-ZSEQOCCUR
           END-EXEC


           MOVE CON-COVT5600
             TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
              IF DB2-OK
                 IF VIAL0001-CRIACAO
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV6511-ZCUNICO-S
                    MOVE COCK0001-ZCUNICO-EXISTS
                      TO COCV6511-ZCUNICO-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV6511-ZCUNICO-CAPLIC
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV6511-ZSEQOCCUR-S
                    MOVE COCK0001-ZSEQOCCUR-EXISTS
                      TO COCV6511-ZSEQOCCUR-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV6511-ZSEQOCCUR-CAPLIC
                 ELSE
                    MOVE COCD5600-ZCUNICO
                      TO COCV6511-ZCUNICO
                    MOVE COCD5600-ZSEQOCCUR
                      TO COCV6511-ZSEQOCCUR
                    MOVE COCD5600-ITELEFONE1
                      TO COCV6511-ITELEFONE1
                    MOVE COCD5600-ITELEFONE2
                      TO COCV6511-ITELEFONE2
                    MOVE COCD5600-ITELEFONE3
                      TO COCV6511-ITELEFONE3
                    MOVE COCD5600-IFAX
                      TO COCV6511-IFAX
                    MOVE COCD5600-IEMAILEMP
                      TO COCV6511-IEMAILEMP
                    MOVE COCD5600-IEMAILPROF
                      TO COCV6511-IEMAILPROF
                    MOVE COCD5600-IEMAILPES
                      TO COCV6511-IEMAILPES
                    MOVE COCD5600-IMORADA
                      TO COCV6511-IMORADA
                    MOVE COCD5600-IPAIS
                      TO COCV6511-IPAIS
                    MOVE COCD5600-ICIDADE
                      TO COCV6511-ICIDADE
                    MOVE COCD5600-ICODPOST
                      TO COCV6511-ICODPOST
                    MOVE COCD5600-GTELEFONE1
                      TO COCV6511-GTELEFONE1
                    MOVE COCD5600-GTELEFONE2
                      TO COCV6511-GTELEFONE2
                    MOVE COCD5600-GTELEFONE3
                      TO COCV6511-GTELEFONE3
                    MOVE COCD5600-GFAX
                      TO COCV6511-GFAX
                    MOVE COCD5600-GEMAILEMP
                      TO COCV6511-GEMAILEMP
                    MOVE COCD5600-GEMAILPROF
                      TO COCV6511-GEMAILPROF
                    MOVE COCD5600-GEMAILPES
                      TO COCV6511-GEMAILPES
                    MOVE COCD5600-GMORADA
                      TO COCV6511-GMORADA
                    MOVE COCD5600-CPAIS
                      TO COCV6511-CPAIS
                    MOVE COCD5600-GCIDADE
                      TO COCV6511-GCIDADE
                    MOVE COCD5600-CCODPOST
                      TO COCV6511-CCODPOST
                    IF NOT VIAL0001-VISUALIZACAO
                        CONTINUE
                    END-IF
                 END-IF
              ELSE
                 IF NOT VIAL0001-CRIACAO
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV6511-ZCUNICO-S
                    MOVE COCK0001-ZCUNICO-N-EXISTS
                      TO COCV6511-ZCUNICO-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV6511-ZCUNICO-CAPLIC
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV6511-ZSEQOCCUR-S
                    MOVE COCK0001-ZSEQOCCUR-N-EXISTS
                      TO COCV6511-ZSEQOCCUR-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV6511-ZSEQOCCUR-CAPLIC
                 END-IF
              END-IF
           END-IF.


       2199-OBTEM-DADOS-EXIT.
           EXIT.



      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV6511-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV6511-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV6511-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES
             TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
