       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI62002.
      ******************************************************************
      *     PROGRAMA COI62002.
      *
      *     Upload Ficheiros
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI62002         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV6200.
       COPY COCV6201.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.
      *
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
      *01  WS-CONSTANTES.
      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME            PIC  X(08) VALUE 'COI62002'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI62002         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
      *
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV6200-MSG.
           MOVE COCV6200-ASE               TO COCV6201-ASE.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              MOVE 'COCV6200-CTIPOFICH' TO VIAL0015-CAMPO-NM (1)
              MOVE  COCV6200-CTIPOFICH  TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE COCV6200-ADE               TO COCV6201-ADE.

           MOVE 'CSV'                       TO COCV6201-CCODDOC.
           MOVE COCV6200-CTIPOFICH          TO COCV6201-CCHAVE.
      *
       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              MOVE 'COCV6200-CTIPOFICH'        TO VIAL0015-CAMPO-NM (1)
              MOVE  COCV6200-CTIPOFICH         TO VIAL0015-CAMPO-VLR(1)
              MOVE 'COCV6201-XDESCCTIPOFICH'   TO VIAL0015-CAMPO-NM (2)
              MOVE  COCV6201-XDESCCTIPOFICH    TO VIAL0015-CAMPO-VLR(2)
              MOVE 'COCV6201-CCHAVE        '   TO VIAL0015-CAMPO-NM (3)
              MOVE  COCV6201-CCHAVE            TO VIAL0015-CAMPO-VLR(3)
              MOVE 'COCV6201-CNISERIES     '   TO VIAL0015-CAMPO-NM (4)
              MOVE  COCV6201-CNISERIES         TO VIAL0015-CAMPO-VLR(4)
              MOVE 'COCV6201-CCODDOC       '   TO VIAL0015-CAMPO-NM (5)
              MOVE  COCV6201-CCODDOC           TO VIAL0015-CAMPO-VLR(5)
              MOVE 'COCV6201-XDESCCCODDOC  '   TO VIAL0015-CAMPO-NM (6)
              MOVE  COCV6201-XDESCCCODDOC      TO VIAL0015-CAMPO-VLR(6)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV6201-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV6201-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV6201-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES
             TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
