       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI62303.
      ******************************************************************
      *     PROGRAMA COI62303.
      *
      *      Emissão Ficha Cadastro Pessoal
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI62303         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV6230.
       COPY COCV6231.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY TGCL1000.
       COPY TGCL2000.
       COPY TGCK0002.
      *
      *
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 WS-PROGNAME  PIC X(08) VALUE 'COI62303'.
           05 CON-CTABELA-CEMPRESA  PIC X(05) VALUE 'CO500'.
           05 CON-CTABELA-CUTILIZA  PIC X(05) VALUE 'AR001'.
           05 CON-CTABELA-ISTATUS  PIC X(05) VALUE 'CO009'.
           05 CON-CTABELA-CTITULO  PIC X(05) VALUE 'CO008'.
           05 CON-CTABELA-CCATPROF  PIC X(05) VALUE 'CO010'.
           05 CON-CTABELA-CHABILIT  PIC X(05) VALUE 'CO011'.
           05 CON-CTABELA-CTIPDOC  PIC X(05) VALUE 'CO014'.
           05 CON-CTABELA-CGENERO  PIC X(05) VALUE 'CL002'.
           05 CON-CTABELA-CESTCIVIL  PIC X(05) VALUE 'AR020'.
           05 CON-CTABELA-CCONTACTO  PIC X(05) VALUE 'GR012'.
           05 CON-CTABELA-CIDIOMA  PIC X(05) VALUE 'AR001'.
      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-CTABELA                   PIC X(05) VALUE SPACES.
           05 WS-CCOD                      PIC X(40) VALUE SPACES.
           05 WS-C2COD                     PIC X(40) VALUE SPACES.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI62303         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
      *
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *
           MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
      *    IF VIAL0001-DEBUG-SIM
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV6230-MSG.
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV6231-MSG.
      *    MOVE VIAL0001-MENSAGEM-OUTPUT   TO COCV6231-MSG.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *
           MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
      *    IF VIAL0001-DEBUG-SIM
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-VAL-CAMPOS
                 THRU 2100-VAL-CAMPOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-VAL-CAMPOS
      *--------------------------------------------------------------
       2100-VAL-CAMPOS.
      *
           MOVE '2100-VAL-CAMPOS' TO VIAL0015-CALLER-ID
      *    IF VIAL0001-DEBUG-SIM
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.
      *

           IF VIAL0002-SEM-ERROS AND COCV6230-CEMPRESA NOT EQUAL SPACES
              MOVE CON-CTABELA-CEMPRESA
                TO WS-CTABELA
              MOVE COCV6230-CEMPRESA
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL1000-CCOD-S      TO COCV6231-CEMPRESA-S
                 MOVE TGCL1000-CCOD-CAPLIC TO COCV6231-CEMPRESA-CAPLIC
                 MOVE TGCL1000-CCOD-MSG    TO COCV6231-CEMPRESA-MSG
                 MOVE TGCL1000-GDESC       TO COCV6231-XDESCCEMPRESA
              ELSE
                 MOVE TGCL1000-GDESC       TO COCV6230-XDESCCEMPRESA
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6230-CUTILIZA NOT EQUAL SPACES
              MOVE CON-CTABELA-CUTILIZA
                TO WS-CTABELA
              MOVE COCV6230-CUTILIZA
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2300-VAL-TAB-OUTRA
                 THRU 2300-VAL-TAB-OUTRA-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL1000-CCOD-S      TO COCV6231-CUTILIZA-S
                 MOVE TGCL1000-CCOD-CAPLIC TO COCV6231-CUTILIZA-CAPLIC
                 MOVE TGCL1000-CCOD-MSG    TO COCV6231-CUTILIZA-MSG
                 MOVE TGCL1000-GDESC       TO COCV6231-XDESCCUTILIZA
              ELSE
                 MOVE TGCL1000-GDESC       TO COCV6230-XDESCCUTILIZA
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6230-ISTATUS NOT EQUAL SPACES
              MOVE CON-CTABELA-ISTATUS
                TO WS-CTABELA
              MOVE COCV6230-ISTATUS
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6231-ISTATUS-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6231-ISTATUS-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6231-ISTATUS-MSG
                 MOVE TGCL2000-GDESC       TO COCV6231-XDESCISTATUS
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6230-XDESCISTATUS
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6230-CTITULO NOT EQUAL SPACES
              MOVE CON-CTABELA-CTITULO
                TO WS-CTABELA
              MOVE COCV6230-CTITULO
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6231-CTITULO-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6231-CTITULO-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6231-CTITULO-MSG
                 MOVE TGCL2000-GDESC       TO COCV6231-XDESCCTITULO
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6230-XDESCCTITULO
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6230-CCATPROF NOT EQUAL SPACES
              MOVE CON-CTABELA-CCATPROF
                TO WS-CTABELA
              MOVE COCV6230-CCATPROF
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6231-CCATPROF-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6231-CCATPROF-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6231-CCATPROF-MSG
                 MOVE TGCL2000-GDESC       TO COCV6231-XDESCCCATPROF
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6230-XDESCCCATPROF
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6230-CHABILIT NOT EQUAL SPACES
              MOVE CON-CTABELA-CHABILIT
                TO WS-CTABELA
              MOVE COCV6230-CHABILIT
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6231-CHABILIT-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6231-CHABILIT-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6231-CHABILIT-MSG
                 MOVE TGCL2000-GDESC       TO COCV6231-XDESCCHABILIT
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6230-XDESCCHABILIT
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6230-CTIPDOC NOT EQUAL SPACES
              MOVE CON-CTABELA-CTIPDOC
                TO WS-CTABELA
              MOVE COCV6230-CTIPDOC
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6231-CTIPDOC-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6231-CTIPDOC-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6231-CTIPDOC-MSG
                 MOVE TGCL2000-GDESC       TO COCV6231-XDESCCTIPDOC
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6230-XDESCCTIPDOC
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6230-CTIPDOC2 NOT EQUAL SPACES
              MOVE CON-CTABELA-CTIPDOC
                TO WS-CTABELA
              MOVE COCV6230-CTIPDOC2
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6231-CTIPDOC2-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6231-CTIPDOC2-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6231-CTIPDOC2-MSG
                 MOVE TGCL2000-GDESC       TO COCV6231-XDESCCTIPDOC2
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6230-XDESCCTIPDOC2
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6230-CGENERO NOT EQUAL SPACES
              MOVE CON-CTABELA-CGENERO
                TO WS-CTABELA
              MOVE COCV6230-CGENERO
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6231-CGENERO-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6231-CGENERO-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6231-CGENERO-MSG
                 MOVE TGCL2000-GDESC       TO COCV6231-XDESCCGENERO
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6230-XDESCCGENERO
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6230-CESTCIVIL NOT EQUAL SPACES
              MOVE CON-CTABELA-CESTCIVIL
                TO WS-CTABELA
              MOVE COCV6230-CESTCIVIL
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6231-CESTCIVIL-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6231-CESTCIVIL-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6231-CESTCIVIL-MSG
                 MOVE TGCL2000-GDESC       TO COCV6231-XDESCCESTCIVIL
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6230-XDESCCESTCIVIL
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6230-CCONTACTO NOT EQUAL SPACES
              MOVE CON-CTABELA-CCONTACTO
                TO WS-CTABELA
              MOVE COCV6230-CCONTACTO
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6231-CCONTACTO-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6231-CCONTACTO-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6231-CCONTACTO-MSG
                 MOVE TGCL2000-GDESC       TO COCV6231-XDESCCCONTACTO
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6230-XDESCCCONTACTO
              END-IF
           END-IF.
      *
           IF VIAL0002-SEM-ERROS AND COCV6230-CIDIOMA NOT EQUAL SPACES
              MOVE CON-CTABELA-CIDIOMA
                TO WS-CTABELA
              MOVE COCV6230-CIDIOMA
                TO WS-CCOD
              MOVE SPACES
                TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV6231-CIDIOMA-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV6231-CIDIOMA-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV6231-CIDIOMA-MSG
                 MOVE TGCL2000-GDESC       TO COCV6231-XDESCCIDIOMA
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV6230-XDESCCIDIOMA
              END-IF
           END-IF.
      *

       2100-VAL-CAMPOS-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2200-VAL-TAB-ART05
      *--------------------------------------------------------------
       2200-VAL-TAB-ART05.
      *
           MOVE '2200-VAL-TAB-ART05' TO VIAL0015-CALLER-ID

      *
           INITIALIZE TGCL2000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL2000-CTABELA
           MOVE WS-CCOD                   TO TGCL2000-CCOD
           MOVE WS-C2COD                  TO TGCL2000-C2COD

           PERFORM CALL-TGCP2000
              THRU CALL-TGCP2000-EXIT.

      *    IF VIAL0001-DEBUG-SIM
      *       MOVE '2200-VAL-TAB-ART05-EXIT' TO VIAL0015-CALLER-ID
      *       MOVE 'TGCL2000-CTABELA    '    TO VIAL0015-CAMPO-NM(1)
      *       MOVE  TGCL2000-CTABELA         TO VIAL0015-CAMPO-VLR(1)
      *       MOVE 'TGCL2000-CCOD       '    TO VIAL0015-CAMPO-NM(2)
      *       MOVE  TGCL2000-CCOD            TO VIAL0015-CAMPO-VLR(2)
      *       MOVE 'TGCL2000-C2COD      '    TO VIAL0015-CAMPO-NM(3)
      *       MOVE  TGCL2000-C2COD           TO VIAL0015-CAMPO-VLR(3)
      *       MOVE 'TGCL2000-GDESC      '    TO VIAL0015-CAMPO-NM(4)
      *       MOVE  TGCL2000-GDESC           TO VIAL0015-CAMPO-VLR(4)
      *       MOVE 'VIAL0002-IND-ERROS  '    TO VIAL0015-CAMPO-NM(5)
      *       MOVE  VIAL0002-IND-ERROS       TO VIAL0015-CAMPO-VLR(5)
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.

       2200-VAL-TAB-ART05-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2300-VAL-TAB-OUTRA
      *--------------------------------------------------------------
       2300-VAL-TAB-OUTRA.
      *
           MOVE '2300-VAL-TAB-OUTRA' TO VIAL0015-CALLER-ID

           INITIALIZE TGCL1000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL1000-CTABELA
           MOVE WS-CCOD                   TO TGCL1000-CCOD
           MOVE WS-C2COD                  TO TGCL1000-C2COD
		
           PERFORM CALL-TGCP1000
              THRU CALL-TGCP1000-EXIT.

      *    IF VIAL0001-DEBUG-SIM
      *       MOVE 'TGCL1000-CTABELA    '    TO VIAL0015-CAMPO-NM(1)
      *       MOVE  TGCL1000-CTABELA         TO VIAL0015-CAMPO-VLR(1)
      *       MOVE 'TGCL1000-CCOD       '    TO VIAL0015-CAMPO-NM(2)
      *       MOVE  TGCL1000-CCOD            TO VIAL0015-CAMPO-VLR(2)
      *       MOVE 'TGCL1000-C2COD      '    TO VIAL0015-CAMPO-NM(3)
      *       MOVE  TGCL1000-C2COD           TO VIAL0015-CAMPO-VLR(3)
      *       MOVE 'TGCL1000-GDESC      '    TO VIAL0015-CAMPO-NM(4)
      *       MOVE  TGCL1000-GDESC           TO VIAL0015-CAMPO-VLR(4)
      *       MOVE 'VIAL0002-IND-ERROS  '    TO VIAL0015-CAMPO-NM(5)
      *       MOVE  VIAL0002-IND-ERROS       TO VIAL0015-CAMPO-VLR(5)
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.

       2300-VAL-TAB-OUTRA-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
      *    IF VIAL0001-DEBUG-SIM
      *       PERFORM VIAP0016-TRATA-DEBUG
      *          THRU VIAP0016-TRATA-DEBUG-EXIT
      *    END-IF.

           MOVE COCV6231-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV6230-MSG               TO VIAL0001-MENSAGEM-INPUT.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY TGCP1000.
           COPY TGCP2000.

