       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI72900.
      ******************************************************************
      *     PROGRAMA COI72900.                                         *
      *                                                                *
      *     Lista Mov. Seg. Social                                     *
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI72900         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD8205 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV7290.
       COPY COCV7291.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.

       COPY ARCL0039.
       COPY ETCL0002.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-DATA-MIN                PIC X(10) VALUE '0001-01-01'.
           05 WS-DATA-MAX                PIC X(10) VALUE '9999-12-31'.
           05 WS-CPAIS-MIN               PIC X(03) VALUE SPACES.
           05 WS-CPAIS-MAX               PIC X(03) VALUE SPACES.
           05 WS-CBANCO-MIN              PIC X(04) VALUE SPACES.
           05 WS-CBANCO-MAX              PIC X(04) VALUE SPACES.
           05 WS-CCONTA-MIN              PIC X(34) VALUE SPACES.
           05 WS-CCONTA-MAX              PIC X(34) VALUE SPACES.
           05 WS-CMOEDA-MIN              PIC X(03) VALUE SPACES.
           05 WS-CMOEDA-MAX              PIC X(03) VALUE SPACES.
           05 WS-NIDPROJECTO-MIN         PIC X(08) VALUE SPACES.
           05 WS-NIDPROJECTO-MAX         PIC X(08) VALUE SPACES.
           05 WS-CSTATUS-MIN             PIC X(02) VALUE SPACES.
           05 WS-CSTATUS-MAX             PIC X(02) VALUE SPACES.
           05 WS-CERRO-MIN               PIC X(03) VALUE SPACES.
           05 WS-CERRO-MAX               PIC X(03) VALUE SPACES.
           05 WS-NIDPROJECTO-PAG         PIC X(08) VALUE SPACES.
           05 WS-CPERIOD                 PIC X(07) VALUE SPACES.
           05 FILLER REDEFINES WS-CPERIOD.
             10 WS-CPERIOD-AA              PIC X(04) VALUE SPACES.
             10 WS-CPERIOD-SLH             PIC X(01) VALUE '-'.
             10 WS-CPERIOD-MM              PIC X(02) VALUE SPACES.
      *--------------------------------------------------------------
      *            SWITCH
      *--------------------------------------------------------------
       01  SW-SWITCH.
           05 SW-CURSOR                  PIC X(01) VALUE SPACES.
              88 SW-CURSOR-NONE                    VALUE '0'.
              88 SW-CURSOR-1                       VALUE '1'.
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT8202 PIC X(08) VALUE 'COVT8202'.

      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME     PIC  X(08) VALUE 'COI72900'.

      *--------------------------------------------------------------
      *              DECLARACOES DE CURSORES DB2                     *
      *--------------------------------------------------------------
       01  WS-CURSOR-VARS.
           05 FILLER                     PIC X(01) VALUE SPACES.
           EXEC SQL
                DECLARE CURCOT82 CURSOR FOR
                SELECT
                       CPERIOD
                     , NIDPROJECTO
                     , CIDEMP
                     , NIDINVOICE
                     , IDFICH
                     , DINTEGR
                     , DPAG
                     , CREF
                     , MVALOR
                     , DRECB
                     , DEXEC
                     , CSTATUS
                     , CERRO
                     , NTOTALAMOUNT
                     , MVLRTOT
                 FROM COVT8205
                 WHERE CPERIOD = :COCD8205-CPERIOD
                   AND ICONTAB = "S"
                 AND NIDPROJECTO >= :WS-NIDPROJECTO-MIN
                 AND NIDPROJECTO <= :WS-NIDPROJECTO-MAX
                 AND CSTATUS     >= :WS-CSTATUS-MIN
                 AND CSTATUS     <= :WS-CSTATUS-MAX
                 AND CERRO       >= :WS-CERRO-MIN
                 AND CERRO       <= :WS-CERRO-MAX

                 AND (IDFICH        >  :COCD8205-IDFICH

                      OR (IDFICH    =  :COCD8205-IDFICH
                      AND CIDEMP      > :COCD8205-CIDEMP)

                      OR (IDFICH    =  :COCD8205-IDFICH
                      AND CIDEMP      = :COCD8205-CIDEMP
                      AND NIDPROJECTO > :COCD8205-NIDPROJECTO)

                      OR (IDFICH    =  :COCD8205-IDFICH
                      AND CIDEMP      = :COCD8205-CIDEMP
                      AND NIDPROJECTO = :COCD8205-NIDPROJECTO
                      AND CTIPO      > :COCD8205-CTIPO)

                      OR (IDFICH    = :COCD8205-IDFICH
                      AND CIDEMP      = :COCD8205-CIDEMP
                      AND NIDPROJECTO = :COCD8205-NIDPROJECTO
                      AND CTIPO       = :COCD8205-CTIPO
                      AND CSUBTIPO   > :COCD8205-CSUBTIPO))

                 ORDER BY IDFICH
                        , CIDEMP
                        , NIDPROJECTO
                        , CTIPO
                        , CSUBTIPO
           END-EXEC.

      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI72900         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

            EXEC SQL INCLUDE VIAP0009 END-EXEC.

      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV7290-MSG.
           MOVE COCV7290-ASE               TO COCV7291-ASE.

           MOVE ZEROES                     TO COCV7291-INDICE.

           PERFORM 1100-LIMPA-OCCURS
              THRU 1199-LIMPA-OCCURS-EXIT
                UNTIL COCV7291-PAGINA-CHEIA.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            1100-LIMPA-OCCURS
      *--------------------------------------------------------------
       1100-LIMPA-OCCURS.

           ADD 1                       TO COCV7291-INDICE.


           MOVE SPACES TO COCV7291-D-CPERIOD     (COCV7291-INDICE)
                          COCV7291-D-NIDPROJECTO (COCV7291-INDICE)
                          COCV7291-D-CIDEMP       (COCV7291-INDICE)
                          COCV7291-D-IDFICH      (COCV7291-INDICE)
                          COCV7291-D-DPAG        (COCV7291-INDICE)
                          COCV7291-D-CREF        (COCV7291-INDICE)
                          COCV7291-D-DINTEG      (COCV7291-INDICE)
                          COCV7291-D-DEXEC       (COCV7291-INDICE)
                          COCV7291-D-CSTATUS     (COCV7291-INDICE)
                          COCV7291-D-CERRO       (COCV7291-INDICE)
                          COCV7291-D-TIPO        (COCV7291-INDICE)
                          COCV7291-D-SUBTIPO     (COCV7291-INDICE).

           MOVE ZEROES TO COCV7291-D-NIDINVOICE  (COCV7291-INDICE)
                          COCV7291-D-MVALOR      (COCV7291-INDICE)
                          COCV7291-D-VLRORC      (COCV7291-INDICE).

       1199-LIMPA-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

      **R  MOVE COCV7290-CPERIOD        TO COCV7291-CPERIOD
           MOVE COCV7290-CANO           TO COCV7291-CANO
           MOVE COCV7290-CMES           TO COCV7291-CMES
           MOVE COCV7290-NIDPROJECTO    TO COCV7291-NIDPROJECTO
           MOVE COCV7290-CIDEMP         TO COCV7291-CIDEMP
           MOVE COCV7290-NIDINVOICE     TO COCV7291-NIDINVOICE
           MOVE COCV7290-NIDPROJECTOPAG TO COCV7291-NIDPROJECTOPAG
           MOVE COCV7290-IDFICHPAG      TO COCV7291-IDFICHPAG
           MOVE COCV7290-CIDEMPPAG      TO COCV7291-CIDEMPPAG
           MOVE COCV7290-TIPOPAG        TO COCV7291-TIPOPAG
           MOVE COCV7290-SUBTIPOPAG     TO COCV7291-SUBTIPOPAG

           PERFORM 2010-VALIDACOES
              THRU 2019-VALIDACOES-EXIT.

           IF VIAL0002-SEM-ERROS
              PERFORM 2020-OPEN
                 THRU 2029-OPEN-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2030-FETCH
                 THRU 2039-FETCH-EXIT

              IF VIAL0002-SEM-ERROS
                 IF DB2-OK
                    PERFORM 2040-CONTINUA
                       THRU 2049-CONTINUA-EXIT
                 ELSE
                    COMPUTE COCV7291-DIMINUI-LENGTH EQUAL
                         COCV7291-INDICE-INVERSO * COCV7291-LENGTH-OCCUR
                    COMPUTE COCV7291-LENGTH EQUAL COCV7291-LENGTH
                         - COCV7291-DIMINUI-LENGTH
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV7291-CMES-S
                    MOVE COCK0001-SEM-DADOS
                      TO COCV7291-CMES-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV7291-CMES-CAPLIC
                 END-IF
              END-IF
              PERFORM 2070-CLOSE
                 THRU 2079-CLOSE-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2010-VALIDACOES
      *--------------------------------------------------------------
       2010-VALIDACOES.

           IF VIAL0001-DEBUG-SIM
              MOVE '2010-VALIDACOES' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

       2019-VALIDACOES-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2020-OPEN
      *--------------------------------------------------------------
       2020-OPEN.

      **R  MOVE COCV7290-CPERIOD           TO COCD8205-CPERIOD.
           MOVE COCV7290-CANO              TO WS-CPERIOD-AA.
           MOVE '-'                        TO WS-CPERIOD-SLH
           MOVE COCV7290-CMES              TO WS-CPERIOD-MM.
           MOVE WS-CPERIOD                 TO COCD8205-CPERIOD.

           IF COCV7290-NIDPROJECTO NOT EQUAL SPACES
              MOVE COCV7290-NIDPROJECTO TO WS-NIDPROJECTO-MIN
                                           WS-NIDPROJECTO-MAX
           ELSE
              MOVE ALL ' '              TO WS-NIDPROJECTO-MIN
              MOVE ALL '9'              TO WS-NIDPROJECTO-MAX
           END-IF.

           MOVE COCV7290-CSTATUS  TO COCV7291-CSTATUS
           IF COCV7290-CSTATUS NOT EQUAL SPACES
              MOVE COCV7290-CSTATUS TO WS-CSTATUS-MIN
                                           WS-CSTATUS-MAX
           ELSE
              MOVE ALL ' '              TO WS-CSTATUS-MIN
              MOVE ALL '9'              TO WS-CSTATUS-MAX
           END-IF.

           MOVE COCV7290-CERRO    TO COCV7291-CERRO
           IF COCV7290-CERRO NOT EQUAL SPACES
              MOVE COCV7290-CERRO TO WS-CERRO-MIN
                                           WS-CERRO-MAX
           ELSE
              MOVE ALL ' '              TO WS-CERRO-MIN
              MOVE ALL '9'              TO WS-CERRO-MAX
           END-IF.

           MOVE COCV7290-IDFICHPAG      TO COCD8205-IDFICH
           MOVE COCV7290-CIDEMPPAG      TO COCD8205-CIDEMP
           MOVE COCV7290-NIDPROJECTOPAG TO COCD8205-NIDPROJECTO
           MOVE COCV7290-TIPOPAG        TO COCD8205-CTIPO
           MOVE COCV7290-SUBTIPOPAG     TO COCD8205-CSUBTIPO

           IF VIAL0001-DEBUG-SIM
              MOVE '2020-OPEN' TO VIAL0015-CALLER-ID
              MOVE 'WS-NIDPROJECTO-MIN '  TO VIAL0015-CAMPO-NM(1)
              MOVE  WS-NIDPROJECTO-MIN    TO VIAL0015-CAMPO-VLR(1)
              MOVE 'WS-NIDPROJECTO-MAX '  TO VIAL0015-CAMPO-NM(2)
              MOVE  WS-NIDPROJECTO-MAX    TO VIAL0015-CAMPO-VLR(2)
              MOVE 'COCV7290-NIDPROJECTOPAG' TO VIAL0015-CAMPO-NM(3)
              MOVE  COCV7290-NIDPROJECTOPAG  TO VIAL0015-CAMPO-VLR(3)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
               OPEN CURCOT82
           END-EXEC

           MOVE CON-COVT8202            TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       2029-OPEN-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2030-FETCH
      *--------------------------------------------------------------
       2030-FETCH.

           IF VIAL0001-DEBUG-SIM
              MOVE '2030-FETCH' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
              FETCH  CURCOT82
               INTO
                    :COCD8205-CPERIOD
                  , :COCD8205-NIDPROJECTO
                  , :COCD8205-CIDEMP
                  , :COCD8205-NIDINVOICE
                  , :COCD8205-IDFICH
                  , :COCD8205-DINTEGR
                  , :COCD8205-DPAG
                  , :COCD8205-CREF
                  , :COCD8205-MVALOR
                  , :COCD8205-DRECB
                  , :COCD8205-DEXEC
                  , :COCD8205-CSTATUS
                  , :COCD8205-CERRO
                  , :COCD8205-NTOTALAMOUNT
                  , :COCD8205-MVLRTOT
           END-EXEC.


           MOVE CON-COVT8202               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       2039-FETCH-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                       2040-CONTINUA
      *--------------------------------------------------------------
       2040-CONTINUA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2040-CONTINUA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ZEROES                     TO COCV7291-INDICE.
           PERFORM 2050-TRATA-OCCURS
              THRU 2059-TRATA-OCCURS-EXIT
             UNTIL NOT DB2-OK
                OR COCV7291-PAGINA-CHEIA
                OR NOT VIAL0002-SEM-ERROS.

           IF VIAL0002-SEM-ERROS
              IF NOT COCV7291-PAGINA-CHEIA
                    COMPUTE COCV7291-INDICE-INVERSO EQUAL
                         COCV7291-INDICE-INVERSO - COCV7291-INDICE
                    COMPUTE COCV7291-DIMINUI-LENGTH EQUAL
                         COCV7291-INDICE-INVERSO * COCV7291-LENGTH-OCCUR
                    COMPUTE COCV7291-LENGTH EQUAL COCV7291-LENGTH -
                         COCV7291-DIMINUI-LENGTH
                    SET  VIAL0002-FIM-CONSULTA TO TRUE
              END-IF
              IF DB2-NOTFND
                    SET  VIAL0002-FIM-CONSULTA TO TRUE
              END-IF
           END-IF.

       2049-CONTINUA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2050-TRATA-OCCURS
      *--------------------------------------------------------------
       2050-TRATA-OCCURS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2050-TRATA-OCCURS' TO VIAL0015-CALLER-ID
              MOVE 'WS-NIDPROJECTO-MIN '  TO VIAL0015-CAMPO-NM(1)
              MOVE  WS-NIDPROJECTO-MIN    TO VIAL0015-CAMPO-VLR(1)
              MOVE 'WS-NIDPROJECTO-MAX '  TO VIAL0015-CAMPO-NM(2)
              MOVE  WS-NIDPROJECTO-MAX    TO VIAL0015-CAMPO-VLR(2)
              MOVE 'COCV7290-NIDPROJECTOPAG' TO VIAL0015-CAMPO-NM(3)
              MOVE  COCV7290-NIDPROJECTOPAG  TO VIAL0015-CAMPO-VLR(3)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           ADD 1                       TO COCV7291-INDICE.
           MOVE COCD8205-CPERIOD
             TO COCV7291-D-CPERIOD(COCV7291-INDICE).
           MOVE COCD8205-NIDPROJECTO
             TO COCV7291-D-NIDPROJECTO(COCV7291-INDICE).
           MOVE COCD8205-CIDEMP
             TO COCV7291-D-CIDEMP(COCV7291-INDICE).
           MOVE COCD8205-NIDINVOICE
             TO COCV7291-D-NIDINVOICE(COCV7291-INDICE).
           MOVE COCD8205-IDFICH
             TO COCV7291-D-IDFICH(COCV7291-INDICE).
           MOVE COCD8205-DPAG
             TO COCV7291-D-DPAG(COCV7291-INDICE).
           MOVE COCD8205-CREF
             TO COCV7291-D-CREF(COCV7291-INDICE).

           IF COCD8205-MVLRTOT > 0
             MOVE COCD8205-MVLRTOT
               TO COCV7291-D-MVALOR(COCV7291-INDICE)
           ELSE
             COMPUTE COCV7291-D-MVALOR(COCV7291-INDICE) =
                     COCD8205-MVLRTOT * -1
           END-IF

           MOVE COCD8205-NTOTALAMOUNT
             TO COCV7291-D-VLRORC(COCV7291-INDICE).
           MOVE COCD8205-DINTEGR
             TO COCV7291-D-DINTEG(COCV7291-INDICE).
           MOVE COCD8205-DEXEC
             TO COCV7291-D-DEXEC(COCV7291-INDICE).
           MOVE COCD8205-CSTATUS
             TO COCV7291-D-CSTATUS(COCV7291-INDICE).
           MOVE COCD8205-CERRO
             TO COCV7291-D-CERRO(COCV7291-INDICE).

           MOVE COCD8205-CTIPO
             TO COCV7291-D-TIPO(COCV7291-INDICE).

           MOVE COCD8205-CSUBTIPO
             TO COCV7291-D-SUBTIPO(COCV7291-INDICE).

           PERFORM 2030-FETCH
              THRU 2039-FETCH-EXIT.

       2059-TRATA-OCCURS-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                     2070-CLOSE
      *--------------------------------------------------------------
       2070-CLOSE.

           IF VIAL0001-DEBUG-SIM
              MOVE '2070-CLOSE' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
               CLOSE CURCOT82
           END-EXEC.

       2079-CLOSE-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF COCV7290-NMAXLIST EQUAL ZEROES
              MOVE VIAL0001-CAPLIC         TO ARCL0039-CAPLIC
              MOVE VIAL0001-COPCAO         TO ARCL0039-COPCAO
              PERFORM ARCR0039-NMAXLIST
                 THRU ARCR0039-NMAXLIST-EXIT

              IF ETCL0002-ABEND-DB2
                 MOVE ETCL0002-TABLE-NAME  TO VIAL0002-TABLE-NAME
                 MOVE ETCL0002-SQLCA       TO VIAL0002-SQLCA
              END-IF

              MOVE ARCL0039-NMAXLIST       TO COCV7291-NMAXLIST
           ELSE
              MOVE COCV7290-NMAXLIST       TO COCV7291-NMAXLIST
           END-IF.

           MOVE COCV7291-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV7291-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV7291-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE COCV7291-INDICE            TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *==============================================================
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY ARCR0039.
