       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI78103.
      ******************************************************************
      *     PROGRAMA COI78103.
      *
      *      Invoices
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI78103         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV7810.
       COPY COCV7811.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY TGCL1000.
       COPY TGCL2000.
       COPY TGCK0002.

      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 WS-PROGNAME           PIC X(08) VALUE 'COI78103'.
           05 CON-CTABELA-CPRAZO    PIC X(05) VALUE 'AR046'.
           05 CON-CTABELA-CIMPOSTO  PIC X(05) VALUE 'CO023'.
           05 CON-CTABELA-PROJECT   PIC X(05) VALUE 'CO151'.
           05 CON-CTABELA-CTIPFAC   PIC X(05) VALUE 'CO800'.
           05 CON-CTABELA-CMOEDA    PIC X(05) VALUE 'AR041'.

      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-CTABELA                   PIC X(05) VALUE SPACES.
           05 WS-CCOD                      PIC X(40) VALUE SPACES.
           05 WS-C2COD                     PIC X(40) VALUE SPACES.

      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI78103         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

            EXEC SQL INCLUDE VIAP0009 END-EXEC.

      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV7810-MSG.
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV7811-MSG.
      *    MOVE VIAL0001-MENSAGEM-OUTPUT   TO COCV7811-MSG.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-VAL-CAMPOS
                 THRU 2100-VAL-CAMPOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2100-VAL-CAMPOS
      *--------------------------------------------------------------
       2100-VAL-CAMPOS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2100-VAL-CAMPOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *--- Header - Projecto
           IF  VIAL0002-SEM-ERROS
           AND COCV7810-NIDPROJECTO NOT EQUAL SPACES
             MOVE CON-CTABELA-PROJECT     TO WS-CTABELA
             MOVE COCV7810-NIDPROJECTO    TO WS-CCOD
             MOVE SPACES                  TO WS-C2COD
             PERFORM 2300-VAL-TAB-OUTRA
                THRU 2300-VAL-TAB-OUTRA-EXIT
             IF NOT VIAL0002-SEM-ERROS
               MOVE TGCL1000-CCOD-S      TO COCV7811-NIDPROJECTO-ST
               MOVE TGCL1000-CCOD-CAPLIC TO COCV7811-NIDPROJECTO-CAPLIC
               MOVE TGCL1000-CCOD-MSG    TO COCV7811-NIDPROJECTO-MSG
               MOVE TGCL1000-GDESC       TO COCV7811-XDESCNIDPROJECTO
             ELSE
               MOVE TGCL1000-GDESC       TO COCV7810-XDESCNIDPROJECTO
             END-IF
           END-IF.
      *--- Header - Moeda
           IF  VIAL0002-SEM-ERROS
           AND COCV7810-CMOEDA      NOT EQUAL SPACES
             MOVE CON-CTABELA-CMOEDA      TO WS-CTABELA
             MOVE COCV7810-CMOEDA         TO WS-CCOD
             MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
             IF NOT VIAL0002-SEM-ERROS
               MOVE TGCL2000-CCOD-S      TO COCV7811-CMOEDA-ST
               MOVE TGCL2000-CCOD-CAPLIC TO COCV7811-CMOEDA-CAPLIC
               MOVE TGCL2000-CCOD-MSG    TO COCV7811-CMOEDA-MSG
               MOVE TGCL2000-GDESC       TO COCV7811-XDESCCMOEDA
             ELSE
               MOVE TGCL2000-GDESC       TO COCV7810-XDESCCMOEDA
             END-IF
           END-IF.
      *--- Ocorrencia 01 - Prazo de Vencimento
           IF VIAL0002-SEM-ERROS AND COCV7810-CPRAZO1 NOT EQUAL SPACES
              MOVE CON-CTABELA-CPRAZO      TO WS-CTABELA
              MOVE COCV7810-CPRAZO1        TO WS-CCOD
              MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV7811-CPRAZO1-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV7811-CPRAZO1-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV7811-CPRAZO1-MSG
                 MOVE TGCL2000-GDESC       TO COCV7811-XDESCCPRAZO1
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV7810-XDESCCPRAZO1
              END-IF
           END-IF.
      *--- Ocorrencia 01 - Tipo de Factura
           IF  VIAL0002-SEM-ERROS
           AND COCV7810-CTIPFAC1 NOT EQUAL SPACES
             MOVE CON-CTABELA-CTIPFAC     TO WS-CTABELA
             MOVE COCV7810-CTIPFAC1       TO WS-CCOD
             MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
             IF NOT VIAL0002-SEM-ERROS
               MOVE TGCL1000-CCOD-S      TO COCV7811-CTIPFAC1-ST
               MOVE TGCL1000-CCOD-CAPLIC TO COCV7811-CTIPFAC1-CAPLIC
               MOVE TGCL1000-CCOD-MSG    TO COCV7811-CTIPFAC1-MSG
               MOVE TGCL1000-GDESC       TO COCV7811-XDESCCTIPFAC1
             ELSE
               MOVE TGCL1000-GDESC       TO COCV7810-XDESCCTIPFAC1
             END-IF
           END-IF.
      *--- Ocorrencia 01 - Tipo de Imposto
           IF VIAL0002-SEM-ERROS AND COCV7810-CIMPOSTO1 NOT EQUAL SPACES
              MOVE CON-CTABELA-CIMPOSTO    TO WS-CTABELA
              MOVE COCV7810-CIMPOSTO1      TO WS-CCOD
              MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV7811-CIMPOSTO1-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV7811-CIMPOSTO1-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV7811-CIMPOSTO1-MSG
                 MOVE TGCL2000-GDESC       TO COCV7811-XDESCCIMPOSTO1
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV7810-XDESCCIMPOSTO1
              END-IF
           END-IF.
      *--- Ocorrencia 02 - Prazo de Vencimento
           IF VIAL0002-SEM-ERROS AND COCV7810-CPRAZO2 NOT EQUAL SPACES
              MOVE CON-CTABELA-CPRAZO      TO WS-CTABELA
              MOVE COCV7810-CPRAZO2        TO WS-CCOD
              MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV7811-CPRAZO2-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV7811-CPRAZO2-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV7811-CPRAZO2-MSG
                 MOVE TGCL2000-GDESC       TO COCV7811-XDESCCPRAZO2
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV7810-XDESCCPRAZO2
              END-IF
           END-IF.
      *--- Ocorrencia 02 - Tipo de Factura
           IF  VIAL0002-SEM-ERROS
           AND COCV7810-CTIPFAC2 NOT EQUAL SPACES
             MOVE CON-CTABELA-CTIPFAC     TO WS-CTABELA
             MOVE COCV7810-CTIPFAC2       TO WS-CCOD
             MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
             IF NOT VIAL0002-SEM-ERROS
               MOVE TGCL1000-CCOD-S      TO COCV7811-CTIPFAC2-ST
               MOVE TGCL1000-CCOD-CAPLIC TO COCV7811-CTIPFAC2-CAPLIC
               MOVE TGCL1000-CCOD-MSG    TO COCV7811-CTIPFAC2-MSG
               MOVE TGCL1000-GDESC       TO COCV7811-XDESCCTIPFAC2
             ELSE
               MOVE TGCL1000-GDESC       TO COCV7810-XDESCCTIPFAC2
             END-IF
           END-IF.
      *--- Ocorrencia 02 - Tipo de Imposto
           IF VIAL0002-SEM-ERROS AND COCV7810-CIMPOSTO2 NOT EQUAL SPACES
              MOVE CON-CTABELA-CIMPOSTO    TO WS-CTABELA
              MOVE COCV7810-CIMPOSTO2      TO WS-CCOD
              MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV7811-CIMPOSTO2-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV7811-CIMPOSTO2-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV7811-CIMPOSTO2-MSG
                 MOVE TGCL2000-GDESC       TO COCV7811-XDESCCIMPOSTO2
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV7810-XDESCCIMPOSTO2
              END-IF
           END-IF.
      *--- Ocorrencia 03 - Prazo de Vencimento
           IF VIAL0002-SEM-ERROS AND COCV7810-CPRAZO3 NOT EQUAL SPACES
              MOVE CON-CTABELA-CPRAZO      TO WS-CTABELA
              MOVE COCV7810-CPRAZO3        TO WS-CCOD
              MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV7811-CPRAZO3-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV7811-CPRAZO3-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV7811-CPRAZO3-MSG
                 MOVE TGCL2000-GDESC       TO COCV7811-XDESCCPRAZO3
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV7810-XDESCCPRAZO3
              END-IF
           END-IF.
      *--- Ocorrencia 03 - Tipo de Factura
           IF  VIAL0002-SEM-ERROS
           AND COCV7810-CTIPFAC3 NOT EQUAL SPACES
             MOVE CON-CTABELA-CTIPFAC     TO WS-CTABELA
             MOVE COCV7810-CTIPFAC3       TO WS-CCOD
             MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
             IF NOT VIAL0002-SEM-ERROS
               MOVE TGCL1000-CCOD-S      TO COCV7811-CTIPFAC3-ST
               MOVE TGCL1000-CCOD-CAPLIC TO COCV7811-CTIPFAC3-CAPLIC
               MOVE TGCL1000-CCOD-MSG    TO COCV7811-CTIPFAC3-MSG
               MOVE TGCL1000-GDESC       TO COCV7811-XDESCCTIPFAC3
             ELSE
               MOVE TGCL1000-GDESC       TO COCV7810-XDESCCTIPFAC3
             END-IF
           END-IF.
      *--- Ocorrencia 03 - Tipo de Imposto
           IF VIAL0002-SEM-ERROS AND COCV7810-CIMPOSTO3 NOT EQUAL SPACES
              MOVE CON-CTABELA-CIMPOSTO    TO WS-CTABELA
              MOVE COCV7810-CIMPOSTO3      TO WS-CCOD
              MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV7811-CIMPOSTO3-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV7811-CIMPOSTO3-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV7811-CIMPOSTO3-MSG
                 MOVE TGCL2000-GDESC       TO COCV7811-XDESCCIMPOSTO3
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV7810-XDESCCIMPOSTO3
              END-IF
           END-IF.
      *--- Ocorrencia 04 - Prazo de Vencimento
           IF VIAL0002-SEM-ERROS AND COCV7810-CPRAZO4 NOT EQUAL SPACES
              MOVE CON-CTABELA-CPRAZO      TO WS-CTABELA
              MOVE COCV7810-CPRAZO4        TO WS-CCOD
              MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV7811-CPRAZO4-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV7811-CPRAZO4-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV7811-CPRAZO4-MSG
                 MOVE TGCL2000-GDESC       TO COCV7811-XDESCCPRAZO4
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV7810-XDESCCPRAZO4
              END-IF
           END-IF.
      *--- Ocorrencia 04 - Tipo de Factura
           IF  VIAL0002-SEM-ERROS
           AND COCV7810-CTIPFAC4 NOT EQUAL SPACES
             MOVE CON-CTABELA-CTIPFAC     TO WS-CTABELA
             MOVE COCV7810-CTIPFAC4       TO WS-CCOD
             MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
             IF NOT VIAL0002-SEM-ERROS
               MOVE TGCL1000-CCOD-S      TO COCV7811-CTIPFAC4-ST
               MOVE TGCL1000-CCOD-CAPLIC TO COCV7811-CTIPFAC4-CAPLIC
               MOVE TGCL1000-CCOD-MSG    TO COCV7811-CTIPFAC4-MSG
               MOVE TGCL1000-GDESC       TO COCV7811-XDESCCTIPFAC4
             ELSE
               MOVE TGCL1000-GDESC       TO COCV7810-XDESCCTIPFAC4
             END-IF
           END-IF.
      *--- Ocorrencia 04 - Tipo de Imposto
           IF VIAL0002-SEM-ERROS AND COCV7810-CIMPOSTO4 NOT EQUAL SPACES
              MOVE CON-CTABELA-CIMPOSTO    TO WS-CTABELA
              MOVE COCV7810-CIMPOSTO4      TO WS-CCOD
              MOVE SPACES                  TO WS-C2COD
              PERFORM 2200-VAL-TAB-ART05
                 THRU 2200-VAL-TAB-ART05-EXIT
              IF NOT VIAL0002-SEM-ERROS
                 MOVE TGCL2000-CCOD-S      TO COCV7811-CIMPOSTO4-S
                 MOVE TGCL2000-CCOD-CAPLIC TO COCV7811-CIMPOSTO4-CAPLIC
                 MOVE TGCL2000-CCOD-MSG    TO COCV7811-CIMPOSTO4-MSG
                 MOVE TGCL2000-GDESC       TO COCV7811-XDESCCIMPOSTO4
              ELSE
                 MOVE TGCL2000-GDESC       TO COCV7810-XDESCCIMPOSTO4
              END-IF
           END-IF.

       2100-VAL-CAMPOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2200-VAL-TAB-ART05
      *--------------------------------------------------------------
       2200-VAL-TAB-ART05.

           IF VIAL0001-DEBUG-SIM
              MOVE '2200-VAL-TAB-ART05-EXIT' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           INITIALIZE TGCL2000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL2000-CTABELA
           MOVE WS-CCOD                   TO TGCL2000-CCOD
           MOVE WS-C2COD                  TO TGCL2000-C2COD

           PERFORM CALL-TGCP2000
              THRU CALL-TGCP2000-EXIT.

       2200-VAL-TAB-ART05-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2300-VAL-TAB-OUTRA
      *--------------------------------------------------------------
       2300-VAL-TAB-OUTRA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2300-VAL-TAB-OUTRA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.


           INITIALIZE TGCL1000-MSG       REPLACING  NUMERIC BY ZEROES
                                               ALPHANUMERIC BY SPACES.

           MOVE WS-CTABELA                TO TGCL1000-CTABELA
           MOVE WS-CCOD                   TO TGCL1000-CCOD
           MOVE WS-C2COD                  TO TGCL1000-C2COD
		
           PERFORM CALL-TGCP1000
              THRU CALL-TGCP1000-EXIT.

       2300-VAL-TAB-OUTRA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV7811-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV7810-MSG               TO VIAL0001-MENSAGEM-INPUT.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *==============================================================
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY TGCP1000.
           COPY TGCP2000.
