       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI86900.
      ******************************************************************
      *     PROGRAMA COI86900.                                         *
      *                                                                *
      *     Lista Cartões GALP Frota                                   *
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI86900         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD7903 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV8690.
       COPY COCV8691.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.

       COPY ARCL0039.
       COPY ETCL0002.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-DATA-MIN                PIC X(10) VALUE '0001-01-01'.
           05 WS-DATA-MAX                PIC X(10) VALUE '9999-12-31'.
           05 WS-CIDEMP-MIN              PIC X(03) VALUE SPACES.
           05 WS-CIDEMP-MAX              PIC X(03) VALUE SPACES.
           05 WS-CSITU-MIN               PIC X(02) VALUE SPACES.
           05 WS-CSITU-MAX               PIC X(02) VALUE SPACES.
           05 WS-NCARTAO-MIN             PIC X(20) VALUE SPACES.
           05 WS-NCARTAO-MAX             PIC X(20) VALUE SPACES.
      *--------------------------------------------------------------
      *            SWITCH
      *--------------------------------------------------------------
       01  SW-SWITCH.
           05 SW-CURSOR                  PIC X(01) VALUE SPACES.
              88 SW-CURSOR-NONE                    VALUE '0'.
              88 SW-CURSOR-1                       VALUE '1'.
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT7903 PIC X(08) VALUE 'COVT7903_RELCARD'.

      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME     PIC  X(08) VALUE 'COI86900'.

      *--------------------------------------------------------------
      *              DECLARACOES DE CURSORES DB2                     *
      *--------------------------------------------------------------
       01  WS-CURSOR-VARS.
           05 FILLER                     PIC X(01) VALUE SPACES.
           EXEC SQL
                DECLARE CURCOT79 CURSOR FOR
                SELECT
                       NCARTAO
                     , CIDEMP
                     , TCARTAO
                     , CSITU
                     , MPLAFOND
                 FROM COVT7903_RELCARD
                 WHERE CIDEMP  >= :WS-CIDEMP-MIN
                   AND CIDEMP  <= :WS-CIDEMP-MAX
                   AND NCARTAO >= :WS-NCARTAO-MIN
                   AND NCARTAO <= :WS-NCARTAO-MAX
                   AND CSITU   >= :WS-CSITU-MIN
                   AND CSITU   <= :WS-CSITU-MAX

                   AND (CIDEMP        >  :COCD7903-CIDEMP

                        OR (CIDEMP    =  :COCD7903-CIDEMP
                        AND NCARTAO     > :COCD7903-NCARTAO))
                 ORDER BY CIDEMP
                        , NCARTAO
                        , CSITU
           END-EXEC.

      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI86900         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

            EXEC SQL INCLUDE VIAP0009 END-EXEC.

      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV8690-MSG.
           MOVE COCV8690-ASE               TO COCV8691-ASE.

           MOVE ZEROES                     TO COCV8691-INDICE.

           PERFORM 1100-LIMPA-OCCURS
              THRU 1199-LIMPA-OCCURS-EXIT
                UNTIL COCV8691-PAGINA-CHEIA.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            1100-LIMPA-OCCURS
      *--------------------------------------------------------------
       1100-LIMPA-OCCURS.

           ADD 1                       TO COCV8691-INDICE.


           MOVE SPACES TO COCV8691-D-NCARTAO     (COCV8691-INDICE)
                          COCV8691-D-CIDEMP      (COCV8691-INDICE)
                          COCV8691-D-TCARTAO     (COCV8691-INDICE)
                          COCV8691-D-CSITU       (COCV8691-INDICE)

           MOVE ZEROES TO COCV8691-D-MPLAFOND    (COCV8691-INDICE).

       1199-LIMPA-OCCURS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV8690-CIDEMP         TO COCV8691-CIDEMP
           MOVE COCV8690-NCARTAO        TO COCV8691-NCARTAO
           MOVE COCV8690-CSITU          TO COCV8691-CSITU

           PERFORM 2010-VALIDACOES
              THRU 2019-VALIDACOES-EXIT.

           IF VIAL0002-SEM-ERROS
              PERFORM 2020-OPEN
                 THRU 2029-OPEN-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2030-FETCH
                 THRU 2039-FETCH-EXIT

              IF VIAL0002-SEM-ERROS
                 IF DB2-OK
                    PERFORM 2040-CONTINUA
                       THRU 2049-CONTINUA-EXIT
                 ELSE
                    COMPUTE COCV8691-DIMINUI-LENGTH EQUAL
                         COCV8691-INDICE-INVERSO * COCV8691-LENGTH-OCCUR
                    COMPUTE COCV8691-LENGTH EQUAL COCV8691-LENGTH
                         - COCV8691-DIMINUI-LENGTH
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV8691-CIDEMP-S
                    MOVE COCK0001-SEM-DADOS
                      TO COCV8691-CIDEMP-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV8691-CIDEMP-CAPLIC
                 END-IF
              END-IF
              PERFORM 2070-CLOSE
                 THRU 2079-CLOSE-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2010-VALIDACOES
      *--------------------------------------------------------------
       2010-VALIDACOES.

           IF VIAL0001-DEBUG-SIM
              MOVE '2010-VALIDACOES' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

       2019-VALIDACOES-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2020-OPEN
      *--------------------------------------------------------------
       2020-OPEN.

           IF COCV8690-CIDEMP      NOT EQUAL SPACES
              MOVE COCV8690-CIDEMP      TO WS-CIDEMP-MIN
                                           WS-CIDEMP-MAX
           ELSE
              MOVE ALL ' '              TO WS-CIDEMP-MIN
              MOVE ALL '9'              TO WS-CIDEMP-MAX
           END-IF.

           IF COCV8690-NCARTAO NOT EQUAL SPACES
              MOVE COCV8690-NCARTAO     TO WS-NCARTAO-MIN
                                           WS-NCARTAO-MAX
           ELSE
              MOVE ALL ' '              TO WS-NCARTAO-MIN
              MOVE ALL '9'              TO WS-NCARTAO-MAX
           END-IF.

           IF COCV8690-CSITU NOT EQUAL SPACES
              MOVE COCV8690-CSITU       TO WS-CSITU-MIN
                                           WS-CSITU-MAX
           ELSE
              MOVE ALL ' '              TO WS-CSITU-MIN
              MOVE ALL '9'              TO WS-CSITU-MAX
           END-IF.

           IF VIAL0001-DEBUG-SIM
              MOVE '2020-OPEN' TO VIAL0015-CALLER-ID
              MOVE 'WS-CIDEMP-MIN      '  TO VIAL0015-CAMPO-NM(1)
              MOVE  WS-CIDEMP-MIN         TO VIAL0015-CAMPO-VLR(1)
              MOVE 'WS-CIDEMP-MAX      '  TO VIAL0015-CAMPO-NM(2)
              MOVE  WS-CIDEMP-MAX         TO VIAL0015-CAMPO-VLR(2)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV8690-CIDEMPPAG      TO COCD7903-CIDEMP
           MOVE COCV8690-NCARTAOPAG     TO COCD7903-NCARTAO


           EXEC SQL
               OPEN CURCOT79
           END-EXEC

           MOVE CON-COVT7903            TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       2029-OPEN-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                     2030-FETCH
      *--------------------------------------------------------------
       2030-FETCH.

           IF VIAL0001-DEBUG-SIM
              MOVE '2030-FETCH' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
              FETCH  CURCOT79
               INTO
                    :COCD7903-NCARTAO
                  , :COCD7903-CIDEMP
                  , :COCD7903-TCARTAO
                  , :COCD7903-CSITU
                  , :COCD7903-MPLAFOND
           END-EXEC.


           MOVE CON-COVT7903               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

       2039-FETCH-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                       2040-CONTINUA
      *--------------------------------------------------------------
       2040-CONTINUA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2040-CONTINUA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE ZEROES                     TO COCV8691-INDICE.
           PERFORM 2050-TRATA-OCCURS
              THRU 2059-TRATA-OCCURS-EXIT
             UNTIL NOT DB2-OK
                OR COCV8691-PAGINA-CHEIA
                OR NOT VIAL0002-SEM-ERROS.

           IF VIAL0002-SEM-ERROS
              IF NOT COCV8691-PAGINA-CHEIA
                    COMPUTE COCV8691-INDICE-INVERSO EQUAL
                         COCV8691-INDICE-INVERSO - COCV8691-INDICE
                    COMPUTE COCV8691-DIMINUI-LENGTH EQUAL
                         COCV8691-INDICE-INVERSO * COCV8691-LENGTH-OCCUR
                    COMPUTE COCV8691-LENGTH EQUAL COCV8691-LENGTH -
                         COCV8691-DIMINUI-LENGTH
                    SET  VIAL0002-FIM-CONSULTA TO TRUE
              END-IF
              IF DB2-NOTFND
                    SET  VIAL0002-FIM-CONSULTA TO TRUE
              END-IF
           END-IF.

       2049-CONTINUA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2050-TRATA-OCCURS
      *--------------------------------------------------------------
       2050-TRATA-OCCURS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2050-TRATA-OCCURS' TO VIAL0015-CALLER-ID
              MOVE 'WS-CIDEMP-MIN '    TO VIAL0015-CAMPO-NM(1)
              MOVE  WS-CIDEMP-MIN      TO VIAL0015-CAMPO-VLR(1)
              MOVE 'WS-CIDEMP-MAX '    TO VIAL0015-CAMPO-NM(2)
              MOVE  WS-CIDEMP-MAX      TO VIAL0015-CAMPO-VLR(2)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           ADD 1                       TO COCV8691-INDICE.
           MOVE COCD7903-NCARTAO
             TO COCV8691-D-NCARTAO(COCV8691-INDICE).
           MOVE COCD7903-CIDEMP
             TO COCV8691-D-CIDEMP(COCV8691-INDICE).
           MOVE COCD7903-TCARTAO
             TO COCV8691-D-TCARTAO(COCV8691-INDICE).
           MOVE COCD7903-CSITU
             TO COCV8691-D-CSITU(COCV8691-INDICE).
           MOVE COCD7903-MPLAFOND
             TO COCV8691-D-MPLAFOND(COCV8691-INDICE).

           PERFORM 2030-FETCH
              THRU 2039-FETCH-EXIT.

       2059-TRATA-OCCURS-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                     2070-CLOSE
      *--------------------------------------------------------------
       2070-CLOSE.

           IF VIAL0001-DEBUG-SIM
              MOVE '2070-CLOSE' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
               CLOSE CURCOT79
           END-EXEC.

       2079-CLOSE-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

      *    IF COCV8690-NMAXLIST EQUAL ZEROES
      *       MOVE VIAL0001-CAPLIC         TO ARCL0039-CAPLIC
      *       MOVE VIAL0001-COPCAO         TO ARCL0039-COPCAO
      *       PERFORM ARCR0039-NMAXLIST
      *          THRU ARCR0039-NMAXLIST-EXIT
      *
      *       IF ETCL0002-ABEND-DB2
      *          MOVE ETCL0002-TABLE-NAME  TO VIAL0002-TABLE-NAME
      *          MOVE ETCL0002-SQLCA       TO VIAL0002-SQLCA
      *       END-IF
      *
      *       MOVE ARCL0039-NMAXLIST       TO COCV8691-NMAXLIST
      *    ELSE
      *       MOVE COCV8690-NMAXLIST       TO COCV8691-NMAXLIST
      *    END-IF.

           MOVE COCV8691-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV8691-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV8691-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE COCV8691-INDICE            TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *==============================================================
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
           COPY ARCR0039.
