       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI95102.
      ******************************************************************
      *     PROGRAMA COI95102.                                         *
      *                                                                *
      *     Projects                                                   *
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI95102         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD7101 END-EXEC.
           EXEC SQL INCLUDE COCD7001 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV9510.
       COPY COCV9511.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.

      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT7101 PIC X(08) VALUE 'COVT7101'.
           05 CON-COVT7001 PIC X(08) VALUE 'COVT7001'.
      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-X                          PIC X(01) VALUE SPACES.
           05 WS-ANO                        PIC S9(04) COMP-3
                                                   VALUE ZEROES.
           05 WS-HORAS                      PIC S9(20) VALUE ZEROES.
           05 WS-TOT-ATRIB                  PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-NDIAS-ATRIB                PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-NDIASREG-ATRIB             PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-ZHORAS-GOZ                 PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-ZDIAS-GOZ                  PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-ZHORAS-AGE                 PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-ZDIAS-AGE                  PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-ZHORAS-GOZ-TOT             PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-ZDIAS-GOZ-TOT              PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-ZHORAS-AGE-TOT             PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-ZDIAS-AGE-TOT              PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-NDIAS-ATRIB-TOT            PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-NDIASREG-ATRIB-TOT         PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
           05 WS-TOT-ATRIB-TOT              PIC S9(05)V99 COMP-3
                                                   VALUE ZEROES.
      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME            PIC  X(08) VALUE 'COI95102'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI95102         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

            EXEC SQL INCLUDE VIAP0009 END-EXEC.

      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV9510-MSG.
           MOVE COCV9510-ASE       TO COCV9511-ASE.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV9510-ADE       TO COCV9511-ADE.

           IF VIAL0002-SEM-ERROS
              PERFORM 2050-VALIDACAO
                 THRU 2050-VALIDACAO-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-CALC-ANO
                 THRU 2100-CALC-ANO-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-CALC-TOT
                 THRU 2100-CALC-TOT-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      * 2050-VALIDACAO
      *--------------------------------------------------------------
       2050-VALIDACAO.

           IF VIAL0001-DEBUG-SIM
              MOVE '2050-VALIDACAO    ' TO VIAL0015-CALLER-ID
              MOVE 'COCV9510-CIDEMP'       TO VIAL0015-CAMPO-NM(1)
              MOVE COCV9510-CIDEMP         TO VIAL0015-CAMPO-VLR(1)
              MOVE 'COCV9510-CANO'          TO VIAL0015-CAMPO-NM(2)
              MOVE COCV9510-CANO           TO VIAL0015-CAMPO-VLR(2)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV9510-CIDEMP EQUAL SPACES
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-STATUS-ACTIVO TO COCV9511-CIDEMP-S
               MOVE COCK0001-CAMPO-OBRIGAT TO COCV9511-CIDEMP-MSG
               MOVE COCK0002-CAPLIC        TO COCV9511-CIDEMP-CAPLIC
           END-IF.


           IF  VIAL0002-SEM-ERROS
           AND COCV9510-CANO EQUAL SPACES
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-STATUS-ACTIVO TO COCV9511-CANO-S
               MOVE COCK0001-CAMPO-OBRIGAT TO COCV9511-CANO-MSG
               MOVE COCK0002-CAPLIC        TO COCV9511-CANO-CAPLIC
           END-IF.

       2050-VALIDACAO-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2100-CALC-ANO
      *--------------------------------------------------------------
       2100-CALC-ANO.

           IF VIAL0001-DEBUG-SIM
              MOVE '2100-CALC-ANO' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2400-ANO-ATRIB
                 THRU 2400-ANO-ATRIB-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2400-ANO-GOZ
                 THRU 2400-ANO-GOZ-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
             IF COCD7101-CANO >= VIAL0001-DATA-PROCESSO-I(1:4)
               PERFORM 2400-ANO-AGE
                  THRU 2400-ANO-AGE-EXIT
             ELSE
               MOVE ZEROES TO COCV9511-NDIASAGN
             END-IF
           END-IF.

       2100-CALC-ANO-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2100-CALC-TOT
      *--------------------------------------------------------------
       2100-CALC-TOT.

           IF VIAL0001-DEBUG-SIM
              MOVE '2100-CALC-TOT '   TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2400-TOTAL-ATRIB
                 THRU 2400-TOTAL-ATRIB-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2400-TOTAL-GOZ
                 THRU 2400-TOTAL-GOZ-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
             IF COCD7101-CANO >= VIAL0001-DATA-PROCESSO-I(1:4)
               PERFORM 2400-TOTAL-AGE
                  THRU 2400-TOTAL-AGE-EXIT
             END-IF
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2400-CALC-SALDO
                 THRU 2400-CALC-SALDO-EXIT
           END-IF.

       2100-CALC-TOT-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2400-ANO-ATRIB
      *--------------------------------------------------------------
       2400-ANO-ATRIB.

           IF VIAL0001-DEBUG-SIM
              MOVE '2400-ANO-ATRIB'   TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV9510-CIDEMP       TO COCD7101-CIDEMP.
           MOVE COCV9510-CANO         TO COCD7101-CANO.

           EXEC SQL
                 SELECT
                       NDIAS
                     , NDIASREG
                 INTO
                       :COCD7101-NDIAS
                     , :COCD7101-NDIASREG
                  FROM  COVT7101
                 WHERE  CIDEMP = :COCD7101-CIDEMP
                   AND  CANO   = :COCD7101-CANO
           END-EXEC

           MOVE CON-COVT7101 TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
              IF DB2-OK
                 IF VIAL0001-CRIACAO
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV9511-CIDEMP-S
                    MOVE COCK0001-CFUNCIONARIO-EXISTS
                      TO COCV9511-CIDEMP-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV9511-CIDEMP-CAPLIC
                 ELSE
                   MOVE COCD7101-NDIAS    TO COCV9511-NDIAS
                   MOVE COCD7101-NDIASREG TO COCV9511-NDIASREG
              ELSE
                 IF NOT VIAL0001-CRIACAO
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV9511-CIDEMP-S
                    MOVE COCK0001-CFUNCIONARIO-N-EXISTS
                      TO COCV9511-CIDEMP-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV9511-CIDEMP-CAPLIC
                 END-IF
              END-IF
           END-IF.

       2400-ANO-ATRIB-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *            2400-TOTAL-ATRIB
      *--------------------------------------------------------------
       2400-TOTAL-ATRIB.

           IF VIAL0001-DEBUG-SIM
              MOVE '2400-TOTAL-ATRIB' TO VIAL0015-CALLER-ID
              MOVE 'COCD7101-CIDEMP      ' TO VIAL0015-CAMPO-NM(2)
              MOVE  COCD7101-CIDEMP        TO VIAL0015-CAMPO-VLR(2)
              MOVE 'COCD7101-CANO        ' TO VIAL0015-CAMPO-NM(2)
              MOVE  COCD7101-CANO          TO VIAL0015-CAMPO-VLR(2)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           EXEC SQL
                 SELECT IFNULL(SUM(NDIAS), 0)
                       ,IFNULL(SUM(NDIASREG), 0)
                 INTO
                       :WS-NDIAS-ATRIB-TOT
                     , :WS-NDIASREG-ATRIB-TOT
                  FROM  COVT7101
                 WHERE  CIDEMP = :COCD7101-CIDEMP
                   AND  CANO  <= :COCD7101-CANO
           END-EXEC.

           IF VIAL0002-SEM-ERROS
              IF DB2-OK
                COMPUTE WS-TOT-ATRIB-TOT = WS-NDIAS-ATRIB-TOT +
                WS-NDIASREG-ATRIB-TOT
              ELSE
                MOVE ZEROES TO WS-TOT-ATRIB-TOT
              END-IF
           END-IF.

       2400-TOTAL-ATRIB-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2400-TOTAL-GOZ
      *--------------------------------------------------------------
       2400-TOTAL-GOZ.

           IF VIAL0001-DEBUG-SIM
              MOVE '2400-TOTAL-GOZ' TO VIAL0015-CALLER-ID
              MOVE 'COCV9511-CIDEMP      ' TO VIAL0015-CAMPO-NM(2)
              MOVE  COCV9511-CIDEMP        TO VIAL0015-CAMPO-VLR(2)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD7101-CIDEMP                 TO COCD7001-CIDEMP
           MOVE COCD7101-CANO                   TO WS-ANO
           MOVE VIAL0001-DATA-PROCESSO-I        TO COCD7001-DFERIAS.

           EXEC SQL
                SELECT IFNULL(SUM(ZHORAS), 0)
                INTO :WS-ZHORAS-GOZ-TOT
                FROM COVT7001
                WHERE  CIDEMP = :COCD7001-CIDEMP
                  AND  YEAR(DFERIAS) <= :WS-ANO
                  AND  DFERIAS <= :COCD7001-DFERIAS
           END-EXEC.

           MOVE CON-COVT7001               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
             IF DB2-OK
               COMPUTE WS-ZDIAS-GOZ-TOT = WS-ZHORAS-GOZ-TOT / 8
              ELSE
               MOVE ZEROES            TO WS-ZDIAS-GOZ-TOT
              END-IF
           END-IF.

       2400-TOTAL-GOZ-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2400-TOTAL-AGE
      *--------------------------------------------------------------
       2400-TOTAL-AGE.

           IF VIAL0001-DEBUG-SIM
              MOVE '2400-TOTAL-AGE' TO VIAL0015-CALLER-ID
              MOVE 'COCV9511-CIDEMP      ' TO VIAL0015-CAMPO-NM(2)
              MOVE  COCV9511-CIDEMP        TO VIAL0015-CAMPO-VLR(2)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD7101-CIDEMP                 TO COCD7001-CIDEMP
           MOVE VIAL0001-DATA-PROCESSO-I        TO COCD7001-DFERIAS.

           EXEC SQL
                SELECT IFNULL(SUM(ZHORAS), 0)
                INTO :WS-ZHORAS-AGE-TOT
                FROM COVT7001
                WHERE  CIDEMP = :COCD7001-CIDEMP
                  AND  DFERIAS >= :COCD7001-DFERIAS
           END-EXEC.

           MOVE CON-COVT7001               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
             IF DB2-OK
               COMPUTE WS-ZDIAS-AGE-TOT = WS-ZHORAS-AGE-TOT / 8
              ELSE
               MOVE ZEROES            TO WS-ZDIAS-AGE-TOT
              END-IF
           END-IF.

       2400-TOTAL-AGE-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2400-ANO-GOZ
      *--------------------------------------------------------------
       2400-ANO-GOZ.

           IF VIAL0001-DEBUG-SIM
              MOVE '2400-ANO-GOZ  ' TO VIAL0015-CALLER-ID
              MOVE 'COCV9511-CIDEMP      ' TO VIAL0015-CAMPO-NM(2)
              MOVE  COCV9511-CIDEMP        TO VIAL0015-CAMPO-VLR(2)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD7101-CIDEMP                 TO COCD7001-CIDEMP
           MOVE COCD7101-CANO                   TO WS-ANO
           MOVE VIAL0001-DATA-PROCESSO-I        TO COCD7001-DFERIAS.

           EXEC SQL
                SELECT IFNULL(SUM(ZHORAS), 0)
                INTO :WS-ZHORAS-GOZ
                FROM COVT7001
                WHERE  CIDEMP = :COCD7001-CIDEMP
                  AND  YEAR(DFERIAS) = :WS-ANO
                  AND  DFERIAS <= :COCD7001-DFERIAS
           END-EXEC.

           MOVE CON-COVT7001               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
             IF DB2-OK
               COMPUTE WS-ZDIAS-GOZ = WS-ZHORAS-GOZ / 8
               MOVE WS-ZDIAS-GOZ      TO COCV9511-NDIASGOZ
              ELSE
               MOVE ZEROES            TO COCV9511-NDIASGOZ
              END-IF
           END-IF.

       2400-ANO-GOZ-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2400-ANO-AGE
      *--------------------------------------------------------------
       2400-ANO-AGE.

           IF VIAL0001-DEBUG-SIM
              MOVE '2400-ANO-AGE' TO VIAL0015-CALLER-ID
              MOVE 'COCV9511-CIDEMP      ' TO VIAL0015-CAMPO-NM(2)
              MOVE  COCV9511-CIDEMP        TO VIAL0015-CAMPO-VLR(2)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCD7101-CIDEMP                 TO COCD7001-CIDEMP
           MOVE VIAL0001-DATA-PROCESSO-I        TO COCD7001-DFERIAS.

           EXEC SQL
                SELECT IFNULL(SUM(ZHORAS), 0)
                INTO :WS-ZHORAS-AGE
                FROM COVT7001
                WHERE  CIDEMP = :COCD7001-CIDEMP
                  AND  DFERIAS >= :COCD7001-DFERIAS
           END-EXEC.

           MOVE CON-COVT7001               TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
             IF DB2-OK
               COMPUTE WS-ZDIAS-AGE = WS-ZHORAS-AGE / 8
               MOVE WS-ZDIAS-AGE      TO COCV9511-NDIASAGN
              ELSE
               MOVE ZEROES            TO COCV9511-NDIASAGN
              END-IF
           END-IF.

       2400-ANO-AGE-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2400-CALC-SALDO
      *--------------------------------------------------------------
       2400-CALC-SALDO.

           IF VIAL0001-DEBUG-SIM
              MOVE '2400-CALC-SALDO' TO VIAL0015-CALLER-ID
              MOVE 'WS-TOT-ATRIB-TOT     ' TO VIAL0015-CAMPO-NM(1)
              MOVE  WS-TOT-ATRIB-TOT       TO VIAL0015-CAMPO-VLR(1)
              MOVE 'WS-ZDIAS-GOZ-TOT     ' TO VIAL0015-CAMPO-NM(2)
              MOVE  WS-ZDIAS-GOZ-TOT       TO VIAL0015-CAMPO-VLR(2)
              MOVE 'WS-ZDIAS-AGE-TOT     ' TO VIAL0015-CAMPO-NM(3)
              MOVE  WS-ZDIAS-AGE-TOT       TO VIAL0015-CAMPO-VLR(3)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           COMPUTE COCV9511-SFERIAS = WS-TOT-ATRIB-TOT -
                        (WS-ZDIAS-GOZ-TOT + WS-ZDIAS-AGE-TOT).

       2400-CALC-SALDO-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              MOVE 'COCV9511-CIDEMP      ' TO VIAL0015-CAMPO-NM(2)
              MOVE  COCV9511-CIDEMP        TO VIAL0015-CAMPO-VLR(2)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV9511-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV9511-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV9511-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES                     TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *==============================================================
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
