       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI92102.
      ******************************************************************
      *     PROGRAMA COI92102.                                         *
      *                                                                *
      *     Manutenção de Contas Bancárias                             *
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI92102         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD6800 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV9210.
       COPY COCV9211.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.

      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT6800 PIC X(08) VALUE 'COVT6800'.
      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-X                         PIC 9(03) VALUE ZEROS.
      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME            PIC  X(08) VALUE 'COI92102'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI92102         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

            EXEC SQL INCLUDE VIAP0009 END-EXEC.

      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV9210-MSG.
           MOVE COCV9210-ASE       TO COCV9211-ASE.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV9210-ADE       TO COCV9211-ADE.

           IF VIAL0002-SEM-ERROS
              PERFORM 2050-VALIDACAO
                 THRU 2050-VALIDACAO-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2100-OBTEM-DADOS
                 THRU 2199-OBTEM-DADOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      * 2050-VALIDACAO
      *--------------------------------------------------------------
       2050-VALIDACAO.

           IF VIAL0001-DEBUG-SIM
              MOVE '2050-VALIDACAO    ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF  VIAL0002-SEM-ERROS
           AND COCV9210-CCONTA EQUAL SPACES
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-STATUS-ACTIVO TO COCV9211-CCONTA-S
               MOVE COCK0001-CAMPO-OBRIGAT TO COCV9211-CCONTA-MSG
               MOVE COCK0002-CAPLIC        TO COCV9211-CCONTA-CAPLIC
           END-IF.

       2050-VALIDACAO-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2100-OBTEM-DADOS
      *--------------------------------------------------------------
       2100-OBTEM-DADOS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2100-OBTEM-DADOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV9210-CPAIS        TO COCD6800-CPAIS.
           MOVE COCV9210-CBANCO       TO COCD6800-CBANCO.
           MOVE COCV9210-CCONTA       TO COCD6800-CCONTA.

           EXEC SQL
                 SELECT
                       CPAIS
                     , CBANCO
                     , CCONTA
                     , GDESC
                     , CMOEDA
                     , CEMPRESA
                     , IRECAUT
                 INTO
                       :COCD6800-CPAIS
                     , :COCD6800-CBANCO
                     , :COCD6800-CCONTA
                     , :COCD6800-GDESC
                     , :COCD6800-CMOEDA
                     , :COCD6800-CEMPRESA
                     , :COCD6800-IRECAUT
                  FROM  COVT6800_CNTBANC
                 WHERE  CPAIS  = :COCD6800-CPAIS
                   AND  CBANCO = :COCD6800-CBANCO
                   AND  CCONTA = :COCD6800-CCONTA
           END-EXEC

           MOVE CON-COVT6800 TO VIAL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF VIAL0002-SEM-ERROS
              IF DB2-OK
                 IF VIAL0001-CRIACAO
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV9211-CCONTA-S
                    MOVE COCK0001-CCONTA-EXISTS
                      TO COCV9211-CCONTA-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV9211-CCONTA-CAPLIC
                 ELSE
                     MOVE COCD6800-CPAIS       TO COCV9211-CPAIS
                     MOVE COCD6800-CBANCO      TO COCV9211-CBANCO
                     MOVE COCD6800-CCONTA      TO COCV9211-CCONTA
                     MOVE COCD6800-GDESC       TO COCV9211-GDESC
                     MOVE COCD6800-CMOEDA      TO COCV9211-CMOEDA
                     MOVE COCD6800-CEMPRESA    TO COCV9211-CEMPRESA
                     MOVE COCD6800-IRECAUT     TO COCV9211-IRECAUT

           IF VIAL0001-DEBUG-SIM
              MOVE 'Mensagem input   ' TO VIAL0015-CALLER-ID
              MOVE 'CPAIS  '           TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV9211-CPAIS     TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF

           IF VIAL0001-DEBUG-SIM
              MOVE 'Mensagem input   ' TO VIAL0015-CALLER-ID
              MOVE 'CBANCO'            TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV9211-CBANCO    TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF

           IF VIAL0001-DEBUG-SIM
              MOVE 'Mensagem input   ' TO VIAL0015-CALLER-ID
              MOVE 'CCONTA'            TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV9211-CCONTA    TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF

           IF VIAL0001-DEBUG-SIM
              MOVE 'Mensagem input   ' TO VIAL0015-CALLER-ID
              MOVE 'GDESC'             TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV9211-GDESC     TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF

           IF VIAL0001-DEBUG-SIM
              MOVE 'Mensagem input   ' TO VIAL0015-CALLER-ID
              MOVE 'CMOEDA'            TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV9211-CMOEDA    TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF

           IF VIAL0001-DEBUG-SIM
              MOVE 'Mensagem input   ' TO VIAL0015-CALLER-ID
              MOVE 'CEMPRESA'          TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV9211-CEMPRESA  TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF

           IF VIAL0001-DEBUG-SIM
              MOVE 'Mensagem input   ' TO VIAL0015-CALLER-ID
              MOVE 'IRECAUT'           TO VIAL0015-CAMPO-NM(1)
              MOVE  COCV9211-IRECAUT   TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF
                 END-IF
              ELSE
                 IF NOT VIAL0001-CRIACAO
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV9211-CCONTA-S
                    MOVE COCK0001-CCONTA-N-EXISTS
                      TO COCV9211-CCONTA-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV9211-CCONTA-CAPLIC
                 END-IF
              END-IF
           END-IF.

       2199-OBTEM-DADOS-EXIT.
           EXIT.


      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV9211-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV9211-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV9211-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES                     TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *==============================================================
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0016.
