       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI98104.
      ******************************************************************
      *     PROGRAMA COI98104.                                         *
      *                                                                *
      *     Parametrização Tipos Documentos                            *
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI98104         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD7501 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
       01 WS-SQL-AUXILIARY.
         05 IND-NULL                       PIC S9(04) BINARY.

      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV9810.
       COPY COCV9811.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0010.
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.

      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-COVT7501 PIC X(08) VALUE 'COVT7501'.
      *--------------------------------------------------------------
      *            VARIAVEIS
      *--------------------------------------------------------------
       01  WS-VARIAVEIS.
           05 WS-X                         PIC 9(03).
      *--------------------------------------------------------------
      * PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME     PIC  X(08) VALUE 'COI98104'.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI98104         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.

            EXEC SQL INCLUDE VIAP0009 END-EXEC.

      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3099-FINAL-PROGRAMA-EXIT.

       0099-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
      *            1000-INICIO-PROGRAMA
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV9810-MSG.
           MOVE COCV9810-ASE               TO COCV9811-ASE.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            2000-PROC-PROGRAMA
      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV9810-ADE               TO COCV9811-ADE.

           IF VIAL0002-SEM-ERROS
              PERFORM 2200-VALIDACOES
                 THRU 2299-VALIDACOES-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
              PERFORM 2300-INSERE-DADOS
                 THRU 2399-INSERE-DADOS-EXIT
           END-IF.

       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *                   2200-VALIDACOES
      *--------------------------------------------------------------
       2200-VALIDACOES.

           IF VIAL0001-DEBUG-SIM
              MOVE '2200-VALIDACOES' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           IF VIAL0002-SEM-ERROS
             IF COCV9810-CFAMD EQUAL SPACES
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-CAPLIC        TO COCV9811-CFAMD-CAPLIC
               MOVE COCK0002-STATUS-ACTIVO TO COCV9811-CFAMD-S
               MOVE COCK0001-CAMPO-OBRIGAT TO COCV9811-CFAMD-MSG
             END-IF
           END-IF.

           IF VIAL0002-SEM-ERROS
             IF COCV9810-CCODDOC EQUAL SPACES
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-CAPLIC        TO COCV9811-CCODDOC-CAPLIC
               MOVE COCK0002-STATUS-ACTIVO TO COCV9811-CCODDOC-S
               MOVE COCK0001-CAMPO-OBRIGAT TO COCV9811-CCODDOC-MSG
             END-IF
           END-IF.

           IF VIAL0002-SEM-ERROS
             IF COCV9810-COBG    EQUAL SPACES
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-CAPLIC        TO COCV9811-COBG-CAPLIC
               MOVE COCK0002-STATUS-ACTIVO TO COCV9811-COBG-S
               MOVE COCK0001-CAMPO-OBRIGAT TO COCV9811-COBG-MSG
             END-IF
           END-IF.

           IF VIAL0002-SEM-ERROS
             IF COCV9810-DDATINI EQUAL SPACES
             OR COCV9810-DDATINI EQUAL COCK0002-DATA-MIN
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-CAPLIC        TO COCV9811-DDATINI-CAPLIC
               MOVE COCK0002-STATUS-ACTIVO TO COCV9811-DDATINI-S
               MOVE COCK0001-CAMPO-OBRIGAT TO COCV9811-DDATINI-MSG
             END-IF
           END-IF.

           IF VIAL0002-SEM-ERROS
             IF COCV9810-DDATFIM EQUAL SPACES
             OR COCV9810-DDATFIM EQUAL COCK0002-DATA-MIN
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-CAPLIC        TO COCV9811-DDATFIM-CAPLIC
               MOVE COCK0002-STATUS-ACTIVO TO COCV9811-DDATFIM-S
               MOVE COCK0001-CAMPO-OBRIGAT TO COCV9811-DDATFIM-MSG
             END-IF
           END-IF.

           IF VIAL0002-SEM-ERROS
             IF COCV9810-DDATFIM < COCV9810-DDATINI
               MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
               MOVE COCK0002-CAPLIC        TO COCV9811-DDATFIM-CAPLIC
               MOVE COCK0002-STATUS-ACTIVO TO COCV9811-DDATFIM-S
               MOVE COCK0001-INTER-INV     TO COCV9811-DDATFIM-MSG
               MOVE COCK0002-CAPLIC        TO COCV9811-DDATINI-CAPLIC
               MOVE COCK0002-STATUS-ACTIVO TO COCV9811-DDATINI-S
               MOVE COCK0001-INTER-INV     TO COCV9811-DDATINI-MSG
             END-IF
           END-IF.

       2299-VALIDACOES-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *                   2300-INSERE-DADOS.
      *-------------------------------------------------------------
       2300-INSERE-DADOS.

           IF VIAL0001-DEBUG-SIM
              MOVE '2300-INSERE-DADOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV9810-CFAMD           TO COCD7501-CFAMD.
           MOVE COCV9810-CCODDOC         TO COCD7501-CCODDOC.
           MOVE COCV9810-DDATINI         TO COCD7501-DDATINI.
           MOVE COCV9810-COBG            TO COCD7501-COBG.
           MOVE COCV9810-DDATFIM         TO COCD7501-DDATFIM.
           MOVE VIAL0001-CUTILIZA-I      TO COCD7501-CUSERID.

           IF VIAL0002-SEM-ERROS

           EXEC SQL
                INSERT INTO COVT7501
                (
                   CFAMD
                 , CCODDOC
                 , DDATINI
                 , COBG
                 , DDATFIM
                 , CUSERID
                 , HTIMEST
                )
                VALUES (
                       :COCD7501-CFAMD
                     , :COCD7501-CCODDOC
                     , :COCD7501-DDATINI
                     , :COCD7501-COBG
                     , :COCD7501-DDATFIM
                     , :COCD7501-CUSERID
                     ,  CURRENT TIMESTAMP
                )
           END-EXEC

              MOVE CON-COVT7501 TO VIAL0002-TABLE-NAME

              PERFORM 9020-DB2CHECK
                 THRU 9029-DB2CHECK-EXIT

              IF VIAL0002-SEM-ERROS
                 IF DB2-DUPREC
                    MOVE VIAK0002-ERROS-FUNCAO
                      TO VIAL0002-IND-ERROS
                      MOVE COCK0002-STATUS-ACTIVO
                        TO COCV9811-CFAMD-S
                      MOVE COCK0001-CFAMD-EXISTS
                        TO COCV9811-CFAMD-MSG
                      MOVE COCK0002-CAPLIC
                        TO COCV9811-CFAMD-CAPLIC
                 ELSE
                    IF NOT DB2-OK
                       MOVE VIAK0002-ABEND-DB2
                         TO VIAL0002-IND-ERROS
                       MOVE VIAK0001-ERRO-DB2
                         TO VIAL0002-COD-ERRO-GRAVE
                    END-IF
                 END-IF
              END-IF
           END-IF.

       2399-INSERE-DADOS-EXIT.
           EXIT.

      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.

           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCV9811-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV9811-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV9811-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES                     TO VIAL0001-OCORRENCIAS.

       3099-FINAL-PROGRAMA-EXIT.
           EXIT.
      *==============================================================
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0010.
           COPY VIAP0016.
