       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COI96106.
      ******************************************************************
      *     PROGRAMA COI96106.                                         *
      *                                                                *
      *     Manutenção Contratos
      ******************************************************************
      *     LOG ALTERACOES:                                            *
      *   USER     / DATA     /   REFERENCIA / OBSERVACOES             *
      *                                                                *
      *                                                                *
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *--------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *--------------------------------------------------------------
       01  FILLER                          PIC X(40) VALUE
           'INICIO WORKING-STORAGE COI96106         '.
      *--------------------------------------------------------------
      *            DECLARACOES DE DB2
      *--------------------------------------------------------------
           EXEC SQL INCLUDE COCD7402 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      *--------------------------------------------------------------
      *            MENSAGEM DE INPUT E  OUTPUT
      *--------------------------------------------------------------
       COPY COCV9610.
       COPY COCV9611.
      *--------------------------------------------------------------
      *            AREAS DE TRABALHO
      *--------------------------------------------------------------
       COPY VIAL0010.
       COPY VIAL0015.
       COPY VIAW0005.
       COPY VIAK0001.
       COPY VIAK0002.
       COPY COCK0001.
       COPY COCK0002.
       COPY VIAL1000.
       COPY VIATW300.
       COPY ETCL0002.
       COPY WACK0002.
       COPY WACL0025.
      *
      *--------------------------------------------------------------
      *            CONSTANTES
      *--------------------------------------------------------------
       01  WS-CONSTANTES.
           05 CON-N-DEFINIDO  PIC X(02) VALUE 'ND'.
           05 CON-COVT7402 PIC X(08) VALUE 'COVT7402'.
           05 CON-A        PIC X(01) VALUE 'A'.
           05 CON-S        PIC X(01) VALUE 'S'.
           05 CON-N        PIC X(01) VALUE 'N'.
           05 CON-CC       PIC X(02) VALUE 'CC'.
           05 CON-01       PIC X(02) VALUE '01'.
           05 CON-02       PIC X(02) VALUE '02'.
           05 CON-03       PIC X(02) VALUE '03'.
           05 CON-04       PIC X(02) VALUE '04'.
           05 CON-05       PIC X(02) VALUE '05'.
           05 CON-21       PIC X(02) VALUE '21'.
           05 CON-36       PIC 9(02) VALUE 36.
           05 CON-1        PIC 9(01) VALUE 1.
           05 CON-6        PIC 9(02) VALUE 6.

      *--------------------------------------------------------------
      *            PROGRAM CONTROL
      *--------------------------------------------------------------
       01  WS-PROGRAM-CONTROL.
           05 WS-PROGNAME     PIC  X(08) VALUE 'COI96106'.
           05 WS-NUMDOC       PIC  X(50) VALUE SPACES.
           05 WS-NTRAB-ANTES  PIC  X(03) VALUE SPACES.
           05 WS-51           PIC  9(01) VALUE ZEROS.
           05 WS-70           PIC  9(01) VALUE ZEROS.
           05 WS-ERRO-CC      PIC  9(01) VALUE ZEROS.
      *--------------------------------------------------------------
       01  FILLER                        PIC X(40) VALUE
           'FIM DA WORKING-STORAGE COI96106         '.
      *--------------------------------------------------------------
       LINKAGE SECTION.
      *--------------------------------------------------------------
       COPY VIAL0004.
      *
            EXEC SQL INCLUDE VIAP0009 END-EXEC.
      *
      *--------------------------------------------------------------
      *            0000-MAINLINE
      *--------------------------------------------------------------
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2000-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FINAL-PROGRAMA
              THRU 3000-FINAL-PROGRAMA-EXIT.
      *
       0000-MAINLINE-EXIT.
           COPY VIAP0004.
      *--------------------------------------------------------------
       1000-INICIO-PROGRAMA.
      *--------------------------------------------------------------
           IF VIAL0001-DEBUG-SIM
              MOVE '1000-INICIO-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE VIAL0001-MENSAGEM-INPUT    TO COCV9610-MSG.
           MOVE COCV9610-ASE               TO COCV9611-ASE.
      *
       1000-INICIO-PROGRAMA-EXIT.
           EXIT.

      *--------------------------------------------------------------
       2000-PROC-PROGRAMA.
      *--------------------------------------------------------------
           IF VIAL0001-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE COCV9610-ADE               TO COCV9611-ADE.
      *
           IF VIAL0002-SEM-ERROS
              PERFORM 2200-VALIDACOES
                 THRU 2200-VALIDACOES-EXIT
           END-IF.
      *
           IF VIAL0002-SEM-ERROS
              PERFORM 2300-MODIFICA-DADOS
                 THRU 2300-MODIFICA-DADOS-EXIT
           END-IF.
      *
       2000-PROC-PROGRAMA-EXIT.
           EXIT.

      *--------------------------------------------------------------
       2200-VALIDACOES.
      *--------------------------------------------------------------
           IF VIAL0001-DEBUG-SIM
              MOVE '2200-VALIDACOES' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           IF  VIAL0002-SEM-ERROS
           AND COCV9610-DDATFIM < COCV9610-DDATINI
              MOVE VIAK0002-ERROS-FUNCAO  TO VIAL0002-IND-ERROS
              MOVE COCK0002-STATUS-ACTIVO TO COCV9611-DDATINI-S
              MOVE COCK0001-INTER-INV     TO COCV9611-DDATINI-MSG
              MOVE COCK0002-CAPLIC        TO COCV9611-DDATINI-CAPLIC
              MOVE COCK0002-STATUS-ACTIVO TO COCV9611-DDATFIM-S
              MOVE COCK0001-INTER-INV     TO COCV9611-DDATFIM-MSG
              MOVE COCK0002-CAPLIC        TO COCV9611-DDATFIM-CAPLIC
           END-IF.
      *
       2200-VALIDACOES-EXIT.
           EXIT.

      *--------------------------------------------------------------
       2300-MODIFICA-DADOS.
      *--------------------------------------------------------------
           IF VIAL0001-DEBUG-SIM
              MOVE '2300-MODIFICA-DADOS' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE COCV9610-ZCUNICO           TO COCD7402-ZCUNICO  .
           MOVE COCV9610-CCONTRATO         TO COCD7402-CCONTRATO.
           MOVE COCV9610-ZSEQ              TO COCD7402-ZSEQ     .
           MOVE COCV9610-GREFCONT          TO COCD7402-GREFCONT .
           MOVE COCV9610-DDATINI           TO COCD7402-DDATINI  .
           MOVE COCV9610-CPRAZO            TO COCD7402-CPRAZO   .
           MOVE COCV9610-DDATFIM           TO COCD7402-DDATFIM  .
           MOVE COCV9610-CRENOV            TO COCD7402-CRENOV   .
           MOVE COCV9610-DDATINIU          TO COCD7402-DDATINIU .
           MOVE COCV9610-DDATFIMU          TO COCD7402-DDATFIMU .
           MOVE COCV9610-CTIPPER           TO COCD7402-CTIPPER  .
           MOVE COCV9610-NDIASAVI          TO COCD7402-NDIASAVI .
           MOVE COCV9610-GOBSERV           TO COCD7402-GOBSERV  .
           MOVE VIAL0001-CUTILIZA-I        TO COCD7402-CUSERID  .
           MOVE COCV9610-DDATINIP          TO COCD7402-DDATINIP .
           MOVE COCV9610-DDATFIMP          TO COCD7402-DDATFIMP .
      *
           EXEC SQL
                 UPDATE
                COVT7402
                SET
                       ZCUNICO      = :COCD7402-ZCUNICO
                     , CCONTRATO    = :COCD7402-CCONTRATO
                     , ZSEQ         = :COCD7402-ZSEQ
                     , GREFCONT     = :COCD7402-GREFCONT
                     , DDATINI      = :COCD7402-DDATINI
                     , CPRAZO       = :COCD7402-CPRAZO
                     , DDATFIM      = :COCD7402-DDATFIM
                     , CRENOV       = :COCD7402-CRENOV
                     , DDATINIU     = :COCD7402-DDATINIU
                     , DDATFIMU     = :COCD7402-DDATFIMU
                     , CTIPPER      = :COCD7402-CTIPPER
                     , NDIASAVI     = :COCD7402-NDIASAVI
                     , GOBSERV      = :COCD7402-GOBSERV
                     , CUSERID      = :COCD7402-CUSERID
                     , HTIMEST      = CURRENT TIMESTAMP
                     , DDATINIP     = :COCD7402-DDATINIP
                     , DDATFIMP     = :COCD7402-DDATFIMP

                 WHERE ZCUNICO   = :COCD7402-ZCUNICO
                 AND   CCONTRATO = :COCD7402-CCONTRATO
                 AND   ZSEQ      = :COCD7402-ZSEQ
           END-EXEC
      *
           MOVE CON-COVT7402               TO VIAL0002-TABLE-NAME.
      *
           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.
      *
           IF VIAL0002-SEM-ERROS
              IF DB2-NOTFND
                 MOVE VIAK0002-ERROS-FUNCAO
                   TO VIAL0002-IND-ERROS
                    MOVE COCK0002-STATUS-ACTIVO
                      TO COCV9611-CCONTRATO-S
                    MOVE COCK0001-CCONTRATO-N-EXISTS
                      TO COCV9611-CCONTRATO-MSG
                    MOVE COCK0002-CAPLIC
                      TO COCV9611-CCONTRATO-CAPLIC
              ELSE
                 IF NOT DB2-OK
                    MOVE VIAK0002-ABEND-DB2
                      TO VIAL0002-IND-ERROS
                    MOVE VIAK0001-ERRO-DB2
                      TO VIAL0002-COD-ERRO-GRAVE
                 END-IF
              END-IF
           ELSE
              MOVE VIAK0002-ABEND-DB2
                TO VIAL0002-IND-ERROS
              MOVE VIAK0001-ERRO-DB2
                TO VIAL0002-COD-ERRO-GRAVE
           END-IF.
      *
       2300-MODIFICA-DADOS-EXIT.
           EXIT.
      *--------------------------------------------------------------
      *            3000-FINAL-PROGRAMA
      *--------------------------------------------------------------
       3000-FINAL-PROGRAMA.
      *
           IF VIAL0001-DEBUG-SIM
              MOVE '3000-FINAL-PROGRAMA' TO VIAL0015-CALLER-ID
              PERFORM VIAP0016-TRATA-DEBUG
                 THRU VIAP0016-TRATA-DEBUG-EXIT
           END-IF.
      *
           MOVE COCV9611-MSG               TO VIAL0001-MENSAGEM-OUTPUT.
           MOVE COCV9611-LENGTH            TO VIAL0001-LENGTH-MSG.
           MOVE COCV9611-NR-CAMPOS         TO VIAL0001-NR-CAMPOS.
           MOVE ZEROES                     TO VIAL0001-OCORRENCIAS.
      *
       3000-FINAL-PROGRAMA-EXIT.
           EXIT.
      *--------------------------------------------------------------
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
      *==============================================================
           COPY VIAP0010.
           COPY VIAP0016.
           COPY VIAP1000.
           COPY VIATP300.
