       IDENTIFICATION DIVISION.
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
       PROGRAM-ID. COM00300.

      ******************************************************************
      *                       ERP VIA                                  *
      ******************************************************************
      * OBJECTIVO: ROTINA STANDARD DE VALIDACAO DE DADOS DE PROJECTO   *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
      ******************************************************************
      *                     CONFIGURATION SECTION                      *
      ******************************************************************
      *SPECIAL-NAMES.
      *    DECIMAL-POINT IS COMMA.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                    WORKING STORAGE SECTION                     *
      ******************************************************************
       01  FILLER                       PIC  X(40)
            VALUE 'INICIO WORKING-STORAGE DO COM00300      '.
      ******************************************************************
      * CONSTANTES
      ******************************************************************
       01  WS-CONSTANTES.
           05 WS-PROGNAME               PIC X(10) VALUE 'COM00300'.
           05 WS-COVT6500               PIC X(10) VALUE 'COVT6500'.

      ******************************************************************
      * VARIAVEIS
      ******************************************************************
       01  WS-VARIAVEIS.
           05 WS-FACTOR           PIC S9(15)V9(05) VALUE ZEROS.
           05 WS-ZCUNICO          PIC X(10) VALUE SPACES.
           05 WS-CUTILIZA         PIC X(20) VALUE SPACES.
           05 WS-EMPRESAS         PIC X(10) VALUE SPACES.
           05 WS-NIDPROJECTO      PIC X(10) VALUE SPACES.

      ******************************************************************
      * COPYS
      ******************************************************************
           COPY COCK0001.
           COPY COCK0002.
           COPY VIAK0001.
           COPY VIAK0002.
           COPY VIAL0015.
           COPY VIACK001.
           COPY VIAW0005.
           COPY VIAL0001.

      ******************************************************************
      * DB2
      ******************************************************************
           EXEC SQL INCLUDE SQLCA    END-EXEC.
           EXEC SQL INCLUDE COCD6500 END-EXEC.
      ******************************************************************
       01  FILLER                      PIC X(40)
            VALUE 'FIM DA WORKING-STORAGE COM00300         '.

      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
      *                        LINKAGE SECTION                         *
      ******************************************************************
           COPY ETCL0002.
           COPY COCL0030.
      ******************************************************************
       PROCEDURE DIVISION USING ETCL0002-COMMAREA
                                COCL0030-COMMAREA.
      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
       0000-MAINLINE.

           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           IF ETCL0002-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2000-PROC-PROGRAMA-EXIT
           END-IF.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.

       0000-MAINLINE-EXIT.
           GOBACK.

      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************

           INITIALIZE WS-VARIAVEIS.

           PERFORM 1100-VALIDAR-DADOS-INPUT
              THRU 1100-VALIDAR-DADOS-INPUT-EXIT.

       1000-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       1100-VALIDAR-DADOS-INPUT.
      ******************************************************************

           IF ETCL0002-DEBUG-SIM
              MOVE '1100-VALIDAR-DADOS-INPUT'  TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           IF COCL0030-CGATILHO = SPACES
              SET ETCL0002-ERROS-FUNCAO TO TRUE
              MOVE COCK0002-CAPLIC TO ETCL0002-CAPLIC-ERRO
              MOVE COCK0001-VAR-ESP TO ETCL0002-NR-ERRO
           END-IF.

       1100-VALIDAR-DADOS-INPUT-EXIT.
           EXIT.

      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************

      **R  IF ETCL0002-DEBUG-SIM
              MOVE '2000-PROC-PROGRAMA   ' TO VIAL0015-CALLER-ID
              MOVE 'ETCL0002-DATA-PROCESSO'  TO VIAL0015-CAMPO-NM(1)
              MOVE  ETCL0002-DATA-PROCESSO   TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
      **R  END-IF.

           IF ETCL0002-SEM-ERROS
              PERFORM 2110-SEQ-GATILHO
                 THRU 2110-SEQ-GATILHO-EXIT
           END-IF.

           IF ETCL0002-SEM-ERROS
              PERFORM 2120-INS-GATILHO
                 THRU 2120-INS-GATILHO-EXIT
           END-IF.

       2000-PROC-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       2110-SEQ-GATILHO.
      ******************************************************************

           IF ETCL0002-DEBUG-SIM
              MOVE '2110-SEQ-GATILHO    ' TO VIAL0015-CALLER-ID
              MOVE 'ETCL0002-DATA-PROCESSO'  TO VIAL0015-CAMPO-NM(1)
              MOVE  ETCL0002-DATA-PROCESSO   TO VIAL0015-CAMPO-VLR(1)
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCL0030-CGATILHO       TO COCD6500-CGATILHO.
           MOVE ETCL0002-DATA-PROCESSO  TO COCD6500-DTPROC.

           EXEC SQL
              SELECT IFNULL(MAX(NSEQ), 0)
                INTO :COCD6500-NSEQ
                FROM COVT6500_GATILHOS
               WHERE CGATILHO    = :COCD6500-CGATILHO
                 AND DTPROC      = :COCD6500-DTPROC
           END-EXEC.

           MOVE WS-COVT6500 TO ETCL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF ETCL0002-SEM-ERROS
              IF DB2-OK
                ADD 1 TO COCD6500-NSEQ
              ELSE
                MOVE 1 TO COCD6500-NSEQ
              END-IF
           END-IF.

       2110-SEQ-GATILHO-EXIT.
           EXIT.

      ******************************************************************
       2120-INS-GATILHO.
      ******************************************************************

           IF ETCL0002-DEBUG-SIM
              MOVE '2120-INS-GATILHO    ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

           MOVE COCL0030-CGATILHO       TO COCD6500-CGATILHO.
           MOVE COCL0030-CCHAVE         TO COCD6500-CCHAVE.
           MOVE COCL0030-GDESC          TO COCD6500-GDESC.
           MOVE COCL0030-DADOS          TO COCD6500-DADOS.
           MOVE ETCL0002-USER-EXTRN     TO COCD6500-CUSERID.
           MOVE SPACES                  TO COCD6500-CSITUACAO.

           EXEC SQL
                INSERT  INTO COVT6500_GATILHOS
                       (CGATILHO
                      , DTPROC
                      , NSEQ
                      , CCHAVE
                      , GDESC
                      , DADOS
                      , CSITUACAO
                      , CUSERID
                      , HTIMEST)
                 VALUES(:COCD6500-CGATILHO
                      , :COCD6500-DTPROC
                      , :COCD6500-NSEQ
                      , :COCD6500-CCHAVE
                      , :COCD6500-GDESC
                      , :COCD6500-DADOS
                      , :COCD6500-CSITUACAO
                      , :COCD6500-CUSERID
                      ,  CURRENT_TIMESTAMP)
           END-EXEC.

           MOVE WS-COVT6500 TO ETCL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF ETCL0002-SEM-ERROS
              IF NOT DB2-OK
                 SET  ETCL0002-ERROS-FUNCAO TO TRUE
                 MOVE COCK0002-CAPLIC TO ETCL0002-CAPLIC-ERRO
                 MOVE COCK0001-PROJ-NAO-EXIST TO ETCL0002-NR-ERRO
              END-IF
           END-IF.

       2120-INS-GATILHO-EXIT.
           EXIT.
      ******************************************************************
       3000-FIM-PROGRAMA.
      ******************************************************************
           IF ETCL0002-DEBUG-SIM
              MOVE '3000-FIM-PROGRAMA    ' TO VIAL0015-CALLER-ID
              PERFORM VIAP0015-TRATA-DEBUG
                 THRU VIAP0015-TRATA-DEBUG-EXIT
           END-IF.

       3000-FIM-PROGRAMA-EXIT.
            EXIT.

      ******************************************************************
      *                       AREA DE PROCEDURES                       *
      ******************************************************************
           EXEC SQL INCLUDE VIAP0099 END-EXEC.
           COPY VIAP0015.
           COPY VIAP0016.

      ******************************************************************
