       01 TGCK0001-ERRORS.
          05 TGCK0001-GFICHEI-EXISTS PIC S9(4) VALUE +1.
          05 TGCK0001-GFICHEI-N-EXISTS PIC S9(4) VALUE +2.
          05 TGCK0001-GFICHEI-A-EXISTS PIC S9(4) VALUE +3.
          05 TGCK0001-FICHE-EXISTS PIC S9(4) VALUE +4.
          05 TGCK0001-FICHE-N-EXISTS PIC S9(4) VALUE +5.
          05 TGCK0001-FICHE-A-EXISTS PIC S9(4) VALUE +6.
          05 TGCK0001-NSEQRG-EXISTS PIC S9(4) VALUE +7.
          05 TGCK0001-NSEQRG-N-EXISTS PIC S9(4) VALUE +8.
          05 TGCK0001-NSEQRG-A-EXISTS PIC S9(4) VALUE +9.
      *
          05 TGCK0001-ERR-GFICHEI PIC S9(4) VALUE +800.
      ***************************************************
      ** ERROS NA VALIDAÇÃO DA CONTA
      ***************************************************
          05 TGCK0001-ORD-BLOQ          PIC S9(4) VALUE +1267.
          05 TGCK0001-CNT-INEX          PIC S9(4) VALUE +1268.
          05 TGCK0001-CNT-ABAN          PIC S9(4) VALUE +1269.
          05 TGCK0001-CNT-INAC          PIC S9(4) VALUE +1270.
          05 TGCK0001-CNT-ENCE          PIC S9(4) VALUE +1271.
          05 TGCK0001-BEN-BLOQ          PIC S9(4) VALUE +1272.
      ***************************************************
      ** ERROS COMUNS
      ***************************************************
          05 TGCK0001-USER-BAL-ERR      PIC S9(4) VALUE +1288.
          05 TGCK0001-ANUL-DAT-ERR      PIC S9(4) VALUE +1289.
          05 TGCK0001-ERR-USER-AUTR     PIC S9(4) VALUE +1290.
          05 TGCK0001-ERR-TEIS-DNUTIL   PIC S9(4) VALUE +1291.
          05 TGCK0001-ERR-AUTORIDADE    PIC S9(4) VALUE +1292.
          05 TGCK0001-ERR-USR-ESTORNO   PIC S9(4) VALUE +1293.
          05 TGCK0001-CNT-BLOQ          PIC S9(4) VALUE +1294.
      ***************************************************
      ** ERROS ONLINE CRIADOS MANUALMENTE
      ***************************************************
      ***************************************************
      ** ERROS CENTRAIS CRIADOS MANUALMENTE
      ***************************************************
          05 TGCK0001-ERR-TTR           PIC S9(04) VALUE 1500.
          05 TGCK0001-REG-INEXIST       PIC S9(04) VALUE 1501.
          05 TGCK0001-ERR-OPEN          PIC S9(04) VALUE 1502.
          05 TGCK0001-ERR-READ          PIC S9(04) VALUE 1503.
          05 TGCK0001-ERR-CLOSE         PIC S9(04) VALUE 1504.
          05 TGCK0001-ERR-FORMATO       PIC S9(04) VALUE 1505.
          05 TGCK0001-ERR-FICHEIRO      PIC S9(04) VALUE 1506.
          05 TGCK0001-ERR-BALANCO       PIC S9(04) VALUE 1507.
          05 TGCK0001-ERR-MOEDA         PIC S9(04) VALUE 1508.
          05 TGCK0001-ERR-COPE          PIC S9(04) VALUE 1509.
          05 TGCK0001-ERR-CONTAB        PIC S9(04) VALUE 1510.
          05 TGCK0001-ERR-PARAM         PIC S9(04) VALUE 1511.
          05 TGCK0001-ERR-CCB           PIC S9(04) VALUE 1512.
          05 TGCK0001-ERR-VALOR         PIC S9(04) VALUE 1513.
          05 TGCK0001-ERR-SITUACAO      PIC S9(04) VALUE 1514.
          05 TGCK0001-ERR-CONFLITO      PIC S9(04) VALUE 1515.
          05 TGCK0001-ERR-REGISTO       PIC S9(04) VALUE 1516.
