      *****************************************************************
      * NOME:      VIAL0080                                           *
      * DESCRICAO: AREA DE LIGACAO DA ROTINA VIAR0080                 *
      * AUTOR:     VIA CONSULTING                                     *
      *****************************************************************
       01 VIAL0080-NM-ROTINA              PIC X(10) VALUE 'VIAR0080'.
       01 VIAL0080-COMMAREA.
          05 VIAL0080-NTELEFONE           PIC X(20) VALUE SPACES.
          05 VIAL0080-NTELEFONE-OUT       PIC X(20) VALUE SPACES.
