      ***************************************************************
      * NOME:      VIAL1010                                         *
      * DESCRICAO: AREA DE LIGACAO DA ROTINA VIAR1010               *
      * AUTOR:     VIA CONSULTING                                   *
      ***************************************************************
       01  VIAL1010-NM-ROTINA          PIC  X(10)  VALUE 'VIAR1010'.
       01  VIAL1010-COMMAREA.
           05 VIAL1010-TIMEZONEIN      PIC  X(10)  VALUE SPACES.
           05 VIAL1010-DINPUT          PIC  X(10)  VALUE SPACES.
           05 VIAL1010-HINPUT          PIC  X(08)  VALUE SPACES.
           05 VIAL1010-TSINPUT         PIC  X(26)  VALUE SPACES.
           05 VIAL1010-TIMEZONEOUT     PIC  X(10)  VALUE SPACES.
           05 VIAL1010-DOUTPUT         PIC  X(10)  VALUE SPACES.
           05 VIAL1010-HOUTPUT         PIC  X(08)  VALUE SPACES.
           05 VIAL1010-TSOUTPUT        PIC  X(26)  VALUE SPACES.
      ***************************************************************
