      *****************************************************************
      * NOME:      VIAL0032                                           *
      * DESCRICAO: AREA DE LIGACAO DA ROTINA VIAR0032                 *
      * AUTOR:     VIA CONSULTING                                     *
      *****************************************************************
       01  VIAL0032-NM-ROTINA        PIC X(10)      VALUE 'VIAR0032'.
       01  VIAL0032-ROTINA-SEQ       PIC X(10)      VALUE 'VIAR0032'.
       01  VIAL0032-COMMAREA.
           05  VIAL0032-IACCAO                   PIC X(01).
               88 VIAL0032-SOMA-1                VALUE '1'.
               88 VIAL0032-FORCA-1               VALUE '2'.
               88 VIAL0032-SOMA-VALOR            VALUE '3'.
               88 VIAL0032-FORCA-VALOR           VALUE '4'.
               88 VIAL0032-VALIDA                VALUE '5'.
               88 VIAL0032-DATA-SEQ              VALUE '6'.
           05 VIAL0032-AREA-DADOS.
               10 VIAL0032-CSEQUEN               PIC  X(20).
               10 VIAL0032-NSEQUEN-1             PIC  9(17).
               10 VIAL0032-NSEQUEN-2             PIC  9(17).
               10 VIAL0032-VALOR-ACUM            PIC  9(17).
               10 VIAL0032-NSEQ-DATA             PIC  9(17).
