      ***************************************************************
      * NOME:      VIAL1020                                         *
      * DESCRICAO: AREA DE LIGACAO DA ROTINA VIAR1020               *
      * AUTOR:     VIA CONSULTING                                   *
      ***************************************************************
       01  VIAL1020-NM-ROTINA          PIC  X(10)  VALUE 'VIAR1020'.
       01  VIAL1020-COMMAREA.
           05 VIAL1020-CAPLIC          PIC  X(02)  VALUE SPACES.
           05 VIAL1020-HTIMEST         PIC  X(26)  VALUE SPACES.
           05 VIAL1020-DATA-HORA       REDEFINES   VIAL1020-HTIMEST.
              10 VIAL1020-DDATA        PIC  X(10).
              10 FILLER                PIC  X(01).
              10 VIAL1020-HHORA        PIC  X(08).
      ***************************************************************
