      *****************************************************************
      * NOME:      VIAL0035                                           *
      * DESCRICAO: AREA DE LIGACAO DA ROTINA VIAR0035                 *
      * AUTOR:     VIA CONSULTING                                     *
      *****************************************************************
       01 VIAL0035-ROTINA                PIC  X(08) VALUE 'VIAR0035'.
       01 VIAL0035-COMMAREA.
          05 VIAL0035-I-ACCAO            PIC  X(01).
             88 VIAL0035-ENCRIPTA        VALUE '1'.
             88 VIAL0035-DESENCRIPTA     VALUE '2'.
          05 VIAL0035-INPUT              PIC  X(25).
          05 VIAL0035-INPUT-HEX          PIC  X(50).
          05 VIAL0035-OUTPUT             PIC  X(25).
          05 VIAL0035-OUTPUT-HEX         PIC  X(50).
          05 VIAL0035-APIERR.
             10 VIAL0035-ERRMSGID        PIC  X(07) VALUE SPACES.
                88 VIAL0035-SEM-ERROS    VALUE SPACES.
