      ******************************************************************
      *                                                                *
      *       VIAL3001   AREA COMUNICACAO WORKFLOW                     *
      *                                                                *
      ******************************************************************
       01  VIAL3001-DATA.
           05 VIAL3001-INPUT.
             10 VIAL3001-CAPLIC                PIC X(02).
             10 VIAL3001-COPCAO                PIC X(03).
             10 VIAL3001-CACCAO                PIC X(01).
             10 VIAL3001-CVALOR                PIC X(250).
             10 VIAL3001-FILLER-INPUT          PIC X(200).
           05 VIAL3001-OUTPUT.
             10 VIAL3001-CAPLICO               PIC X(02).
             10 VIAL3001-COPCAOO               PIC X(03).
             10 VIAL3001-CACCAOO               PIC X(01).
             10 VIAL3001-FILLER-OUTPUT         PIC X(200).
