      *****************************************************************
      * NOME:      VIAL1015                                           *
      * DESCRICAO: VARIAVEIS DE LINKAGE DO MODULO DE DEBUG            *
      * CRICAO:    2011-01-02                                         *
      * AUTOR:     ANTONIO RODRIGUES                                  *
      *===============================================================*
      *****************************************************************
      *    VIAL1015 - TRATAMENTO DE DEBUG                             *
      *****************************************************************
       01  VIAL1015-DATA.
           05 VIAL1015-PROGRAMA.
              10 VIAL1015-CAPLIC           PIC  X(02) VALUE SPACES.
              10 VIAL1015-CTIPO            PIC  X(01) VALUE 'I'.
              10 VIAL1015-COPCAO           PIC  X(03) VALUE SPACES.
              10 VIAL1015-CACCAO           PIC  X(02) VALUE SPACES.
                 88 VIAL1015-VISUALIZACAO    VALUE '02'.
                 88 VIAL1015-CRIACAO         VALUE '04'.
                 88 VIAL1015-MODIFICACAO     VALUE '06'.
                 88 VIAL1015-ANULACAO        VALUE '08'.
                 88 VIAL1015-CONSULTALISTA   VALUE '00'.
              10 VIAL1015-CFILLER          PIC  X(02) VALUE '  '.
           05 VIAL1015-CALLER-ID           PIC  X(30) VALUE SPACES.
           05 VIAL1015-CUTILIZA            PIC  X(20) VALUE SPACES.
           05 VIAL1015-CAMPOS-CHAVE.
              10 VIAL1015-CAMPOS         OCCURS 10 TIMES.
                 15 VIAL1015-CAMPO-NM      PIC  X(30).
                 15 VIAL1015-CAMPO-VLR     PIC  X(50).
           05 VIAL1015-I-DEBUG             PIC  X(01) VALUE SPACES.
              88 VIAL1015-DEBUG-SIM                   VALUE 'S'.
              88 VIAL1015-DEBUG-NAO                   VALUE 'N'.
           05 VIAL1015-TIMESTAMP           PIC  X(26).
       01  VIAL1015-CON.
           05 VIAL1015-ROTINA-DEBUG        PIC  X(10) VALUE 'VIAM0015'.
