      ****************************************************************
      *                                                              *
      *               FICHEIRO DE LOG DE ACESSO WEBSERVICE           *
      *                                                              *
      *                      MAPA:  VIAL0060                         *
      *                                                              *
      ****************************************************************
       01  VIAL0060-DATA.
           05 VIAL0060-WEBSERVICE       PIC X(10).
           05 VIAL0060-CAPLIC           PIC X(02).
           05 VIAL0060-COPCAO           PIC X(03).
           05 VIAL0060-IIO              PIC X(01).
              88 VIAL0060-IIO-IN                    VALUE 'I'.
              88 VIAL0060-IIO-OUT                   VALUE 'O'.
           05 VIAL0060-CALLER-ID        PIC X(10).
           05 VIAL0060-CUTILIZA         PIC X(20).
           05 VIAL0060-DATA-PROCESSO    PIC X(10).
           05 VIAL0060-NR-SEQUENCIA     PIC 9(10).
           05 VIAL0060-HORA-PROCESSO    PIC X(10).
           05 VIAL0060-MENSAGEM         PIC X(11500).
           05 VIAL0060-CUSERID          PIC X(10).
           05 VIAL0060-HTIMEST         PIC X(26).
      *
       01  VIAL0060-ROTINA              PIC X(10)   VALUE 'VIAM0060'.
