      ******************************************************************
      *                                                                *
      *       VIAL0010   AREA INPUT ROTINA DE LOG DE ALTERACOES        *
      *                                                                *
      ******************************************************************
       01  VIAL0010-COMMAREA.
           05 VIAL0010-CCHAVE               PIC X(30).
           05 VIAL0010-GVALCHAVE            PIC X(30).
           05 VIAL0010-CCOLALT              PIC X(30).
           05 VIAL0010-GVALALT              PIC X(60).
       01  VIAL0010-PGMID                   PIC X(08) VALUE 'VIAR0010'.
