      ******************************************************************
      *                                                                *
      *       VIAL0907   AREA COMUNICACAO DECOD ERROS EXTERNOS         *
      *                                                                *
      ******************************************************************
       01  VIAL0907-COMMAREA.
           05 VIAL0907-INPUT.
             10 VIAL0907-CACCAO                      PIC X(02).
                88 VIAL0907-CACCAO-TRACE       VALUE 'TR'.
                88 VIAL0907-CACCAO-ERROR       VALUE 'ER'.
             10 VIAL0907-CMSGEXTR                    PIC X(07).
             10 VIAL0907-CSYSVER                     PIC X(03).
             10 VIAL0907-GMSGORIG                    PIC X(80).
           05 VIAL0907-OUTPUT.
             10 VIAL0907-CERRMSG                     PIC 9(04).
             10 VIAL0907-CAPLIC                      PIC X(02).
             10 VIAL0907-IND-ERR                     PIC X(02).
             10 VIAL0907-IMSGTYPE                    PIC X(02).
