      ***************************************************************
      * DESCRICAO: LINKAGE CONVERSAO HEX PARA CHAR
      * AUTOR    : VIA CONSULTING
      ***************************************************************
       01 VIAL0040-COMMAREA.
          05 VIAL0040-STR-IN           PIC  X(320) VALUE SPACES.
          05 VIAL0040-STR-OUT          PIC  X(160) VALUE SPACES.
