      ******************************************************************
      *                                                                *
      *       VIAL2000   AREA COMUNICACAO CODESTABLES LOCAL->CENTRAL   *
      *                                                                *
      ******************************************************************
       01  VIAL2000-COMMAREA.
           05 VIAL2000-CTRANSACCAO                 PIC X(04).
           05 VIAL2000-INPUT.
             10 VIAL2000-ORIGEM                PIC X(10).
               88 VIAL2000-ORIGEM-VIACODTAB   VALUE 'VIACODTAB'.
               88 VIAL2000-ORIGEM-VIATABOUT   VALUE 'VIATABOUT'.
      **R    10 VIAL2000-FASE                  PIC X(1).
      **R      88 VIAL2000-FASE-INIT          VALUE 'I'.
      **R      88 VIAL2000-FASE-EXEC          VALUE 'E'.
             10 VIAL2000-CUTILIZA              PIC X(20).
             10 VIAL2000-TRANSACCAO.
               15 VIAL2000-CAPLIC             PIC X(02).
               15 VIAL2000-CACCAO             PIC X(01).
                 88 VIAL2000-DEVOLVEDESC     VALUE 'R'.
                 88 VIAL2000-CONSULTALISTA   VALUE 'L'.
             10 VIAL2000-CTABELA               PIC X(05).
             10 VIAL2000-CTABELA-R REDEFINES VIAL2000-CTABELA.
               15 VIAL2000-CTABELA-TIPO        PIC X(02).
               15 FILLER                       PIC X(03).
             10 VIAL2000-CLINGUA               PIC X(10).
             10 VIAL2000-GCONTEXT              PIC X(25).
             10 VIAL2000-CCOD                  PIC X(50).
JF    *      10 VIAL2000-C2COD                 PIC X(50).
             10 VIAL2000-GDESC                 PIC X(3000).
             10 VIAL2000-GPAGINGCODE           PIC X(50).
JF           10 VIAL2000-C2COD                 PIC X(50).
JF           10 VIAL2000-IART05                PIC X(01).
           05 VIAL2000-OUTPUT.
             10 VIAL2000-IND-ERROS             PIC X(02).
               88 VIAL2000-ABEND                 VALUE 'A1'.
               88 VIAL2000-ABEND-DB2             VALUE 'A2'.
               88 VIAL2000-ERROS-ARQ             VALUE 'AT'.
               88 VIAL2000-ERROS-VALIDOS         VALUE 'FU' 'FC'
                                                       'OK'.
               88 VIAL2000-ERROS-FUNCAO          VALUE 'FU'.
               88 VIAL2000-FIM-CONSULTA          VALUE 'FC'.
               88 VIAL2000-SEM-ERROS             VALUE 'OK' '  '.
               88 VIAL2000-ERROS-ABEND           VALUE 'A1' 'A2'.
             10 VIAL2000-NR-ERRO               PIC 9(04).
             10 VIAL2000-CONTEXT-1             PIC X(02).
             10 VIAL2000-CONTEXT-2             PIC X(02).
             10 VIAL2000-REGISTOSPORPEDIDO     PIC 9(05).
             10 VIAL2000-CTABELA-PAG           PIC X(05).
             10 VIAL2000-CCOD-PAG              PIC X(50).
             10 VIAL2000-C2COD-PAG             PIC X(50).
             10 VIAL2000-CLINGUA-PAG           PIC X(10).
             10 VIAL2000-TAB-RESULTADOS OCCURS 150 TIMES.
               15 VIAL2000-D-CTABELA       PIC X(05).
               15 VIAL2000-D-CCOD          PIC X(50).
               15 VIAL2000-D-C2COD         PIC X(50).
               15 VIAL2000-D-CLINGUA       PIC X(10).
               15 VIAL2000-D-GDESC         PIC X(50).
