      *****************************************************************
      * NOME:      VIAL0110                                           *
      * DESCRICAO: AREA DE LIGACAO DA ROTINA VIAR0110                 *
      * AUTOR:     VIA CONSULTING                                     *
      *****************************************************************
       01 VIAL0110-NM-ROTINA              PIC X(10) VALUE 'VIAR0110'.
       01 VIAL0110-DATA.
          05 VIAL0110-DOPERACAO           PIC  X(10).
          05 VIAL0110-IACTIVA             PIC  X(01).
          05 VIAL0110-DCONTAB             PIC  X(10).
          05 VIAL0110-CAPLIC              PIC  X(02).
          05 VIAL0110-DTIMEZONE           PIC  X(10).
          05 VIAL0110-HTIMEZONE           PIC  X(08).
          05 FILLER                       PIC  X(52).
