      ******************************************************************
      *                                                                *
      *       VIAL0008   AREA COMUNICACAO STANDARD LOCAL->CENTRAL      *
      *                                                                *
      ******************************************************************
       01  VIAL0008-COMMAREA.
           05 VIAL0008-CTRANSACCAO                 PIC X(04).
           05 VIAL0008-INPUT.
              10 VIAL0008-HEADER-INPUT.
                 15 VIAL0008-ORIGEM                PIC X(10).
                 15 VIAL0008-CALLERID              PIC X(10).
                 15 VIAL0008-TRANSACCAO.
                    20 VIAL0008-CAPLIC             PIC X(02).
                    20 VIAL0008-COPCAO             PIC X(03).
                    20 VIAL0008-CACCAO             PIC X(01).
                       88 VIAL0008-VISUALIZACAO    VALUE 'V'.
                       88 VIAL0008-CRIACAO         VALUE 'I' 'C'.
                       88 VIAL0008-MODIFICACAO     VALUE 'M'.
                       88 VIAL0008-ANULACAO        VALUE 'E' 'A'.
                       88 VIAL0008-CONSULTALISTA   VALUE 'L'.
                 15 VIAL0008-NR-ELECTRONICO-INPUT.
                    20 VIAL0008-CUTILIZA-I         PIC X(20).
                    20 VIAL0008-DATA-PROCESSO-I    PIC X(10).
                    20 VIAL0008-NR-SEQUENCIA-I     PIC 9(10).
                 15 VIAL0008-PEDIDO-DADOS          PIC X(01).
                    88 VIAL0008-PEDIDO-SIM         VALUE 'S'.
                    88 VIAL0008-PEDIDO-NAO         VALUE 'N'.
                 15 VIAL0008-SIMULACAO             PIC X(01).
                    88 VIAL0008-SIMULACAO-SIM      VALUE 'S'.
                    88 VIAL0008-SIMULACAO-NAO      VALUE 'N'.
                 15 VIAL0008-MSG-SIZE              PIC 9(10).
                 15 VIAL0008-XLIVRE1.
                    20 VIAL0008-CUSER-EXTRN        PIC X(20).
                    20 VIAL0008-I-DEBUG            PIC X(01).
                       88 VIAL0008-DEBUG-SIM       VALUE 'S'.
                    20 VIAL0008-MSGQ               PIC X(10).
                    20 VIAL0008-DATA-EXTRN         PIC 9(08).
                    20 VIAL0008-CBANCO             PIC 9(04).
                    20 VIAL0008-CMOEDA             PIC X(03).
                    20 VIAL0008-CBALM              PIC 9(04).
                    20 VIAL0008-PGMID              PIC X(10).
                    20 VIAL0008-VERSAO-SYS         PIC X(03).
                       88 VIAL0008-VERSAO-V203     VALUE '203'.
                       88 VIAL0008-VERSAO-V300     VALUE '300'.
                       88 VIAL0008-VERSAO-VALIDA   VALUE '203', '300'.
                    20 VIAL0008-FILLER-INPUT       PIC X(117).
           05 VIAL0008-OUTPUT.
              10 VIAL0008-HEADER-OUTPUT.
                 15 VIAL0008-NR-ELECTRONICO-OUTPUT.
                    20 VIAL0008-CUTILIZA-O         PIC X(20).
                    20 VIAL0008-DATA-PROCESSO-O    PIC X(10).
                    20 VIAL0008-NR-SEQUENCIA-O     PIC 9(10).
                 15 VIAL0008-AREA-ERROS.
                    20 VIAL0008-IND-ERROS          PIC X(02).
                    20 VIAL0008-NR-ERRO            PIC 9(04).
                    20 VIAL0008-CONTEXT-1          PIC X(50).
                    20 VIAL0008-CONTEXT-2          PIC X(50).
                 15 VIAL0008-INFORMACAO-AUXILIAR.
                    20 VIAL0008-OCORRENCIAS        PIC 9(05).
                    20 VIAL0008-LENGTH-MSG         PIC 9(05).
                    20 VIAL0008-NR-CAMPOS          PIC 9(05).
                 15 VIAL0008-XLIVRE2.
                    20 VIAL0008-ERROS-EXTERNOS OCCURS 10 TIMES.
                       25 VIAL0008-CAPLIC-EXT      PIC X(02).
                       25 VIAL0008-NR-ERRO-EXT     PIC 9(04).
                    20 VIAL0008-FILLER-OUTPUT      PIC X(115).
           05 VIAL0008-MSG                         PIC X(63402).
      *    05 VIAL0008-MSG                         PIC X(31402).
