      ***************************************************************
      * NOME:      VIAL0250                                         *
      * DESCRICAO: AREA DE LIGACAO DA ROTINA VIAR0250               *
      * AUTOR:     VIA CONSULTING                                   *
      ***************************************************************
       01 VIAL0250-NM-ROTINA                PIC X(10) VALUE 'VIAR0250'.
       01 VIAL0250-COMMAREA.
          05 VIAL0250-NTELEFONE             PIC X(20) VALUE SPACES.
          05 VIAL0250-CAPLIC                PIC X(02) VALUE SPACES.
          05 FILLER                         PIC X(200) VALUE SPACES.
