      ******************************************************************
      *                                                                *
      *       VIAL0200   AREA INPUT ROTINA DE INVOCACAO DE TRANSACOES  *
      *                                                                *
      ******************************************************************
       01  VIAL0200-COMMAREA.
           05 VIAL0200-CAPLIC              PIC X(02).
           05 VIAL0200-COPCAO              PIC X(03).
           05 VIAL0200-CALLERID            PIC X(10).
           05 VIAL0200-CBALM               PIC 9(04).
           05 VIAL0200-CUSER-EXTRN         PIC X(20).
           05 VIAL0200-CUTILIZA-I          PIC X(20).
           05 VIAL0200-ORIGEM              PIC X(10).
