      ***************************************************************
      * NOME:      VIAL1030                                         *
      * DESCRICAO: AREA DE LIGACAO DA ROTINA VIAR1030               *
      * AUTOR:     VIA CONSULTING                                   *
      ***************************************************************
       01  VIAL1030-NM-ROTINA          PIC  X(10)  VALUE 'VIAR1030'.
       01  VIAL1030-COMMAREA.
           05 VIAL1030-EMAIL           PIC  X(100) VALUE SPACES.
      ***************************************************************
