      ******************************************************************
      *                                                                *
      *       VIAL0007   AREA COMUNICACAO INTERNA COM ROTINAS          *
      *                                                                *
      ******************************************************************
       01  VIAL0007-COMMAREA.
           05 VIAL0007-WORKING-AREA.
              10 VIAL0007-IND-ERROS                PIC  X(02).
                 88 VIAL0007-ABEND                 VALUE 'A1'.
                 88 VIAL0007-ABEND-DB2             VALUE 'A2'.
                 88 VIAL0007-ERROS-ARQ             VALUE 'AT'.
                 88 VIAL0007-ERROS-VALIDOS         VALUE 'FU' 'FC' 'OK'.
                 88 VIAL0007-ERROS-FUNCAO          VALUE 'FU'.
                 88 VIAL0007-FIM-CONSULTA          VALUE 'FC'.
                 88 VIAL0007-SEM-ERROS             VALUE 'OK'.
                 88 VIAL0007-ERROS-ABEND           VALUE 'A1' 'A2'.
              10 VIAL0007-COD-ERRO-GRAVE           PIC 9(04).
              10 VIAL0007-CAPLIC-ERRO              PIC X(02).
            05 VIAL0007-DB2-LOG.
              10 VIAL0007-TABLE-NAME         PIC X(16).
              10 VIAL0007-SQLCA.
                 15 VIAL0007-SQLAID          PIC X(8).
                 15 VIAL0007-SQLABC          PIC S9(9) BINARY.
                 15 VIAL0007-SQLCODE         PIC S9(9) BINARY.
                 15 VIAL0007-SQLERRM.
                    49 VIAL0007-SQLERRM-LEN  PIC S9(4) BINARY.
                    49 VIAL0007-SQLERRM-DATA PIC X(70).
                 15 VIAL0007-SQLERRP         PIC X(8).
                 15 VIAL0007-SQLERDD         OCCURS 6 TIMES.
                    20 VIAL0007-SQLERRD-ITEM PIC S9(9) BINARY.
                 15 VIAL0007-SQLWARN.
                    20 VIAL0007-SQLWARN0     PIC X(1).
                    20 VIAL0007-SQLWARN1     PIC X(1).
                    20 VIAL0007-SQLWARN2     PIC X(1).
                    20 VIAL0007-SQLWARN3     PIC X(1).
                    20 VIAL0007-SQLWARN4     PIC X(1).
                    20 VIAL0007-SQLWARN5     PIC X(1).
                    20 VIAL0007-SQLWARN6     PIC X(1).
                    20 VIAL0007-SQLWARN7     PIC X(1).
                    20 VIAL0007-SQLWARN8     PIC X(1).
                    20 VIAL0007-SQLWARN9     PIC X(1).
                    20 VIAL0007-SQLWARNA     PIC X(1).
                 15 VIAL0007-SQLSTATE        PIC X(5).
