       IDENTIFICATION DIVISION.
      ******************************************************************
      *           I D E N T I F I C A T I O N   D I V I S I O N        *
      ******************************************************************
      * PROGRAM NAME
      ******************************************************************
       PROGRAM-ID. VIAM0015.
      ******************************************************************
      *                                                                *
      *                       - ARQUITECTURA -                         *
      *                                                                *
      ******************************************************************
      * Eescreve ficheiro com informacao de debug                      *
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S            *
      *          *        *        *                                   *
      *          *        *        *                                   *
      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************
      *           E N V I R O N M E N T         D I V I S I O N        *
      ******************************************************************
       CONFIGURATION SECTION.
      ******************************************************************
      *                     CONFIGURATION SECTION                      *
      ******************************************************************
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
      *                      INPUT-OUTPUT SECTION                      *
      ******************************************************************
       FILE-CONTROL.
      ******************************************************************
           SELECT VIAF0015  ASSIGN        TO DISK-VIAF0015
                            FILE STATUS   IS WS-VIAF0015-STATUS.
      ******************************************************************
       DATA DIVISION.
      ******************************************************************
      *                   D A T A   D I V I S I O N                    *
      ******************************************************************
       FILE SECTION.
      ******************************************************************
      *                          FILE SECTION                          *
      ******************************************************************
       FD  VIAF0015.
       01  VIAF0015-RECORD            PIC  X(907).
      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                    WORKING STORAGE SECTION                     *
      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'INICIO WORKING-STORAGE'.
      ******************************************************************
      * PROGRAM CONTROL
      ******************************************************************
       01  WS-PROGRAM-CONTROL.
           05 WS-PGMNAME               PIC  X(10) VALUE 'VIAM0015'.

      ******************************************************************
      * ARQUITECTURA
      ******************************************************************

      ******************************************************************
      * TABELAS
      ******************************************************************

      ******************************************************************
      * CONSTANTES
      ******************************************************************

      ******************************************************************
      * VARIAVEIS
      ******************************************************************
       01  WS-VARIAVEIS.
           05 WS-TIMESTAMP             PIC  X(26).

      ******************************************************************
      * SWITCHES
      ******************************************************************
       01  WS-SWITCHES.
           05 WS-VIAF0015-STATUS       PIC  X(02).
              88 WS-VIAF0015-OK                    VALUE '00'.
              88 WS-VIAF0015-EOF                   VALUE '10'.

      ******************************************************************
      * APIS
      ******************************************************************

      ******************************************************************
      * COPYS
      ******************************************************************

      ******************************************************************
      * DB2
      ******************************************************************
           EXEC SQL INCLUDE SQLCA END-EXEC.

      ******************************************************************
       01  FILLER              PIC X(40) VALUE 'FIM DA WORKING-STORAGE'.

      ******************************************************************
       LINKAGE SECTION.
      ******************************************************************
      *                        LINKAGE SECTION                         *
      ******************************************************************
       COPY VIAL0015.

      ******************************************************************
       PROCEDURE DIVISION USING VIAL0015-DATA.
      ******************************************************************
      *              P R O C E D U R E   D I V I S I O N               *
      ******************************************************************
       0000-MAINLINE.
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1000-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2000-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3000-FIM-PROGRAMA-EXIT.

       0000-MAINLINE-EXIT.
           GOBACK.

      ******************************************************************
      *                           Validação                            *
      ******************************************************************
       1000-INICIO-PROGRAMA.
      ******************************************************************
      * validação dos campos standard da api:
           PERFORM 1100-VALIDA-DADOS-API
              THRU 1100-VALIDA-DADOS-API-EXIT.

      * valida a integridade dos dados da linkage:
           PERFORM 1200-VALIDA-LINKAGE
              THRU 1200-VALIDA-LINKAGE-EXIT.

       1000-INICIO-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
       1100-VALIDA-DADOS-API.
      ******************************************************************

       1100-VALIDA-DADOS-API-EXIT.
           EXIT.

      ******************************************************************
       1200-VALIDA-LINKAGE.
      ******************************************************************

       1200-VALIDA-LINKAGE-EXIT.
           EXIT.

      ******************************************************************
      *                    Processamento Principal                     *
      ******************************************************************
       2000-PROC-PROGRAMA.
      ******************************************************************
           OPEN EXTEND VIAF0015.
AF    *
AF    * Caso nao consiga abrir o ficheiro, nao deve tentar escrever
AF    * nem utilizar a variavel de registo do ficheiro para evitar o
AF    * erro MCH3601
AF    *
AF         IF WS-VIAF0015-OK

              EXEC SQL
                   SET :WS-TIMESTAMP = CURRENT_TIMESTAMP
              END-EXEC

              MOVE WS-TIMESTAMP  TO VIAL0015-TIMESTAMP
              MOVE VIAL0015-DATA TO VIAF0015-RECORD

              WRITE VIAF0015-RECORD

              CLOSE VIAF0015
AF         END-IF.

       2000-PROC-PROGRAMA-EXIT.
           EXIT.

      ******************************************************************
      *                             Final                              *
      ******************************************************************
       3000-FIM-PROGRAMA.
      ******************************************************************

       3000-FIM-PROGRAMA-EXIT.
            EXIT.

      ******************************************************************
      *                     Procedimentos Internos                     *
      ******************************************************************

      ******************************************************************
      *                     Procedimentos Externos                     *
      ******************************************************************

      ******************************************************************
      *                       Via Consulting Way                       *
      ******************************************************************
