      *****************************************************************
      * DESCRICAO: COPYBOOK CONTROLO FILE STATUS                      *
      * CRICAO:    11-10-2010                                         *
      * AUTOR:     VIA CONSULTING                                     *
      *****************************************************************
       9030-FSCHECK.
           IF NOT VIAW0011-EOF       AND
              NOT VIAW0011-OK
                SET  VIAW0011-ABEND-FS     TO TRUE
           END-IF.

           EVALUATE TRUE
           WHEN VIAW0011-OK
           WHEN VIAW0011-EOF
                CONTINUE
           WHEN VIAW0011-RECSIZ
                MOVE VIAK0001-ERRO-RECSIZ  TO ETCL0002-NR-ERRO
                MOVE VIAK0002-ABEND        TO ETCL0002-IND-ERROS
           WHEN OTHER
                MOVE VIAK0001-ERRO-FILE    TO ETCL0002-NR-ERRO
                MOVE VIAK0002-ABEND        TO ETCL0002-IND-ERROS
           END-EVALUATE.
       9039-FSCHECK-EXIT.
           EXIT.
