      ******************************************************************
      *  APLICAÇÃO:        ARQUITECTURA VIA                           **
      *  MÓDULO:           DEBUG - ONLINE                             **
      *  FUNÇÃO:           ESCREVE FICHEIRO VIAF0015                  **
      *  PROGRAMA:         VIAP0016.                                  **
      *  CRIACAO:          2012.01.02                                 **
      *  AUTOR:            ANTONIO RODRIGUES                          **
      *  DESCRIÇÃO:        PROCEDURE DE CALL AO MODULO DE DEBUG       **
      *                    (WRITE NO VIAF0015)                        **
      *                                                               **
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S           **
      *          *        *        *                                  **
      ******************************************************************
      *    TRATAMENTO DE DEBUG                                         *
      ******************************************************************
       VIAP0016-TRATA-DEBUG.
      *
           IF WS-PROGNAME NOT EQUAL SPACES
               MOVE WS-PROGNAME              TO VIAL0015-PROGRAMA
           ELSE
             MOVE VIAL0001-PGMID             TO VIAL0015-PROGRAMA
             INITIALIZE VIAL0015-CTIPO-PRG
             EVALUATE TRUE
                WHEN VIAL0001-VISUALIZACAO
                   SET VIAL0015-VISUALIZACAO  TO TRUE
                   INITIALIZE VIAL0015-CTIPO-PRG
                WHEN VIAL0001-CRIACAO
                   SET VIAL0015-CRIACAO       TO TRUE
                   INITIALIZE VIAL0015-CTIPO-PRG
                WHEN VIAL0001-MODIFICACAO
                   SET VIAL0015-MODIFICACAO   TO TRUE
                   INITIALIZE VIAL0015-CTIPO-PRG
                WHEN VIAL0001-ANULACAO
                   SET VIAL0015-ANULACAO      TO TRUE
                   INITIALIZE VIAL0015-CTIPO-PRG
                WHEN VIAL0001-CONSULTALISTA
                   SET VIAL0015-CONSULTALISTA TO TRUE
                   INITIALIZE VIAL0015-CTIPO-PRG
             END-EVALUATE
           END-IF
      *
           MOVE VIAL0001-CAPLIC            TO VIAL0015-CAPLIC.
           MOVE VIAL0001-COPCAO            TO VIAL0015-COPCAO.
           MOVE VIAL0001-CACCAO            TO VIAL0015-CACCAO.
           MOVE VIAL0001-TRACE             TO VIAL0015-TRACE.
           MOVE VIAL0001-I-DEBUG           TO VIAL0015-I-DEBUG.
           MOVE VIAL0001-CUTILIZA-I        TO VIAL0015-CUTILIZA.
           MOVE VIAL0001-DATA-PROCESSO-O   TO VIAL0015-DATA-PROC.
           MOVE VIAL0001-NR-SEQUENCIA-O    TO VIAL0015-NUM-SEQ.
      *
           CALL VIAL0015-ROTINA-DEBUG USING VIAL0015-DATA.
      *
           INITIALIZE VIAL0015-CAMPOS-CHAVE.

           MOVE VIAL0001-I-DEBUG           TO VIAL0015-I-DEBUG.

       VIAP0016-TRATA-DEBUG-EXIT.
           EXIT.
