      ******************************************************************
      *                                                                *
      *                       9020-DB2CHECK                            *
      *                                                                *
      ******************************************************************
       9020-DB2CHECK.
           MOVE SQLCODE                    TO VIAW0005-SQLCODE.
           MOVE SQLCA                      TO VIAL0002-SQLCA
                                           OF VIAL0002-COMMAREA.
           IF SQLWARN0 NOT EQUAL SPACES
              MOVE VIAK0001-WARNING-DB2    TO VIAL0002-COD-ERRO-GRAVE
                                           OF VIAL0002-COMMAREA
              MOVE VIAK0002-ABEND-DB2      TO VIAL0002-IND-ERROS
                                           OF VIAL0002-COMMAREA
           ELSE
              IF NOT VIAW0005-NOTFND    AND
                 NOT VIAW0005-OK        AND
                 NOT VIAW0005-DUPREC    AND
                 NOT VIAW0005-FKNTFND   AND
                 NOT VIAW0005-RESTRICT
                 MOVE VIAK0001-ERRO-DB2    TO VIAL0002-COD-ERRO-GRAVE
                                           OF VIAL0002-COMMAREA
                 MOVE VIAK0002-ABEND-DB2   TO VIAL0002-IND-ERROS
                                           OF VIAL0002-COMMAREA
              END-IF.
       9029-DB2CHECK-EXIT.
           EXIT.
