      ******************************************************************
      *    VIAP23A2                                                    *
      ******************************************************************
      *                                                                *
      *    VIAT4000 => VIAL00A2 + VIAL0002 => VIAL4000                 *
      *                                                                *
      ******************************************************************
       VIAP23A2-TRATAR-INPUT.
      ******************************************************************
           INITIALIZE VIAL00A2-COMMAREA     REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

      *    MOVE                            TO VIAL00A2-CTRANSACCAO.
           MOVE VIAL4000-ORIGEM            TO VIAL00A2-ORIGEM.
      *    MOVE                            TO VIAL00A2-CALLERID.
           MOVE VIAL4000-APLIC             TO VIAL00A2-CAPLIC.
           MOVE VIAL4000-OPCAO             TO VIAL00A2-COPCAO.
           MOVE VIAL4000-ACCAO             TO VIAL00A2-CACCAO.
           MOVE VIAL4000-CUTILIZA          TO VIAL00A2-CUTILIZA-I.
           MOVE VIAL4000-DATA-PROCESSO     TO VIAL00A2-DATA-PROCESSO-I .
           MOVE VIAL4000-NR-SEQUENCIA      TO VIAL00A2-NR-SEQUENCIA-I.
           MOVE VIAL4000-PEDIDO-DADOS      TO VIAL00A2-PEDIDO-DADOS.
      *    MOVE                            TO VIAL00A2-SIMULACAO.
      *    MOVE                            TO VIAL00A2-MSG-SIZE.
      *    MOVE                            TO VIAL00A2-CUSER-EXTRN.
           MOVE VIAL4000-IDEBUG            TO VIAL00A2-I-DEBUG.
      *    MOVE                            TO VIAL00A2-MSGQ.
      *    MOVE                            TO VIAL00A2-DATA-EXTRN.
      *    MOVE                            TO VIAL00A2-CBANCO.
      *    MOVE                            TO VIAL00A2-CMOEDA.
      *    MOVE                            TO VIAL00A2-CBALM.
           MOVE VIAL4000-PGMID             TO VIAL00A2-PGMID.
      *    MOVE                            TO VIAL00A2-VERSAO-SYS.
      *    MOVE                            TO VIAL00A2-NCAIXA.
      *    MOVE                            TO VIAL00A2-PAIS.
           MOVE VIAL4000-CIDIOMA           TO VIAL00A2-IDIOMA.
      *    MOVE                            TO VIAL00A2-CBAL-ETRAB.
      *    MOVE                            TO VIAL00A2-AMBIENTE.
      *    MOVE VIAL4000-SESSION           TO VIAL00A2-SESSION.
      *    MOVE                            TO VIAL00A2-PHONENR.
      *    MOVE                            TO VIAL00A2-ICSESSAO.
      *    MOVE                            TO VIAL00A2-IDTRANS.
      *    MOVE                            TO VIAL00A2-OPERADOR.
      *    MOVE VIAL4000-MSGTYPE           TO VIAL00A2-MSGTYPE.
      *    MOVE                            TO VIAL00A2-FILLER-INPUT.
      *    MOVE                            TO VIAL00A2-CBOTAO.
      *    MOVE VIAL4000-MENSAGEM-INPUT    TO VIAL00A2-MENSAGEM-INPUT  .
           MOVE VIAL4000-DOPERACAO         TO VIAL00A2-DOPERACAO
           MOVE VIAL4000-IACTIVA           TO VIAL00A2-IACTIVA
           MOVE VIAL4000-DCONTAB           TO VIAL00A2-DCONTAB
           MOVE VIAL4000-DCREDITO          TO VIAL00A2-DCREDITO
           MOVE VIAL4000-DDEBITO           TO VIAL00A2-DDEBITO
           MOVE VIAL4000-DTIMEZONE         TO VIAL00A2-DTIMEZONE
           MOVE VIAL4000-HTIMEZONE         TO VIAL00A2-HTIMEZONE

           INITIALIZE VIAL0002-COMMAREA     REPLACING NUMERIC BY ZEROES
                                                 ALPHANUMERIC BY SPACES.

           MOVE VIAL4000-IND-ERROS          TO VIAL0002-IND-ERROS.

       VIAP23A2-TRATAR-INPUT-EXIT.
           EXIT.

      ******************************************************************
      *VIAP23A2-TRATAR-OUTPUT.
      ******************************************************************
      *     MOVE VIAL00A2-MENSAGEM-OUTPUT    TO VIAL4000-MENSAGEM-OUTPUT.
      *     MOVE VIAL00A2-LENGTH-MSG         TO VIAL4000-LENGTH-MSG.
      *     MOVE VIAL00A2-NR-CAMPOS          TO VIAL4000-NR-CAMPOS.
      *     MOVE VIAL00A2-OCORRENCIAS        TO VIAL4000-OCORRENCIAS.
      *
      *    MOVE VIAL0002-IND-ERROS          TO VIAL4000-IND-ERROS.
      *    MOVE VIAL0002-COD-ERRO-GRAVE     TO VIAL4000-NRERRO.
      *    MOVE VIAL0002-CAPLIC-ERRO        TO VIAL4000-CAPLIC.
      *    MOVE VIAL0002-DB2-LOG            TO VIAL4000-DB2-LOG.
      *
      *VIAP23A2-TRATAR-OUTPUT-EXIT.
      *    EXIT.
      *
