      ******************************************************************
      *  APLICAÇÃO:        ARQUITECTURA VIA                           **
      *  MÓDULO:           DEBUG - ONLINE                             **
      *  FUNÇÃO:           ESCREVE FICHEIRO VIAF0015                  **
      *  PROGRAMA:         VIAP16A2.                                  **
      *  CRIACAO:          2012.01.02                                 **
      *  AUTOR:            ANTONIO RODRIGUES                          **
      *  DESCRIÇÃO:        PROCEDURE DE CALL AO MODULO DE DEBUG       **
      *                    (WRITE NO VIAF0015)                        **
      *                                                               **
      ******************************************************************
      *           L O G     D E     A L T E R A C O E S                *
      ******************************************************************
      *  INICIO  * AUTOR  * FIM    *  C O M E N T A R I O S           **
      *          *        *        *                                  **
      ******************************************************************
      *    TRATAMENTO DE DEBUG                                         *
      ******************************************************************
       VIAP16A2-TRATA-DEBUG.
      *
           IF WS-PROGNAME NOT EQUAL SPACES
               MOVE WS-PROGNAME              TO VIAL0015-PROGRAMA
           ELSE
             MOVE VIAL00A2-PGMID             TO VIAL0015-PROGRAMA
      *      INITIALIZE VIAL0015-CTIPO-PRG
             EVALUATE TRUE
                WHEN VIAL00A2-VISUALIZACAO
                   SET VIAL0015-VISUALIZACAO  TO TRUE
      *            INITIALIZE VIAL0015-CTIPO-PRG
                WHEN VIAL00A2-CRIACAO
                   SET VIAL0015-CRIACAO       TO TRUE
      *            INITIALIZE VIAL0015-CTIPO-PRG
                WHEN VIAL00A2-MODIFICACAO
                   SET VIAL0015-MODIFICACAO   TO TRUE
      *            INITIALIZE VIAL0015-CTIPO-PRG
                WHEN VIAL00A2-ANULACAO
                   SET VIAL0015-ANULACAO      TO TRUE
      *            INITIALIZE VIAL0015-CTIPO-PRG
                WHEN VIAL00A2-CONSULTALISTA
                   SET VIAL0015-CONSULTALISTA TO TRUE
      *            INITIALIZE VIAL0015-CTIPO-PRG
             END-EVALUATE
           END-IF
      *
           MOVE VIAL00A2-CAPLIC            TO VIAL0015-CAPLIC.
           MOVE VIAL00A2-COPCAO            TO VIAL0015-COPCAO.
           MOVE VIAL00A2-CACCAO            TO VIAL0015-CACCAO.
      *    MOVE VIAL00A2-TRACE             TO VIAL0015-TRACE.
           MOVE VIAL00A2-I-DEBUG           TO VIAL0015-I-DEBUG.
           MOVE VIAL00A2-CUTILIZA-I        TO VIAL0015-CUTILIZA.
           MOVE VIAL00A2-DATA-PROCESSO-I   TO VIAL0015-DATA-PROC.
           MOVE VIAL00A2-NR-SEQUENCIA-I    TO VIAL0015-NUM-SEQ.
      *
           CALL VIAL0015-ROTINA-DEBUG USING VIAL0015-DATA.
      *
           INITIALIZE VIAL0015-CAMPOS-CHAVE.

           MOVE VIAL00A2-I-DEBUG           TO VIAL0015-I-DEBUG.

       VIAP16A2-TRATA-DEBUG-EXIT.
           EXIT.
