      ****************************************************************
      *
      *                  VIAP0059-TRATA-ERRO-BANKA
      ****************************************************************
      *
       VIAP0059-TRATA-ERRO-BANKA.

            PERFORM VIAP0059-INIT-INPUT
               THRU VIAP0059-INIT-INPUT-EXIT
      *
            MOVE VIAW0059-MSGQ               TO BRCL1020-PGMQ.
            MOVE ZEROES                      TO VIAW0059-COD-ERR.
            MOVE ZEROES                      TO VIAW0059-INDEX.
            MOVE 1                           TO VIAW0059-IX-O.
            MOVE 'VIAP0059-TRATA-ERRO-BANKA' TO VIAL0015-CALLER-ID.
      *
            CALL 'AR102000'    USING BRCL1020-PGMQ
                                     BRCL1020-WRMG-H
                                     BRCL1020-WNOCORN.

            PERFORM VARYING VIAW0059-INDEX FROM 1 BY 1
              UNTIL (VIAW0059-INDEX > 10)
                 OR (VIAW0059-IX-O  > 09)
                 OR BRCL1020-WRMG(VIAW0059-INDEX) EQUAL SPACES

              PERFORM VIAP0059-FORM-MSG
                 THRU VIAP0059-FORM-MSG-EXIT

              ADD 1 TO VIAW0059-IX-O

            END-PERFORM.

            PERFORM VIAP0015-TRATA-DEBUG
               THRU VIAP0015-TRATA-DEBUG-EXIT.

            MOVE 'BRCL1020-TOTAL'            TO VIAL0015-CALLER-ID.
            MOVE BRCL1020-WRMG-H             TO VIAL0015-CAMPOS-CHAVE.

            PERFORM VIAP0015-TRATA-DEBUG
               THRU VIAP0015-TRATA-DEBUG-EXIT.

      *                                                   .
       VIAP0059-TRATA-ERRO-BANKA-EXIT.
           EXIT.
      ****************************************************************
      *                  VIAP0059-INIT-INPUT
      ****************************************************************
      *
       VIAP0059-INIT-INPUT.
      *
           MOVE ZEROES                     TO VIAW0059-COD-ERR.
           MOVE ZEROES                     TO VIAW0059-INDEX.
           MOVE 1                          TO VIAW0059-IX-O.
           MOVE SPACES                     TO VIAL0015-CALLER-ID.
      *
           PERFORM VARYING VIAW0059-INDEX FROM 1 BY 1
             UNTIL (VIAW0059-INDEX > 10)

             MOVE SPACES  TO VIAW0059-MSG-TOT(VIAW0059-INDEX)
             MOVE SPACES  TO VIAL0015-CAMPO-NM(VIAW0059-INDEX)
             MOVE SPACES  TO VIAL0015-CAMPO-VLR(VIAW0059-INDEX)

           END-PERFORM.
      *
       VIAP0059-INIT-INPUT-EXIT.
           EXIT.
      ****************************************************************
      *                  VIAP0059-FORM-MSG1
      ****************************************************************
      *
       VIAP0059-FORM-MSG.
      *
           MOVE BRCL1020-WRMG(VIAW0059-INDEX)
                               TO VIAW0059-MSG-TOT(VIAW0059-INDEX).
           MOVE BRCL1020-WRMG(VIAW0059-INDEX)(1:50)
                               TO VIAL0015-CAMPOS-R(VIAW0059-IX-O).

           ADD 1 TO VIAW0059-IX-O
           MOVE BRCL1020-WRMG(VIAW0059-INDEX)(51:30)
                               TO VIAL0015-CAMPOS-R(VIAW0059-IX-O).
      *
       VIAP0059-FORM-MSG-EXIT.
           EXIT.
