       IDENTIFICATION DIVISION.
       PROGRAM-ID. VIAR0030.
      ****************************************************************
      *                                                              *
      *     PROGRAMA VIAR0030.                                       *
      *                                                              *
      *     ACTUALIZACAO DA TABELA DE SEQUENCIADORES                 *
      *                                                              *
      ****************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *
       COPY VIAK0001.
       COPY VIAK0002.
       COPY ETCK0002.
      ****************************************************************
      *                   STATUS DB2                                 *
      ****************************************************************
      ****************************************************************
      *                   DECLARACOES DB2                            *
      ****************************************************************
           EXEC SQL INCLUDE ARCD0800 END-EXEC.
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      ****************************************************************
      *                             VARIABLES                        *
      ****************************************************************
           EXEC SQL
                DECLARE CURSOR_SEQ CURSOR FOR
                SELECT CSEQUENCE
                  FROM ARVT0800_SEQUENCE
                 WHERE CSEQUENCER   = :ARCD0800-CSEQUENCER
             FOR UPDATE OF CSEQUENCE
           END-EXEC.
      ****************************************************************
      *                   CONSTANTES                                 *
      ****************************************************************
       01  CON-CONSTANTES.
           05 CON-VIAT0800       PIC X(08) VALUE 'VIAT0800'.
      ****************************************************************
       LINKAGE SECTION.
      *
       COPY VIAL0030.
       COPY ETCL0002.

      *
       PROCEDURE DIVISION USING ETCL0002-COMMAREA
                                VIAL0030-COMMAREA.
      ****************************************************************
      *           0000-MAINLINE                                      *
      ****************************************************************
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           IF ETCL0002-SEM-ERROS
              PERFORM 2000-PROC-PROGRAMA
                 THRU 2099-PROC-PROGRAMA-EXIT
           END-IF.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3099-FIM-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           GOBACK.
      ******************************************************************
      *                       1000-INICIO-PROGRAMA                     *
      ******************************************************************
       1000-INICIO-PROGRAMA.
      *
           SET ETCL0002-SEM-ERROS          TO TRUE.
           MOVE VIAL0030-CSEQUEN           TO ARCD0800-CSEQUENCER.
      *
           PERFORM 1100-VAL-SEQUENCIADOR
              THRU 1199-VAL-SEQUENCIADOR-EXIT.
      *
           EXEC SQL
                OPEN CURSOR_SEQ
           END-EXEC.

           MOVE CON-VIAT0800               TO ETCL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF NOT ETCL0002-SQL-OK
              MOVE VIAK0002-ABEND-DB2   TO ETCL0002-IND-ERROS
              MOVE VIAK0001-ERRO-DB2    TO ETCL0002-ST-ERRO
           END-IF.

       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      ******************************************************************
      *                1100-VAL-SEQUENCIADOR                           *
      ******************************************************************
       1100-VAL-SEQUENCIADOR.
      *
           EXEC SQL
                SELECT CSEQUENCE
                  INTO :ARCD0800-CSEQUENCE
                  FROM ARVT0800_SEQUENCE
                 WHERE CSEQUENCER   = :ARCD0800-CSEQUENCER
           END-EXEC
      *
           MOVE CON-VIAT0800               TO ETCL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF ETCL0002-SQL-NOTFND
              MOVE VIAL0030-CSEQUEN        TO ARCD0800-CSEQUENCER
              MOVE ZEROS                   TO ARCD0800-CSEQUENCE
              MOVE 'VIAR0030'              TO ARCD0800-CUSERID

              EXEC SQL
                INSERT INTO ARVT0800_SEQUENCE
                VALUES( :ARCD0800-CSEQUENCER ,
                        :ARCD0800-CSEQUENCE  ,
                        :ARCD0800-CUSERID    ,
                        CURRENT TIMESTAMP)
              END-EXEC

              MOVE CON-VIAT0800            TO ETCL0002-TABLE-NAME

              PERFORM 9020-DB2CHECK
                 THRU 9029-DB2CHECK-EXIT

              IF NOT ETCL0002-SQL-OK
                 MOVE VIAK0002-ABEND-DB2   TO ETCL0002-IND-ERROS
                 MOVE VIAK0001-ERRO-DB2    TO ETCL0002-ST-ERRO
              END-IF
           ELSE
              IF NOT ETCL0002-SQL-OK
                 MOVE VIAK0002-ABEND-DB2   TO ETCL0002-IND-ERROS
                 MOVE VIAK0001-ERRO-DB2    TO ETCL0002-ST-ERRO
              END-IF
           END-IF.

       1199-VAL-SEQUENCIADOR-EXIT.
           EXIT.
      ******************************************************************
      *                       2000-PROC-PROGRAMA                       *
      *                                                                *
      ******************************************************************
       2000-PROC-PROGRAMA.
      *
           EXEC SQL
                FETCH CURSOR_SEQ
                  INTO :ARCD0800-CSEQUENCE
           END-EXEC.

           MOVE CON-VIAT0800               TO ETCL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF ETCL0002-SQL-OK
              IF VIAL0030-VALIDA
                 MOVE ARCD0800-CSEQUENCE   TO VIAL0030-NSEQUEN-1
              ELSE
                 PERFORM 2010-UPDATE-TABELA
                    THRU 2019-UPDATE-TABELA-EXIT
              END-IF
           ELSE
              MOVE VIAK0002-ABEND-DB2      TO ETCL0002-IND-ERROS
              MOVE VIAK0001-ERRO-DB2       TO ETCL0002-ST-ERRO
           END-IF.
      *
       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      ******************************************************************
      *                                                                *
      *                       2010-UPDATE-TABELA                       *
      *                                                                *
      ******************************************************************
       2010-UPDATE-TABELA.

           IF VIAL0030-SOMA-1
               ADD 1                        TO ARCD0800-CSEQUENCE
               MOVE ARCD0800-CSEQUENCE      TO VIAL0030-NSEQUEN-1
           ELSE
              IF VIAL0030-FORCA-1
                 MOVE 1                     TO ARCD0800-CSEQUENCE
                                               VIAL0030-NSEQUEN-1
              ELSE
                 IF VIAL0030-SOMA-VALOR
                    MOVE ARCD0800-CSEQUENCE TO VIAL0030-NSEQUEN-1
                    ADD 1                   TO VIAL0030-NSEQUEN-1
                    ADD VIAL0030-VALOR-ACUM TO ARCD0800-CSEQUENCE
                    MOVE ARCD0800-CSEQUENCE TO VIAL0030-NSEQUEN-2
                 ELSE
                    IF VIAL0030-FORCA-VALOR
                       MOVE 1               TO VIAL0030-NSEQUEN-1
                       MOVE VIAL0030-VALOR-ACUM
                                            TO ARCD0800-CSEQUENCE
                                               VIAL0030-NSEQUEN-2
                    ELSE
                       MOVE VIAK0002-ERROS-ARQ
                                            TO ETCL0002-IND-ERROS
                                               ETCL0002-CAPLIC-ERRO
                       MOVE VIAK0001-ERR-IACCAO
                                            TO ETCL0002-ST-ERRO
                    END-IF
                 END-IF
              END-IF
           END-IF.

           EXEC SQL
                UPDATE ARVT0800_SEQUENCE
                   SET CSEQUENCE   = :ARCD0800-CSEQUENCE
                 WHERE CURRENT OF CURSOR_SEQ
           END-EXEC.

           MOVE CON-VIAT0800               TO ETCL0002-TABLE-NAME.

           PERFORM 9020-DB2CHECK
              THRU 9029-DB2CHECK-EXIT.

           IF NOT ETCL0002-SQL-OK
              MOVE VIAK0002-ABEND-DB2   TO ETCL0002-IND-ERROS
              MOVE VIAK0001-ERRO-DB2    TO ETCL0002-ST-ERRO
           END-IF.

       2019-UPDATE-TABELA-EXIT.
           EXIT.
      ******************************************************************
      *                       3000-FIM-PROGRAMA                        *
      ******************************************************************
       3000-FIM-PROGRAMA.

           EXEC SQL
                CLOSE CURSOR_SEQ
           END-EXEC.
      *
       3099-FIM-PROGRAMA-EXIT.
           EXIT.
      ******************************************************************
           EXEC SQL INCLUDE ETCP0021 END-EXEC.
      ******************************************************************
