       IDENTIFICATION DIVISION.
       PROGRAM-ID.       VIAR0110.
      ****************************************************************
      *  PROGRAMA      : VIAR0110
      *                  Obtém data da aplicação
      ****************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *
       COPY VIAK0001.
       COPY VIAK0002.
       COPY VIATK002.
       COPY ARCL2305.
       COPY ARCL2405.
       COPY VIAL0002.
       COPY VIAL0015.
       COPY VIAL1020.
      ****************************************************************
      *                   STATUS DB2                                 *
      ****************************************************************
       COPY VIAW0005.
      ****************************************************************
      *                   DECLARACOES DB2                            *
      ****************************************************************
           EXEC SQL INCLUDE SQLCA    END-EXEC.
      ****************************************************************
      *                             VARIABLES                        *
      ****************************************************************
       01  WS-VARIAVEIS.
           05 WS-IND             PIC S9(02) COMP-3 VALUE ZEROES.
      ****************************************************************
      *                   CONSTANTES                                 *
      ****************************************************************
       01  CON-CONSTANTES.
           05 WS-PROGNAME        PIC X(10) VALUE 'VIAR0110'.
      ****************************************************************
       LINKAGE SECTION.
      *
       COPY ETCL0002.
       COPY VIAL0110.
      *
       PROCEDURE DIVISION USING ETCL0002-COMMAREA
                                VIAL0110-DATA.
      ****************************************************************
      *           0000-MAINLINE                                      *
      ****************************************************************
       0000-MAINLINE.
      *
           PERFORM 1000-INICIO-PROGRAMA
              THRU 1099-INICIO-PROGRAMA-EXIT.

           PERFORM 2000-PROC-PROGRAMA
              THRU 2099-PROC-PROGRAMA-EXIT.

           PERFORM 3000-FIM-PROGRAMA
              THRU 3099-FIM-PROGRAMA-EXIT.
      *
       0099-MAINLINE-EXIT.
           GOBACK.
      ******************************************************************
      *                       1000-INICIO-PROGRAMA                     *
      ******************************************************************
       1000-INICIO-PROGRAMA.
      *
           MOVE '1000-INICIO-PROGRAMA   '  TO VIAL0015-CALLER-ID
           PERFORM VIAP0015-TRATA-DEBUG
              THRU VIAP0015-TRATA-DEBUG-EXIT

           SET ETCL0002-SEM-ERROS          TO TRUE.
      *
       1099-INICIO-PROGRAMA-EXIT.
           EXIT.
      ******************************************************************
      *                       2000-PROC-PROGRAMA                       *
      ******************************************************************
       2000-PROC-PROGRAMA.
      *
           MOVE '2000-PROC-PROGRAMA     '  TO VIAL0015-CALLER-ID
           PERFORM VIAP0015-TRATA-DEBUG
              THRU VIAP0015-TRATA-DEBUG-EXIT

           IF ETCL0002-SEM-ERROS
              PERFORM 2005-OBTEM-DATA-OPER-DFT
                 THRU 2005-OBTEM-DATA-OPER-DFT-EXIT
           END-IF.
      *
           IF ETCL0002-SEM-ERROS
              PERFORM 2010-OBTEM-FLIP-FLOP
                 THRU 2010-OBTEM-FLIP-FLOP-EXIT
           END-IF.
      *
      *    IF ETCL0002-SEM-ERROS AND VIAL0110-CAPLIC NOT EQUAL SPACES
           IF ETCL0002-SEM-ERROS
              PERFORM 2020-OBTEM-TIMEZONE
                 THRU 2020-OBTEM-TIMEZONE-EXIT
           END-IF.
      *
       2099-PROC-PROGRAMA-EXIT.
           EXIT.
      ******************************************************************
      *            2005-OBTEM-DATA-OPER-DFT                        *
      ******************************************************************
       2005-OBTEM-DATA-OPER-DFT.
      *
           MOVE '2005-OBTEM-DATA-OPER-DFT' TO VIAL0015-CALLER-ID
           PERFORM VIAP0015-TRATA-DEBUG
              THRU VIAP0015-TRATA-DEBUG-EXIT

      * DATA DE OPERACAO
           INITIALIZE ARCL2405-COMMAREA.
           MOVE '**'                       TO ARCL2405-CAPLIC.

           PERFORM CALL-ARR02405
              THRU CALL-ARR02405-EXIT.

           MOVE '2005-OBTEM-DATA-OPER-DFT' TO VIAL0015-CALLER-ID
           MOVE 'ETCL0002-IND-ERROS     '  TO VIAL0015-CAMPO-NM(1)
           MOVE  ETCL0002-IND-ERROS        TO VIAL0015-CAMPO-VLR(1)
           PERFORM VIAP0015-TRATA-DEBUG
              THRU VIAP0015-TRATA-DEBUG-EXIT

           IF ETCL0002-SEM-ERROS
              MOVE ARCL2405-DOPERACAO      TO VIAL0110-DOPERACAO
              MOVE ARCL2405-DCREDITO       TO VIAL0110-DCONTAB
           ELSE
              PERFORM 2006-OBTEM-DATA-OPERACAO
                 THRU 2006-OBTEM-DATA-OPERACAO-EXIT
           END-IF.
      *
       2005-OBTEM-DATA-OPER-DFT-EXIT.
           EXIT.
      ******************************************************************
      *            2006-OBTEM-DATA-OPERACAO                            *
      ******************************************************************
       2006-OBTEM-DATA-OPERACAO.
      *
           MOVE '2006-OBTEM-DATA-OPERACAO' TO VIAL0015-CALLER-ID
           PERFORM VIAP0015-TRATA-DEBUG
              THRU VIAP0015-TRATA-DEBUG-EXIT

      * DATA DE OPERACAO
           INITIALIZE ARCL2405-COMMAREA.
           MOVE VIATK002-CAPLIC            TO ARCL2405-CAPLIC.

           PERFORM CALL-ARR02405
              THRU CALL-ARR02405-EXIT.

           MOVE '2006-OBTEM-DATA-OPERACAO' TO VIAL0015-CALLER-ID
           MOVE 'ETCL0002-IND-ERROS     '  TO VIAL0015-CAMPO-NM(1)
           MOVE  ETCL0002-IND-ERROS        TO VIAL0015-CAMPO-VLR(1)
           PERFORM VIAP0015-TRATA-DEBUG
              THRU VIAP0015-TRATA-DEBUG-EXIT

           IF ETCL0002-SEM-ERROS
              MOVE ARCL2405-DOPERACAO      TO VIAL0110-DOPERACAO
              MOVE ARCL2405-DCREDITO       TO VIAL0110-DCONTAB
           ELSE
      * Não necessita de formatar mais erros porque o ETCL0002 já vem
      * preenchido da rotina e vai ser tratado no director
              CONTINUE
           END-IF.
      *
       2006-OBTEM-DATA-OPERACAO-EXIT.
           EXIT.
      ******************************************************************
      *                  2010-OBTEM-FLIP-FLOP                          *
      ******************************************************************
       2010-OBTEM-FLIP-FLOP.
      *
           MOVE '2010-OBTEM-FLIP-FLOP    ' TO VIAL0015-CALLER-ID
           PERFORM VIAP0015-TRATA-DEBUG
              THRU VIAP0015-TRATA-DEBUG-EXIT

      * INDICADOR DE TABELA ATIVA (FLIP FLOP)
           INITIALIZE ARCL2305-COMMAREA.

           PERFORM CALL-ARR02305
              THRU CALL-ARR02305-EXIT.

           MOVE '2010-OBTEM-FLIP-FLOP    ' TO VIAL0015-CALLER-ID
           MOVE 'ETCL0002-IND-ERROS     '  TO VIAL0015-CAMPO-NM(1)
           MOVE  ETCL0002-IND-ERROS        TO VIAL0015-CAMPO-VLR(1)
           PERFORM VIAP0015-TRATA-DEBUG
              THRU VIAP0015-TRATA-DEBUG-EXIT

           IF ETCL0002-SEM-ERROS
              MOVE ARCL2305-IACTIVA        TO VIAL0110-IACTIVA
           ELSE
      * Não necessita de formatar mais erros porque o ETCL0002 já vem
      * preenchido da rotina e vai ser tratado no director
              CONTINUE
           END-IF.
      *
       2010-OBTEM-FLIP-FLOP-EXIT.
           EXIT.
      ******************************************************************
      *                       2020-OBTEM-TIMEZONE                      *
      ******************************************************************
       2020-OBTEM-TIMEZONE.
      *
           INITIALIZE VIAL1020-COMMAREA.
           MOVE VIAL0110-CAPLIC          TO VIAL1020-CAPLIC.

           CALL VIAL1020-NM-ROTINA USING VIAL1020-COMMAREA,
                                         ETCL0002-COMMAREA.

           IF ETCL0002-SEM-ERROS
              MOVE VIAL1020-HTIMEST(1:10)  TO VIAL0110-DTIMEZONE
              MOVE VIAL1020-HTIMEST(12:8)  TO VIAL0110-HTIMEZONE
           END-IF.
      *
       2020-OBTEM-TIMEZONE-EXIT.
           EXIT.
      ******************************************************************
      *                       3000-FIM-PROGRAMA                        *
      ******************************************************************
       3000-FIM-PROGRAMA.
      *
           CONTINUE.
      *
       3099-FIM-PROGRAMA-EXIT.
           EXIT.
      ******************************************************************
           COPY VIAP0015.
           EXEC SQL INCLUDE VIAP0003 END-EXEC.
           COPY ARCP2305.
           COPY ARCP2405.
      ******************************************************************
