      ***************************************************************
      * DESCRICAO: VARIAVEL DO CURRENT TIMESTAMP
      * CRICAO:    05-11-2010
      * AUTOR:     VIA CONSULTING
      ***************************************************************
       01 VIAW0120-VARIAVEIS.
          05 VIAW0120-TIMESTAMP                 PIC X(26).
          05 VIAW0120-TIMERED REDEFINES VIAW0120-TIMESTAMP.
             10 VIAW0120-ANO                    PIC 9(04).
             10 FILLER                          PIC X(01).
             10 VIAW0120-MES                    PIC 9(02).
             10 FILLER                          PIC X(01).
             10 VIAW0120-DIA                    PIC 9(02).
             10 FILLER                          PIC X(01).
             10 VIAW0120-HORA                   PIC 9(02).
             10 FILLER                          PIC X(01).
             10 VIAW0120-MINUTO                 PIC 9(02).
             10 FILLER                          PIC X(01).
             10 VIAW0120-SEGUNDO                PIC 9(02).
             10 FILLER                          PIC X(01).
             10 VIAW0120-FRACCAO.
                15 VIAW0120-FRACCAO-1           PIC 9(02).
                15 VIAW0120-FRACCAO-2           PIC 9(04).
