      ******************************************************************
      *  FUNÇÃO:           WORKING ARQUITECTURA                       **
      *  AUTOR:            VIA CONSULTING                             **
      *  DESCRIÇÃO:        WORKING STANDARD DE MENSAGENS EXTERNAS     **
      ******************************************************************
       01 VIAW0907-DATA.
         05 VIAW0907-AREA-ERRO.
           10 VIAW0907-IND-ERROS               PIC  X(02).
              88 VIAW0907-ABEND                  VALUE 'A1'.
              88 VIAW0907-ABEND-DB2              VALUE 'A2'.
              88 VIAW0907-ERROS-ARQ              VALUE 'AT'.
              88 VIAW0907-ERROS-VALIDOS          VALUE 'FU' 'FC' 'OK'.
              88 VIAW0907-ERROS-FUNCAO           VALUE 'FU'.
              88 VIAW0907-FIM-CONSULTA           VALUE 'FC'.
              88 VIAW0907-SEM-ERROS              VALUE 'OK' '  '.
              88 VIAW0907-ERROS-ABEND            VALUE 'A1' 'A2'.
           10 VIAW0907-NR-ERRO                 PIC S9(04) COMP-3.
           10 VIAW0907-CAPLIC-ERRO             PIC  X(02).
           10 VIAW0907-GINFO-ERRO              PIC  X(40).
           10 VIAW0907-ST-ERRO                 PIC S9(04) COMP-3.
           10 VIAW0907-COD-ERRO-B              PIC  X(07).
           10 VIAW0907-WRMG                    PIC  X(80).
           10 VIAW0907-TABLE-NAME              PIC  X(16)
