      ***************************************************************
      * DESCRICAO: OBTEM DATA E HORA DE SISTEMA
      * AUTOR:     VIA CONSULTING
      ***************************************************************
       01 VIAW0057-AREA.
          05 VIAW0057-DATE                  PIC 9(08) VALUE ZEROES.
          05 VIAW0057-TIME                  PIC 9(08) VALUE ZEROES.
          05 VIAW0057-DATE-OUT              PIC X(10) VALUE SPACES.
          05 VIAW0057-TIME-OUT              PIC X(08) VALUE SPACES.
