      ***************************************************************
      * DESCRICAO: TRATA ERROS BANKA
      * CRICAO:    17-03-2011
      * AUTOR:     VIA CONSULTING
      ***************************************************************
       01 VIAW0059-ERROS-BANKA.
          05 VIAW0059-MSG-TOT-OCC              OCCURS 10 TIMES.
            10 VIAW0059-MSG-TOT             PIC  X(40) VALUE SPACES.
            10 FILLER REDEFINES VIAW0059-MSG-TOT.
              15 VIAW0059-MSG              PIC  X(07) VALUE SPACES.
              15 FILLER                    PIC  X(33) VALUE SPACES.
      *
            10 FILLER REDEFINES VIAW0059-MSG-TOT.
              15 VIAW0059-MSG-INI          PIC  X(05) VALUE SPACES.
              15 FILLER                    PIC  X(01) VALUE SPACES.
              15 VIAW0059-MSG-CONTA        PIC  X(14) VALUE SPACES.
              15 FILLER                    PIC  X(01) VALUE SPACES.
              15 VIAW0059-MSG-FIM          PIC  X(11) VALUE SPACES.
              15 FILLER                    PIC  X(08) VALUE SPACES.
          05 VIAW0059-MSGQ                PIC  X(10) VALUE SPACES.
          05 VIAW0059-CONTA               PIC S9(14) VALUE ZEROES.
          05 VIAW0059-INDEX               PIC S9(05) VALUE ZEROES.
          05 VIAW0059-IX-O                PIC S9(05) VALUE ZEROES.
          05 VIAW0059-COD-ERR             PIC S9(04) VALUE ZEROES.
