      ******************************************************************
      * VIAW0021 - VALIDA SE UM DETERMINADO ANO E BISSEXTO             *
      ******************************************************************
       01  VIAW0021-VARIAVEIS.
           05 VIAW0021-ANO                  PIC  9(04) VALUE ZEROS.
           05 VIAW0021-QUOCIENTE            PIC  9(04) VALUE ZEROS.
           05 VIAW0021-VAR1                 PIC  9(03) VALUE ZEROS.
           05 VIAW0021-VAR2                 PIC  9(03) VALUE ZEROS.
           05 VIAW0021-VAR3                 PIC  9(03) VALUE ZEROS.
           05 VIAW0021-IBISSEXTO            PIC  X(01) VALUE SPACES.
              88 VIAW0021-BISSEXTO                     VALUE 'S'.
