      ***************************************************************
      * DESCRICAO: TRATA ERROS BANKA
      * CRICAO:    17-03-2011
      * AUTOR:     VIA CONSULTING
      ***************************************************************
       01 VIAW0040-ERROS-BANKA.
          05 VIAW0040-MSG-TOT             PIC  X(40) VALUE SPACES.
          05 FILLER REDEFINES VIAW0040-MSG-TOT.
             10 VIAW0040-MSG              PIC  X(07) VALUE SPACES.
             10 FILLER                    PIC  X(33) VALUE SPACES.
      *
          05 FILLER REDEFINES VIAW0040-MSG-TOT.
             10 VIAW0040-MSG-INI          PIC  X(05) VALUE SPACES.
             10 FILLER                    PIC  X(01) VALUE SPACES.
             10 VIAW0040-MSG-CONTA        PIC  X(14) VALUE SPACES.
             10 FILLER                    PIC  X(01) VALUE SPACES.
             10 VIAW0040-MSG-FIM          PIC  X(11) VALUE SPACES.
             10 FILLER                    PIC  X(08) VALUE SPACES.
          05 VIAW0040-MSGQ                PIC  X(10) VALUE SPACES.
          05 VIAW0040-CONTA               PIC S9(14) VALUE ZEROES.
          05 VIAW0040-INDEX               PIC S9(05) VALUE ZEROES.
          05 VIAW0040-COD-ERR             PIC S9(04) VALUE ZEROES.
          05 VIAW0040-CAPLIC-ERRO         PIC  X(02) VALUE SPACES.
