      ***************************************************************
      * DESCRICAO: TRATA ERROS BANKA
      * CRICAO:    17-03-2011
      * AUTOR:     VIA CONSULTING
      ***************************************************************
       01 VIAW0055-ERROS-BANKA.
          05 VIAW0055-MSG-TOT             PIC  X(40) VALUE SPACES.
          05 FILLER REDEFINES VIAW0055-MSG-TOT.
             10 VIAW0055-MSG              PIC  X(07).
             10 FILLER                    PIC  X(33).
      *
          05 FILLER REDEFINES VIAW0055-MSG-TOT.
             10 VIAW0055-MSG-INI          PIC  X(05).
             10 FILLER                    PIC  X(01).
             10 VIAW0055-MSG-CONTA        PIC  X(14).
             10 FILLER                    PIC  X(01).
             10 VIAW0055-MSG-FIM          PIC  X(11).
             10 FILLER                    PIC  X(08).
          05 VIAW0055-MSGQ                PIC  X(10) VALUE SPACES.
          05 VIAW0055-CONTA               PIC S9(14) VALUE ZEROES.
          05 VIAW0055-INDEX               PIC S9(05) VALUE ZEROES.
          05 VIAW0055-COD-ERR             PIC S9(04) VALUE ZEROES.
